package config

import (
	"fmt"
	// "time"
	// "log"
	"github.com/helloeve02/CPE681012/entity"
	"gorm.io/driver/sqlite"
	"gorm.io/gorm"
)

var db *gorm.DB

// DB returns the database connection instance
func DB() *gorm.DB {
	return db
}

// ConnectionDB initializes the database connection
func ConnectionDB() {
	database, err := gorm.Open(sqlite.Open("nutrition.db?cache=shared"), &gorm.Config{})
	if err != nil {
		panic("failed to connect database")
	}
	fmt.Println("connected database")
	db = database
}

func SetupDatabase() {
	// Automigrate Tables
	err := db.AutoMigrate(
		&entity.Menu{},
		&entity.MenuImage{},
		&entity.Admin{},
		&entity.DiseaseTag{},
		&entity.Disease{},
		&entity.EducationalContent{},
		&entity.FiveFoodGroups{},
		&entity.Ingredients{},
		&entity.Tag{},
	)
	if err != nil {
		panic("failed to migrate database: " + err.Error())
	}
	fmt.Println("Database tables migrated successfully")

	Menu := []entity.Menu{
		{
			Title: "ยำถั่วฝักยาว/มะเขือ",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
		- ถั่วฝักยาวลวกพอสุกหั่นเป็นท่อนสั้น: 4 ฝัก (40 กรัม)
		- มะเขือผ่อย หรือมะเขือเปราะลวกพอสุกหั่นเป็นชิ้นเล็ก: 2 ช้อนโต๊ะ (30 กรัม)
		- มะเขือพวงลวกสุก: 15 เม็ด (15 กรัม)
		- หมูไม่ติดมันบด: 1 ช้อนโต๊ะ (15 กรัม)
		- น้ำมันรำข้าว: 2 ช้อนชา (10 กรัม)
		- กระเทียม: 3 กลีบ (7.5 กรัม)
		- หอมแดง: 2 หัวเล็ก (10 กรัม)
		- พริกหนุ่มเม็ดใหญ่: 4 เม็ด (40 กรัม)
		- น้ำเห็ดหอม: 50 ซีซี (50 กรัม)
		- กะปิ: 1/2 ช้อนชา (2.5 กรัม)
		- รากผักชี: 3 ราก (6 กรัม)
		- ต้นหอม / ผักชี / ใบแมงลัก: เล็กน้อยสำหรับตกแต่งอาหาร

		วิธีทำ
		1. โขลกพริกหนุ่ม กระเทียม หอมแดง รากผักชี ให้เข้ากัน
		2. ใส่กะปิ โขลกรวมกัน จากนั้นใส่ถั่วฝักยาว มะเขือเปราะ และมะเขือพวง โขลกให้เข้ากัน
		3. ผัดเครื่องแกงที่โขลกไว้กับน้ำมันรำข้าว
		4. ใส่หมูบดลงไป ผัดจนหมูสุกและเข้ากันดี
		5. ตักใส่จาน โรยหน้าด้วยต้นหอม ผักชี และใบแมงลักเพื่อความสวยงาม`,
		Region: "ภาคเหนือ",
		},
		{
			Title: "น้ำพริกอ่อง",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
	- หมูไม่ติดมันบด: 1 ช้อนโต๊ะ (15 กรัม)
	- มะเขือส้ม หรือมะเขือเทศลูกเล็กหั่นสี่เหลี่ยม: 1/2 ถ้วย (40 กรัม)
	- พริกแห้งเม็ดใหญ่ เอาทั้งเม็ด: 2 เม็ด (5 กรัม)
	- น้ำเปล่า: 1/4 ถ้วย (60 กรัม)
	- น้ำตาล: 1/4 ช้อนชา (1.25 กรัม)
	- กระเทียมปอกเปลือก: 3 กลีบ (7.5 กรัม)
	- หอมแดงปอกเปลือก: 1.5 หัว (7.5 กรัม)
	- กะปิ: 1/4 ช้อนชา (1.25 กรัม)
	- น้ำปลา: 1/5 ช้อนชา (1 กรัม)
	- น้ำมันรำข้าว: 1.5 ช้อนชา (7.5 กรัม)
	- มะขามเปียก: 1 ช้อนชา (5 กรัม)
	- แตงกวา: 1 ลูก (40 กรัม)
	- มะเขือเปราะ: 1 ลูก (25 กรัม)
	- ผักกาดขาวปลี: 2 ก้าน (20 กรัม)
	- ผักชีหั่นฝอย: เล็กน้อยสำหรับตกแต่งอาหาร

	วิธีทำ
	1. นำพริกแห้งเม็ดใหญ่แช่น้ำให้นิ่ม
	2. โขลกพริกแห้ง กระเทียม หอมแดง กะปิ ให้ละเอียด
	3. ใส่มะเขือเทศลูกเล็ก คนให้เข้ากันรวมกับเครื่องแกงในข้อ 2
	4. ผัดเครื่องแกงที่โขลกไว้กับน้ำมันให้หอม ใส่หมูบดผัดให้สุก ใส่น้ำ
	5. ปรุงรสด้วยน้ำปลา และน้ำมะขามเปียก
	6. ตักใส่ถ้วย แต่งหน้าด้วยผักชี รับประทานกับผักสด`,
	Region: "ภาคเหนือ",
		},
		{
			Title: "แกงแคไก่บ้าน",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
	- เนื้ออกไก่หั่นเป็นชิ้นขนาดพอคำ: 1 ช้อนโต๊ะ (15 กรัม)
	- ถั่วฝักยาว: 2 ฝัก (20 กรัม)
	- มะเขือผ่อย หรือมะเขือเปราะ: 1 ลูก (25 กรัม)
	- มะเขือพวง: 10 ลูก (10 กรัม)
	- ใบชะพลู: 3 ใบ (5 กรัม)
	- ชะอมเด็ดยอดอ่อน: 2 ช้อนชา (5 กรัม)
	- ใบพริกอ่อน: 2 ช้อนโต๊ะ (5 กรัม)
	- พริกขี้หนูแห้ง: 3 เม็ดเล็ก (2.5 กรัม)
	- กระเทียม: 4 กลีบ (10 กรัม)
	- หอมแดง: 4 หัวเล็ก (20 กรัม)
	- กะปิ: 1/2 ช้อนชา (2.5 กรัม)
	- น้ำเห็ดหอมสดต้มเคี่ยว 1 ชั่วโมง: 150 ซี.ซี. (150 กรัม)

	วิธีทำ
	1. โขลกพริกขี้หนูแห้ง กระเทียม หอมแดง และกะปิให้ละเอียดจนเข้ากัน
	2. ตั้งน้ำเห็ดหอมให้เดือด แล้วใส่เครื่องแกงที่โขลกไว้ลงไป
	3. ใส่เนื้อไก่ลงต้มจนเริ่มสุก จากนั้นใส่ผักที่สุกยาก เช่น ถั่วฝักยาว มะเขือเปราะ
	4. เมื่อน้ำเดือดอีกครั้ง ใส่ผักสุกง่าย เช่น ใบชะพลู ชะอม ใบพริกอ่อน
	5. รอให้เดือดอีกครั้ง แล้วยกลงจากเตา ตักเสิร์ฟร้อน ๆ`,
	Region: "ภาคเหนือ",
		},
		{
			Title: "แกงส้มตูนปลานิล",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
	- ก้านตูนเด็ดเป็นท่อนขนาด 1/2 นิ้ว: 3/4 ถ้วยตวง (60 กรัม)
	- เนื้อปลานิล: 1 ช้อนโต๊ะ (15 กรัม)
	- ยอดอ่อนตำลึง: 1/2 ถ้วยตวง (15 กรัม)
	- มะเขือส้มหรือมะเขือเทศลูกเล็กผ่า: 1/3 ถ้วยตวง (30 กรัม)
	- น้ำมะกรูด: 3 ลูก (15 กรัม)
	- พริกขี้หนูสด: 7 เม็ด (3 กรัม)
	- หอมแดง: 4 หัว (20 กรัม)
	- กระเทียม: 6 กลีบ (15 กรัม)
	- กะปิ: 1/2 ช้อนชา (2.5 กรัม)
	- ขมิ้น: 1 แว่น (2 กรัม)
	- น้ำเปล่า: 200 ซี.ซี. (200 กรัม)

	วิธีทำ
	1. โขลกพริกขี้หนูสด หอมแดง กระเทียม และกะปิรวมกันให้ละเอียด
	2. ใส่ขมิ้นลงไปโขลกรวมกันอีกครั้งจนเนียน
	3. ต้มน้ำให้เดือด แล้วใส่เครื่องแกงที่โขลกไว้ลงไป
	4. ใส่เนื้อปลานิล ก้านตูน และยอดตำลึงลงไปต้มจนสุก
	5. ปรุงรสด้วยน้ำมะกรูดก่อนยกลง ตักใส่ถ้วยพร้อมเสิร์ฟ`,
	Region: "ภาคเหนือ",
		},
		{
			Title: "จอผักกาด",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
	- ผักกาดจ้อน หรือดอกผักกวางตุ้งหั่นเป็นท่อน: 3/4 ถ้วยตวง (80 กรัม)
	- หมูไม่ติดมัน: 1 ช้อนโต๊ะ (15 กรัม)
	- น้ำเห็ดหอมสด: 3/4 ถ้วยตวง (180 กรัม)
	- กะปิ: 1/4 ช้อนชา (1.25 กรัม)
	- กระเทียมสับหยาบ: 2 กลีบ (5 กรัม)
	- หอมแดงปอกเปลือกทุบพอแตก: 1 หัว (5 กรัม)
	- พริกขี้หนูแห้ง: 5 เม็ด (5 กรัม)
	- น้ำมะขามเปียก: 3 ช้อนโต๊ะ (45 กรัม)
	- น้ำตาลปี๊บ: 3/4 ช้อนชา (3.75 กรัม)
	- น้ำมันรำข้าว: 2 ช้อนชา (10 กรัม)

	วิธีทำ
	1. เจียวกระเทียมพอเหลือง ตักขึ้นพักไว้ แล้วทอดพริกขี้หนูแห้งให้กรอบ
	2. ผัดกะปิกับน้ำมันที่เหลือให้หอม แล้วใส่หมูลงผัดพอสุก จากนั้นตักใส่หม้อ
	3. เติมน้ำเห็ดหอมลงในหม้อ รอให้เดือดแล้วใส่ผักกวางตุ้ง เคี่ยวจนผักเปื่อยนุ่ม
	4. ใส่พริกทอด 2 เม็ดลงเคี่ยวพร้อมผัก ปรุงรสด้วยน้ำมะขามเปียกและน้ำตาลปี๊บ คนให้เข้ากัน
	5. ตักใส่ถ้วย โรยหน้าด้วยกระเทียมเจียว และแต่งหน้าด้วยพริกทอดที่เหลือ`,
	Region: "ภาคเหนือ",
		},
		{
			Title: "ลาบคั่ว",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
	- ไข่ขาวเบอร์ 2: 4 ฟอง (140 กรัม)
	- วุ้นเส้น: 1 ห่อ (50 กรัม)
	- แป้งมัน: 5 ช้อนโต๊ะ (25 กรัม)
	- รากผักชีโขลกละเอียด: 5 ราก (10 กรัม)
	- ต้นหอมหั่น: 1.5 ช้อนโต๊ะ (15 กรัม)
	- ผักชีหั่น: 3 ช้อนโต๊ะ (15 กรัม)
	- ขิงแก่หั่นฝอย: 3 ช้อนโต๊ะ (45 กรัม)
	- กระเทียมปอกสับ: 6 กลีบ (15 กรัม)
	- น้ำมันรำข้าว: 5 ช้อนชา (25 กรัม)
	- ซีอิ๊วขาว: 1 ช้อนชา (5 กรัม)
	- น้ำตาล: 1.5 ช้อนชา (7.5 กรัม)
	- น้ำมะนาว: 4 ช้อนชา (20 กรัม)
	- เครื่องเทศลาบ: 1 ช้อนชา (5 กรัม)
	- น้ำเห็ดหอมต้ม: 150 ซี.ซี. (150 กรัม)
	- ผักกาดขาว: 5 ก้าน (150 กรัม)

	วิธีทำ
	1. นำวุ้นเส้นแช่น้ำให้นิ่มมาตัดและสับ ผสมไข่ขาวให้เข้ากันแล้วร่อนแป้งมันทีละน้อย คนให้เข้ากัน
	2. นำถาดสำหรับนึ่งไข่ทาน้ำมันให้ทั่ว เทส่วนผสมข้อ 1 ลงไป แล้วนำไปนึ่งประมาณ 20 นาทีให้สุก พักให้เย็น แล้วแกะออกมาหั่นเป็นสี่เหลี่ยมเล็ก
	3. ผสมเครื่องเทศลาบ คลุกเคล้ากับส่วนผสมในข้อ 2 ให้ทั่ว
	4. เจียวขิงหั่นฝอยให้เหลืองตักพักไว้ในข้อ 3 จากนั้นนำน้ำมันที่เหลือเจียวกระเทียม ตักขึ้น และเจียวรากผักชีให้หอม
	5. นำส่วนผสมข้อ 3 ผัดต่อใส่น้ำเห็ดหอมผัดจนแห้ง ปรุงรสด้วยซีอิ๊วขาว ต้นหอม ผักชี
	6. ปิดไฟใส่น้ำมะนาวคนให้เข้ากันตักใส่จาน โรยด้วยต้นหอม ผักชีอีกเล็กน้อย รับประทานคู่กับผักกาดขาว`,
	Region: "ภาคเหนือ",
		},
		{
			Title: "ขนมจีนน้ำเงี้ยว",
			Description: `ส่วนประกอบพริกแกง (ต่อ 2 ที่)
	- พริกชี้ฟ้าแห้ง: 3 เม็ด (3 กรัม)
	- หอมแดง: 2 หัว (10 กรัม)
	- กระเทียม: 2 ช้อนชา (10 กรัม)
	- ตะไคร้ซอย: 1 ต้น (10 กรัม)
	- ข่าแก่: 5 แว่น (15 กรัม)
	- รากผักชี: 1 ต้น (2 กรัม)
	- เกลือป่น: 1/4 ช้อนชา (1 กรัม)

	ส่วนประกอบ (ต่อ 2 ที่)
	- น้ำมันรำข้าว: 2 ช้อนชา (10 กรัม)
	- เนื้อหมูสับ: 4 1/3 ช้อนโต๊ะ (65 กรัม)
	- น้ำเปล่า: 400 มิลลิลิตร (400 มิลลิลิตร)
	- ดอกงิ้ว: 4 ดอก (2 กรัม)
	- มะเขือเทศ: 5 ลูก (120 กรัม)
	- ขนมจีน: 2 จับ (18 กรัม)
	- น้ำปลา: 1/2 ช้อนชา (2 กรัม)

	วิธีทำ
	1. โขลกส่วนผสมพริกแกงให้เข้ากัน
	2. ใส่น้ำมันพืชในหม้อตั้งไฟพอร้อน ใส่น้ำพริกแกงลงผัดจนหอม
	3. ผัดเนื้อหมูจนสุก และเข้ากันดี
	4. ใส่น้ำเปล่าลงไป หรี่ไฟแล้วเคี่ยวจนเดือด และมีกลิ่นหอม จากนั้นใส่ดอกงิ้ว และมะเขือเทศ เคี่ยวจนเข้ากัน
	5. จัดเสิร์ฟ พร้อมกะหล่ำปลีซอย กระเทียมเจียว หากชอบรสเปรี้ยวสามารถปรุงรสด้วยน้ำมะนาวตามชอบ`,
	Region: "ภาคเหนือ",
		},
		{
			Title: "ตำขนุน",
			Description: `ส่วนประกอบพริกแกง (ต่อ 2 ที่)
  - พริกขี้หนูแห้ง: 3 เม็ด (3 กรัม)
  - กระเทียม: 3 กลีบ (6 กรัม)
  - หอมแดง: 1 หัว (6 กรัม)
  - ข่าหั่น: 1 แว่น (3 กรัม)
  - ตะไคร้ซอย: 1 ต้น (3 กรัม)
  - กะปิ: 1/4 ช้อนชา (2 กรัม)

  ส่วนประกอบ (ต่อ 2 ที่)
  - ขนุนอ่อน: 2 ชิ้น (100 กรัม)
  - เนื้อหมูสับ: 2 ช้อนโต๊ะ (40 กรัม)
  - มะเขือเทศ: 2 ลูก (15 กรัม)
  - ใบมะกรูด: 2 ใบ (1 กรัม)
  - กระเทียมเจียว: 1 ช้อนชา (5 กรัม)
  - ผักชีซอย: 1 กรัม
  - ต้นหอมซอย: 3 กรัม
  - พริกขี้หนูแห้งทอด: 1 เม็ด (1 กรัม)
  - น้ำมันรำข้าว: 2 ช้อนชา (10 กรัม)
  - กระเทียมสับ: 1 ช้อนชา (5 กรัม)
  - น้ำปลา: 1/2 ช้อนชา (2 กรัม)

  วิธีทำ
  1. หั่นขนุนอ่อนตามขวาง นำไปต้มให้เปื่อย ตักขึ้นพักไว้
  2. โขลกขนุนให้ละเอียดแล้วพักไว้ จากนั้นโขลกส่วนประกอบของพริกแกงรวมกันให้ละเอียด
  3. นำพริกแกง เนื้อหมูสับ มะเขือเทศ และขนุนมาโขลกรวมกัน
  4. เจียวกระเทียมพอเหลือง ใส่ส่วนผสมที่โขลกรวมกันแล้วลงผัดให้หอม
  5. เมื่อเนื้อหมูสุกดีแล้ว ใส่ใบมะกรูด ตามด้วยผักชี ต้นหอมซอย ลงผัดให้เข้ากัน`,
  Region: "ภาคเหนือ",
		},
		{
			Title: "น้ำพริกมะเขือเทศ",
			Description: `ส่วนประกอบพริกแกง (ต่อ 1 ที่)
  - มะเขือเทศย่างไฟ: 3 ลูก (50 กรัม)
  - พริกหนุ่มย่างไฟ: 3 เม็ด (40 กรัม)
  - หอมแดงย่างไฟ: 3 หัว (15 กรัม)
  - กระเทียมย่างไฟ: 4 กลีบ (8 กรัม)
  - น้ำปลา: 1/3 ช้อนชา (1.5 กรัม)
  - ไข่ต้ม: 1/2 ฟอง (25 กรัม)
  - ถั่วฝักยาว: 2 ฝัก (20 กรัม)
  - กะหล่ำปลี: 1/6 ลูก (20 กรัม)

  วิธีทำ
  1. ย่างมะเขือเทศ พริกหนุ่ม หอมแดง กระเทียม ให้สุกทั่วกัน
  2. ลอกเปลือกที่ไหม้ออก
  3. หากต้องการเผ็ดน้อย ควรเอาไส้พริกหนุ่มออก
  4. โขลกพริกหนุ่ม มะเขือเทศ หอมแดง กระเทียม ทั้งหมดให้เข้ากัน ปรุงรสด้วยน้ำปลา
  5. หากชอบรสเปรี้ยว ให้ปรุงรสด้วยน้ำมะนาวเล็กน้อย รับประทานแนมกับผักลวก และไข่ต้ม`,
  Region: "ภาคเหนือ",
		},
		{
			Title: "แอ๊บหมู",
			Description: `ส่วนประกอบพริกแกง (ต่อ 2 ที่)
- น้ำพริกแกงเผ็ด: 1 ช้อนชาพูน (7 กรัม)
- เนื้อหมูสับ: 3 ช้อนโต๊ะ (50 กรัม)
- ผักกาดขาว: 1 ก้าน (20 กรัม)
- เห็ดหูหนู: 3 ดอก (15 กรัม)
- โหระพา: 1 กิ่ง (5 กรัม)
- ผักชีฝรั่ง ใบมะกรูด: เล็กน้อย

วิธีทำ
1. ผสมน้ำพริกแกงเผ็ดกับหมูสับให้เข้ากัน
2. ซอยเห็ดหูหนู ผักชีฝรั่ง ใบมะกรูด ผสมคลุกเคล้ากับเนื้อหมู
3. ตัดใบตองซ้อนกันสองชั้น รองด้วยผักกาดขาวและโหระพา
4. ตักส่วนผสมใส่ห่อใบตอง ใช้ไม้กลัดนำไปย่างหรืออบจนสุก`,
Region: "ภาคเหนือ",
		},
		{
			Title: "ต้มโคล้งปลาช่อน",
			Description: `ส่วนประกอบพริกแกง (ต่อ 1 ที่)
- เนื้อปลาช่อนสด: 1 ช้อนโต๊ะ (25 กรัม)
- กระเทียม, ข่า, กระชาย, หอมแดง: อย่างละ 3 กรัม (รวม 18 กรัม)
- ตะไคร้, พริกบางใหญ่แห้ง
- มะเขือเทศราชินี, เห็ดนางฟ้า: 1/2 ทัพพี (40 กรัม)
- ใบมะกรูด, ใบกะเพรา, ผักชีฝรั่ง: อย่างละ 2-3 ใบ (รวม 5 กรัม)
- น้ำมะนาว: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำปลา: 1/4 ช้อนชา (1.25 กรัม)
- น้ำสะอาด: 200 มิลลิลิตร

วิธีทำ
1. นำหอม, กระเทียม, ข่า, กระชาย, ตะไคร้, พริก คั่วด้วยไฟปานกลางจนหอมและเกรียมเล็กน้อย
2. ตั้งน้ำให้เดือด ใส่เครื่องสมุนไพรที่คั่วไว้ มะเขือเทศ และเห็ดนางฟ้าลงต้มต่อจนเดือด
3. ใส่เนื้อปลาช่อนหั่นชิ้นบางลงในน้ำซุป ต้มต่อจนสุก
4. จัดใบมะกรูด, ใบกะเพรา, ผักชีฝรั่ง, น้ำมะนาว, น้ำปลา ลงในภาชนะ
5. ตักต้มโคล้งใส่ลงไป รับประทานกับข้าวสวยร้อน ๆ`,
Region: "ภาคกลาง",
		},
		{
			Title: "แกงส้มเปลือกแตงโมกุ้งสด",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
- เนื้อกุ้งสดขนาดกลาง: 3 ตัว (15 กรัม) (ปอกเปลือก ผ่าหลัง)
- เนื้อปลาช่อน: 1/2 ช้อนโต๊ะ (10 กรัม)
- เปลือกแตงโม: 1 ทัพพี (80 กรัม) (เอาเฉพาะส่วนเนื้อขาว หั่นชิ้นพอดีคำ)
- พริกชี้ฟ้าแห้ง: 3 ดอก (3 กรัม) (เอาเมล็ดออก หั่นท่อนเล็กๆ)
- หอมแดง: 1/2 ช้อนโต๊ะ (10 กรัม) (ปอกเปลือก หั่นเป็นชิ้นเล็ก)
- กระเทียม: 1 กลีบเล็ก (2 กรัม) (ปอกเปลือก หั่นเป็นชิ้นเล็ก)
- กระชาย: 1/2 ช้อนโต๊ะ (10 กรัม) (หั่นท่อนเล็ก)
- กะปิ: 1/2 ช้อนชา (3 กรัม)
- น้ำตาลปี๊บ: 1/2 ช้อนชา (3 กรัม)
- มะขามเปียก: 30 กรัม (ละลายเนื้อมะขาม 10 กรัมในน้ำ 3 ช้อนโต๊ะ)
- น้ำสะอาด: 1 ถ้วยตวง (240 มิลลิลิตร)

วิธีทำ
1. ต้มน้ำให้เดือด ใส่เนื้อปลาและกุ้งสด พอสุกตักขึ้นมาพักไว้
2. เตรียมน้ำพริกแกงโดยโขลกพริกแห้ง, กระชาย, กระเทียมพอละเอียด ใส่หอมแดงลงโขลกต่อจนละเอียด
3. ใส่กะปิและเนื้อปลาที่ต้มไว้ลงโขลกให้เข้ากัน จะได้น้ำพริกแกงส้มสำหรับ 1 ที่
4. ใส่น้ำพริกแกงและเปลือกแตงโมลงต้มจนเปลือกแตงโมนุ่ม
5. ปรุงรสด้วยน้ำตาลและน้ำมะขามเปียก ตามด้วยกุ้ง รอจนสุกพร้อมตักเสิร์ฟ`,
Region: "ภาคกลาง",
		},
		{
			Title: "ผัดฉ่าไข่ขาว",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
- ไข่ต้มสุกเอาแต่ไข่ขาว: 1 ฟอง (30 กรัม)
- พริกบางใหญ่แห้ง: 2 ดอก (10 กรัม)
- กระเทียม: 3 กลีบ
- พริกหนุ่มสดหั่นเฉลียงเป็นชิ้นใหญ่: 3 ดอก (20 กรัม)
- พริกชี้ฟ้าสด (เขียว/แดง/เหลือง): อย่างละ 1 ดอกเล็ก (รวม 10 กรัม) (เอาเมล็ดออก หั่นเฉลียงเป็นชิ้นพอสวย)
- ใบมะกรูด, ผักชีฝรั่ง (ฉีกเป็นชิ้นเล็ก): อย่างละ 2-3 ใบ (รวม 3 กรัม)
- ใบกะเพราเด็ด: 3 กรัม
- กระชายสด (ซอยเป็นเส้นพอสวย): 1 ช้อนโต๊ะ (15 กรัม)
- พริกไทยอ่อน: 3 ช่อเล็ก (10 กรัม)
- น้ำมันพืช: 3 ช้อนชา (15 กรัม)
- น้ำปลา: 1/4 ช้อนชา (1.25 กรัม)
- น้ำตาลปี๊บ: 1/3 ช้อนชา (2 กรัม)

วิธีทำ
1. หั่นไข่ขาวต้มสุก 1 ฟองเป็นลูกเต๋าขนาดพอสวย คั่วด้วยไฟปานกลางพอเป็นสีเหลืองนวล ตักขึ้นพักไว้
2. โขลกกระเทียมและพริกบางใหญ่แห้งจนละเอียดและเข้ากัน จากนั้นนำไปผัดในน้ำมันจนหอม ใส่ใบมะกรูด, กระชาย แล้วใส่ไข่ขาว ตามด้วยพริกหนุ่ม, พริกชี้ฟ้าสามสี, ใบมะกรูด, ผักชีฝรั่ง, ใบกะเพรา และพริกไทยอ่อน ผัดให้เข้ากัน (ถ้าแห้ง เติมน้ำเปล่าพอขลุกขลิก)
3. ปรุงรสด้วยน้ำตาล, น้ำปลา แล้วจึงใส่ผักชีฝรั่งและใบกะเพรา ยกลงพร้อมเสิร์ฟ`,
Region: "ภาคกลาง",
		},
		{
			Title: "หลนกุ้ง ผักสด",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
- เนื้อกุ้งสด ปอกเปลือก สับหยาบๆ: 1 ช้อนโต๊ะ (20 กรัม)
- น้ำกะทิ: 2 ช้อนโต๊ะ (30 กรัม)
- หอมแดงซอย: 1 ช้อนโต๊ะ (15 กรัม)
- พริกหนุ่มสด (พริกชี้ฟ้าสดเขียว/แดง/เหลือง): อย่างละ 1 ดอก (รวม 15 กรัม)
- ตะไคร้อ่อนซอยบาง: 2 ช้อนชา (10 กรัม)
- ใบมะกรูดอ่อนหั่นฝอย: 2 ช้อนชา (4 กรัม)
- มะขามเปียก: 10 กรัม (ละลายเนื้อมะขาม 10 กรัมในน้ำ 3 ช้อนโต๊ะ)
- น้ำตาลปี๊บ: 1/4 ช้อนชา (2 กรัม)
- เนื้อแตงกวาหั่น: 1/2 ลูก (20 กรัม)
- ขมิ้นขาวหั่น: 10 แว่น (20 กรัม)
- ผักกาดขาวหั่น: 1/2 ก้าน (10 กรัม)
- ถั่วฝักยาวหั่น: 1 ฝัก (10 กรัม)
- เกลือป่น: 1/8 ช้อนชา (0.5 กรัม)

วิธีทำ
1. เคี่ยวน้ำกะทิด้วยไฟปานกลาง ใส่กุ้งสับ พอสุก ใส่หอมแดงทั้งหมด, ตะไคร้ซอย 1 ช้อนชา, ใบมะกรูดซอย 1 ช้อนชา คลุกเคล้าให้เข้ากัน
2. ใส่พริกหนุ่ม, พริก 3 สี (เหลือไว้แต่งหน้าอย่างละ 2-3 ชิ้น) แล้วปรุงรสด้วยน้ำตาล, น้ำมะขามเปียก
3. พอสุก ตักใส่ถ้วย ตกแต่งโรยหน้าด้วยพริกสี, ตะไคร้ซอย, ใบมะกรูดซอย ตกแต่งด้วยผักให้สวยงาม`,
Region: "ภาคกลาง",
		},
		{
			Title: "ข้าวผัดเบญจรงค์",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
- ข้าวสวย: 1.5 ทัพพี (80 กรัม)
- สันในไก่หั่นลูกเต๋าเล็ก: 1 ช้อนโต๊ะ (30 กรัม)
- แครอทหั่นลูกเต๋าเล็ก: 1 ช้อนโต๊ะ (10 กรัม)
- หอมใหญ่หั่นลูกเต๋าเล็ก: 1 ช้อนโต๊ะ (10 กรัม)
- เห็ดหอมหั่นลูกเต๋าเล็ก: 1 ช้อนโต๊ะ (10 กรัม)
- เมล็ดข้าวโพดหวานต้มสุก: 1 ช้อนโต๊ะ (10 กรัม)
- ถั่วฝักยาวหั่นลูกเต๋าเล็ก: 1 ช้อนโต๊ะ (10 กรัม)
- แตงกวาหั่น: 1/2 ผลเล็ก (15 กรัม)
- ต้นหอม: 1 ต้นเล็ก (40 กรัม)
- น้ำมันรำข้าว: 2 ช้อนชา (10 กรัม)
- ซีอิ๊วขาว: 1/2 ช้อนชา (3 กรัม)
- พริกไทย: เล็กน้อย

วิธีทำ
1. ตั้งกระทะใส่น้ำมันบนไฟกลางพอร้อน ใส่หอมใหญ่, เห็ดหอมลงไปผัดพอหอม
2. ใส่สันในไก่, แครอท, ถั่วฝักยาว ผัดจนสุก และใส่เมล็ดข้าวโพดหวาน
3. ใส่ข้าวสวยปรุงรสด้วยซีอิ๊วขาว ผัดให้เข้ากัน ตักใส่จาน โรยด้วยพริกไทย ตกแต่งด้วยแตงกวา, ต้นหอม`,
Region: "ภาคกลาง",
		},
		{
			Title: "ปลาสามรส",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
- เนื้อปลากะพงหั่นเป็นชิ้น: 2 ช้อนโต๊ะ (25 กรัม)
- พริกชี้ฟ้าแดง: 2 เม็ด (10 กรัม)
- หอมใหญ่หั่นสี่เหลี่ยมเล็ก: 2 ช้อนโต๊ะ (20 กรัม)
- มะเขือเทศหั่นสี่เหลี่ยมเล็ก: 2 ช้อนโต๊ะ (20 กรัม)
- มันฝรั่งหั่นสี่เหลี่ยมเล็ก: 1 ช้อนโต๊ะ (10 กรัม)
- น้ำตาลปี๊บ: 1/2 ช้อนโต๊ะ (10 กรัม)
- น้ำมะขามเปียก: 2 ช้อนโต๊ะ (20 กรัม)
- กระเทียม: 1/2 ช้อนชา (2 กรัม)
- พริกไทย: 5 เม็ด (1 กรัม)
- น้ำมันรำข้าว: 2 ช้อนชา (10 กรัม)
- น้ำปลา: 1/2 ช้อนชา (2 กรัม)
- น้ำต้มสุก: 1/4 ถ้วยตวง (60 กรัม)
- ผักชีเด็ดใบสำหรับตกแต่ง

วิธีทำ
1. ตั้งกระทะให้ร้อน ทอดปลากะพงให้เหลือง ตักขึ้นพักไว้
2. โขลกกระเทียม, พริกไทย, พริกสดพอหยาบ ใส่น้ำซุปลงไปเล็กน้อย ผัดให้หอม
3. ใส่หอมใหญ่, มันฝรั่ง, มะเขือเทศ ปรุงรสด้วยน้ำตาลปี๊บ, น้ำมะขาม, น้ำปลา
4. นำปลาที่ทอดไว้จัดใส่จาน ราดซอสบนปลาที่ทอดแล้ว แต่งหน้าด้วยผักชีและพริกชี้ฟ้าแดง`,
Region: "ภาคกลาง",
		},
		{
			Title: "ยำใหญ่",
			Description: `ส่วนประกอบ (ต่อ 3 ที่)
- ไข่ขาวต้มปอกเปลือกผ่าสี่: 1 ฟอง (30 กรัม)
- ปลาหมึกสดหั่น: 1/4 ถ้วยตวง (40 กรัม)
- กุ้งสดปอกเปลือกผ่าหลัง: 3 ตัว (40 กรัม)
- แครอทฝานบางๆ: 1/2 ถ้วยตวง (20 กรัม)
- หอมใหญ่หั่น: 1/2 ถ้วยตวง (40 กรัม)
- หัวไชเท้าฝานบางๆ: 1/4 ถ้วยตวง (40 กรัม)
- แตงกวาฝานบางๆ: 1/2 ถ้วยตวง (40 กรัม)
- ขึ้นฉ่ายหั่น: 1/4 ถ้วยตวง (20 กรัม)

ส่วนประกอบน้ำปรุงรส (ต่อ 3 ที่)
- พริกชี้ฟ้าแดงโขลกหยาบ: 3 เม็ด (20 กรัม)
- น้ำมะนาว: 2 ช้อนโต๊ะ (30 กรัม)
- น้ำปลา: 1/2 ช้อนชา (3 กรัม)
- น้ำตาลทราย: 2 ช้อนชา (10 กรัม)
วิธีทำ
1. ลวกปลาหมึกสด, กุ้งสดในน้ำเดือด จากนั้นตักขึ้นพักไว้ให้สะเด็ดน้ำ
2. ผสมน้ำปลา, น้ำตาลทราย เติมน้ำเล็กน้อย คนพอเข้ากัน ใส่พริกสดที่โขลกละเอียดแล้ว จากนั้นเคี่ยวบนไฟพอเดือดทิ้งให้เย็น ใส่น้ำมะนาว
3. ผสมปลาหมึกสด, กุ้งสด, ไข่ขาว, แครอท, หอมใหญ่, แตงกวา, หัวไชเท้า และน้ำยำในข้อ 2 คลุกให้เข้ากัน จากนั้นตักใส่จาน ยกขึ้นเสิร์ฟ`,
Region: "ภาคกลาง",
		},

		{
			Title: "ต้มจับฉ่ายหมูสันนอก",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- หมูสันนอกหั่นชิ้น: 4 ช้อนโต๊ะ (60 กรัม)
- หัวไชเท้า: 1/2 ถ้วยตวง (50 กรัม)
- เห็ดฟาง: 1/2 ถ้วยตวง (50 กรัม)
- กะหล่ำปลี: 1/2 ถ้วยตวง (40 กรัม)
- ต้นกระเทียม: 1/2 ถ้วยตวง (30 กรัม)
- ผักโขม: 1/2 ถ้วยตวง (30 กรัม)
- ขึ้นฉ่าย: 1/2 ถ้วยตวง (30 กรัม)
- คะน้า: 1/2 ถ้วยตวง (30 กรัม)
- ผักกาดขาว: 1/2 ถ้วยตวง (30 กรัม)
- ผักกวางตุ้ง: 1/2 ถ้วยตวง (30 กรัม)
- กระเทียม: 10 กรัม
- น้ำมันรำข้าว: 2 ช้อนชา (10 กรัม)
- น้ำตาลปี๊บ: 1 ช้อนชา (5 กรัม)
- ซีอิ๊วดำ: 1/2 ช้อนชา (3 กรัม)
- ซีอิ๊วขาว: 1 ช้อนชา (5 กรัม)
- น้ำเปล่า: 3 ถ้วยตวง (750 กรัม)
  วิธีทำ
1. ล้างผักทุกชนิดด้วยน้ำสะอาด สะเด็ดน้ำให้แห้ง
2. หั่นผักทุกชนิดเป็นชิ้นใหญ่ๆ
3. ทุบกระเทียมพอแตก นำลงผัดในน้ำมันให้หอม ใส่เนื้อหมูลงผัด เคี่ยวหมูจนนุ่ม ใส่น้ำตาลปี๊บผัดให้หอมจนน้ำตาลละลาย
4. ใส่ซีอิ๊วขาว, ซีอิ๊วดำ ผัดไปเรื่อยๆ เติมผักที่หั่นลงไป ผัดต่อประมาณ 10 นาที
5. เติมน้ำต้มสุกให้ปริมาณน้ำต่ำกว่าผักเล็กน้อย ต้มไฟอ่อนๆ ต่อจนผักเปื่อย แล้วตักใส่ชามพร้อมเสิร์ฟ`,
Region: "ภาคกลาง",
		},

		{
			Title: "ผัดผักรวมไข่ขาว",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
- ไข่ไก่ไข่ขาว: 3 ช้อนโต๊ะ (30 กรัม)
- น้ำมันพืชสำหรับทอดไข่: 1 ช้อนชา (5 กรัม)
- ผักกาดขาว: 1 ถ้วยตวง (70 กรัม)
- ถั่วฝักยาวหั่นท่อน: 2 ช้อนโต๊ะ (20 กรัม)
- แครอทหั่นสี่เหลี่ยม: 1 ช้อนโต๊ะ (10 กรัม)
- กระเทียมสับ: 1 ช้อนชา (5 กรัม)
- ซีอิ๊วขาว: 1/4 ช้อนชา (1.25 กรัม)
- น้ำมันพืชสำหรับผัด: 1 ช้อนชา (5 กรัม)
วิธีทำ
1. ทอดไข่ขาวให้พอเหลือง หั่นเป็นสี่เหลี่ยม
2. ล้างผักต่างๆ ให้สะอาด
3. ตั้งไฟ เจียวกระเทียมให้เหลืองหอม ใส่ถั่วฝักยาว, แครอท, ผักกาดขาว, ไข่ขาว แล้วผัดให้สุก
4. ปรุงรสด้วยซีอิ๊วขาว คนให้เข้ากันพอสุกยกลง`,
Region: "ภาคกลาง",
		},

		{
			Title: "ไข่ยัดไส้กะเพราหอม",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
- ไข่ขาวดิบ: 4 1/2 ช้อนโต๊ะ (45 กรัม)
- นมสดพร่องมันเนย: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำมันพืชสำหรับผัด: 1 ช้อนชา (5 กรัม)
- กระเทียม: 1 ช้อนชา (5 กรัม)
- พริกขี้หนูสับ: 1/2 ช้อนชา (3 กรัม)
- หอมใหญ่: 1 ช้อนโต๊ะ (15 กรัม)
- เห็ดฟาง: 2 ช้อนโต๊ะ (20 กรัม)
- ใบกะเพรา: 1 ช้อนโต๊ะ (15 กรัม)
- ซีอิ๊วขาว: 1/5 ช้อนชา (1 กรัม)
- น้ำมันพืชสำหรับทอด: 1 ช้อนชา (5 กรัม)
วิธีทำ 
1. ตั้งกระทะใส่น้ำมันพอร้อน ใส่กระเทียมสับ, พริกขี้หนูสับ, หอมใหญ่ ผัดพอหอม ใส่เห็ดฟาง ผัดให้เข้ากันใส่ใบกะเพรา ปรุงรสด้วยซีอิ๊วขาว ยกลงพักไว้
2. ผสมไข่ขาวกับนมสดคนให้เข้ากัน
3. ตั้งกระทะพอร้อน ใส่ไข่ที่ผสมแล้ว ทอดแผ่ให้ทั่วกระทะใส่ส่วนผสมข้อที่ 1 วางตรงกลางไข่ เสร็จแล้วจึงค่อยๆ ห่อไข่เป็นรูปสี่เหลี่ยม พอสุกยกลงเสิร์ฟพร้อมผักต่างๆ`,
Region: "ภาคกลาง",
		},
		{
			Title: "ขนมจีนน้ำยาปักษ์ใต้",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- เนื้อปลาต้มหรือนึ่งสุก: 8 ช้อนโต๊ะ (120 กรัม) (ใช้ปลาช่อน หรือปลาทะเลเช่นปลาน้ำดอกไม้หรือปลาทูสด)
- น้ำพริกน้ำยาแกงปักษ์ใต้: 1 ช้อนโต๊ะ (15 กรัม)
- กะทิ: 1/2 ถ้วย (120 กรัม)
- น้ำเปล่า หรือหางกะทิ: 1.5 ถ้วย (360 กรัม)
- น้ำตาลปี๊บ: 1 ช้อนชา (5 กรัม)
- น้ำปลาดี: 1 ช้อนชา (5 กรัม)
- ใบมะกรูด (ฉีกเป็นชิ้นเล็ก): 5 ใบ (5 กรัม)
- ขนมจีน (คนละ 1.5 จับ หรือ 135 กรัม): 540 กรัม
- ผักเคียง: แตงกวาหั่นเป็นชิ้น 2 ลูก (50 กรัม), ถั่วฝักยาวหั่นเป็นท่อน 3 ผักใหญ่ (35 กรัม), ยอดมะม่วงหิมพานต์ 7 ยอด (40 กรัม)

วิธีทำ
1. นำเนื้อปลาต้มสุกแกะเอาแต่เนื้อมาโขลกรวมกันกับพริกแกงน้ำยาให้เป็นเนื้อเดียวกัน พักไว้
2. นำหางกะทิหรือน้ำเปล่า 1.5 ถ้วยตั้งไฟใช้ไฟปานกลาง คนให้เดือด ใส่เนื้อปลาที่โขลกรวมกับพริกแกง ละลายคนให้เข้ากัน
3. ใส่ใบมะกรูดที่ฉีกเป็นชิ้นเล็ก ๆ ลงในน้ำยา ปรุงรสด้วยน้ำตาลปี๊บ และน้ำปลาดี ชิมรส คนให้เข้ากัน เติมกะทิ 1/2 ถ้วย คนจนเดือด ยกลงเสิร์ฟพร้อมขนมจีน และผักเคียง

หมายเหตุ: กรณีผู้ป่วยเบาหวาน สามารถเพิ่มรสหวานโดยใส่น้ำตาลเทียมแทนน้ำตาลปี๊บและน้ำตาลทราย`,
Region: "ภาคใต้",
		},
		{
			Title: "น้ำพริกแกงปักษ์ใต้",
			Description: `ส่วนประกอบ (ต่อ 13 ช้อนโต๊ะ)
- พริกขี้หนูแห้ง: 22 เม็ด (18 กรัม)
- ตะไคร้หั่นซอย: 5 ต้น (50 กรัม)
- ขมิ้นสด: 2 แง่ง (40 กรัม)
- หอมแดงปอกเปลือก: 5 หัว (25 กรัม)
- กระเทียม: 40 กลีบ (50 กรัม)
- ข่าหั่นละเอียด: 5 แว่น (10 กรัม)
- ผิวมะกรูดหั่นซอยเป็นชิ้นเล็ก: 10 กรัม
- เกลือป่น: 1/2 ช้อนชา (2.5 กรัม)
- พริกไทยเม็ด: 15 เม็ด (15 กรัม)
- กะปิ: 4 ช้อนชา (20 กรัม)

วิธีทำ
1. นำทุกอย่างยกเว้นกะปิ โขลกรวมกันในครกให้ละเอียด
2. ใส่กะปิโขลกให้เข้ากันพักไว้เพื่อนำไปปรุงน้ำยา

หมายเหตุ: สูตรน้ำพริกนี้เมื่อทำเสร็จจะได้ 195 กรัม (13 ช้อนโต๊ะ) สามารถนำไปเป็นเครื่องปรุงน้ำพริกแกงคั่ว น้ำยาปักษ์ใต้ ผัดเผ็ด คั่วกลิ้ง หรือแกงไตปลา ฯลฯ`,
Region: "ภาคใต้",
		},
		{
			Title: "คั่วกลิ้งหมู",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- หมูเนื้อแดง บดละเอียด: 6 1/3 ช้อนโต๊ะ (100 กรัม)
- น้ำพริกแกงปักษ์ใต้: 4 ช้อนชา (20 กรัม)
- น้ำเปล่า: 1/4 ถ้วยตวง (60 กรัม)
- พริกไทยสด: 5 ช่อ (20 กรัม)
- ตะไคร้หั่นฝอย: 1 ช้อนโต๊ะ (15 กรัม)
- ข่าสดสับละเอียด: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำปลาดี: 1 ช้อนชา (5 กรัม)
- น้ำตาลปี๊บ: 1 ช้อนชา (5 กรัม)
- พริกชี้ฟ้าแดงหั่นเป็นเส้นสำหรับโรยหน้า: 1 เม็ด (3 กรัม)
- ใบมะกรูดหั่นฝอยละเอียด: 5 ใบ (5 กรัม)
- ผักสด: แตงกวาหั่นเป็นชิ้น 1 ผล (30 กรัม), ถั่วฝักยาว 3 ผัก (30 กรัม), ยอดมะม่วงหิมพานต์ 8 ยอด (40 กรัม), ยอดมันปู 5 ยอด (30 กรัม)

วิธีทำ
1. ใส่น้ำเปล่าลงในกระทะ ตั้งไฟพอร้อนใส่เนื้อหมูสับลงไปผัดจนเกือบสุก
2. จากนั้นใส่น้ำพริกคั่วกลิ้งลงไปผัดกับหมูสับให้เข้ากัน ปรุงรสด้วยน้ำตาลปี๊บ และน้ำปลา ผัดให้เข้ากัน
3. ปิดไฟแล้วใส่พริกไทยอ่อน, ตะไคร้หั่นฝอย ข่าสดสับ พริกชี้ฟ้าแดงหั่น และใบมะกรูดซอยลงไปผัดให้เข้ากัน ตักใส่จาน เสิร์ฟพร้อมกับผักสดตามชอบ`,
Region: "ภาคใต้",
		},
		{
			Title: "ต้มกะทิผักเหลียงกุ้งสด",
			Description: `ส่วนประกอบเครื่องปรุง (ต่อ 3 ที่)
- หอมแดง: 5 หัว (25 กรัม)
- กะปิ: 1 ช้อนชา (5 กรัม)
- พริกไทย: 20 เม็ด (8 กรัม)

ส่วนประกอบต่อ 3 ที่
- กะทิคั้น: 1/2 ถ้วยตวง (120 กรัม)
- น้ำเปล่าหรือหางกะทิ: 1 ถ้วยตวง (240 กรัม)
- ผักเหลียงเด็ดเอาแต่ใบ: 100 กรัม
- กุ้งสดปอกเปลือก หั่นเป็นชิ้นสั้นขนาด 1 ซม.: 8 ตัว (80 กรัม)
- น้ำตาลปี๊บ: 1 ช้อนชา (5 กรัม)
- น้ำปลาดี: 1/2 ช้อนชา (2.5 กรัม)

วิธีทำ
1. ล้างผักเหลียงให้สะอาด สะเด็ดน้ำ เด็ดเอาแต่ใบ หากใบใหญ่ให้ฉีกให้เล็กลง
2. โขลกหอมแดง กะปิ พริกไทย จนละเอียด และเข้ากัน
3. นำหางกะทิตั้งไฟพอใกล้เดือดใส่เครื่องปรุงรสที่โขลกละลายคนให้เข้ากัน
4. พอเดือดใส่ใบผักเหลียง กะทิ น้ำตาลปี๊บ น้ำปลาดี เมื่อน้ำเดือด เคี่ยวต่อสักพัก
5. หมั่นคนกะทิบ่อยๆ อย่าให้กะทิแตกมัน
6. ใส่กุ้งสด เร่งไฟให้แรง จะช่วยป้องกันผักเหม็นเขียวได้ เติมหัวกะทิคนไม่ให้กะทิแตกมัน เมื่อกะทิเดือดอีกครั้ง ยกลงตักเสิร์ฟ`,
Region: "ภาคใต้",
		},
		{
			Title: "ผัดผักเหลียงไข่ขาว",
			Description: `ส่วนประกอบ (ต่อ 3 ที่)
- ผักเหลียง: 2 กำ (120 กรัม)
- ไข่ขาว: 3 ฟอง (105 กรัม)
- น้ำตาลทราย: 1 ช้อนชา (5 กรัม)
- น้ำมันหอย: 1 ช้อนชา (5 กรัม)
- ซีอิ๊วขาว: 1/2 ช้อนชา (2.5 กรัม)
- พริกไทยป่น: 1/2 ช้อนชา (2.5 กรัม)
- กระเทียมสับละเอียด: 2 ช้อนชา (10 กรัม)
- น้ำมันพืช: 3 ช้อนชา (15 กรัม)
- น้ำเปล่า: 6 ช้อนโต๊ะ (90 กรัม)

วิธีทำ
1. ล้างผักเหลียงให้สะอาด สะเด็ดน้ำ เด็ดเอาแต่ใบ หากใบใหญ่ให้ฉีกให้เล็กลง
2. ตอกไข่ไก่แยกไข่ขาว-ไข่แดง เติมน้ำเปล่า 50 ซีซี ตีผสมให้เข้ากันแล้วพักไว้
3. ตั้งกระทะ ใส่น้ำมัน ตั้งไฟกลาง รอน้ำมันอุ่น จากนั้นนำกระเทียมลงไปเจียวพอหอม หรือเริ่มเหลือง
4. เทไข่ขาวลงในกระทะคนให้สุก ใส่ใบเหลียงลงไป พร้อมน้ำเปล่า 30 ซีซี ผัดให้สุก
5. ใส่เครื่องปรุงรส น้ำมันหอย ซีอิ๊วขาว น้ำตาลทราย คนให้เข้ากันยกลงตักเสิร์ฟ
6. โรยหน้าด้วยพริกไทยป่น`,
Region: "ภาคใต้",
		},
		{
			Title: "แกงเหลืองสับปะรดปลากะพง",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- น้ำเปล่า: 2 ถ้วย (480 กรัม)
- น้ำพริกแกงเหลือง: 1 ช้อนโต๊ะ (15 กรัม)
- สับปะรดหั่นเป็นชิ้น: 1/2 ลูก (250 กรัม)
- เนื้อปลากะพง: 1/2 ถ้วย (120 กรัม)
- น้ำมะขามเปียก: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำมะนาว: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำตาลปี๊บ: 2 ช้อนชา (10 กรัม)
- น้ำตาลทราย: 2 ช้อนชา (10 กรัม)
- ส้มแขก: 3 กรัม (3 กรัม)
- น้ำปลาดี: 1 ช้อนชา (5 กรัม)

วิธีทำ
1. ต้มน้ำเปล่าพอเดือด ใส่น้ำพริกแกงเหลืองคนให้เข้ากัน
2. ใส่สับปะรด ต้มด้วยไฟอ่อน ประมาณ 20 นาที
3. ใส่เนื้อปลากะพง ปิดฝาหม้อ รอให้เดือดและปลาสุก เปิดฝา คนพอเข้ากัน
4. ปรุงรสด้วยน้ำมะขามเปียก น้ำตาลทราย น้ำตาลปี๊บ ชิมรส และใส่น้ำมะนาว
5. คนให้เข้ากัน ยกลงตักเสิร์ฟ

หมายเหตุ: รสหวานของแกงเหลืองขึ้นอยู่กับความสุกของสับปะรด ดังนั้นควรค่อยๆ ปรุงน้ำตาลทีละน้อย`,
Region: "ภาคใต้",
		},
		{
			Title: "พริกแกงเหลือง",
			Description: `ส่วนประกอบพริกแกง (ต่อ 6 ช้อนโต๊ะ)
- พริกขี้หนูแห้ง: 12 เม็ด (10 กรัม)
- หอมแดง: 8 หัว (40 กรัม)
- กระเทียม: 16 กลีบ (20 กรัม)
- กะปิ: 2 ช้อนชา (10 กรัม)
- เกลือป่น: 1/2 ช้อนชา (2.5 กรัม)
- ข้าวสาร: 20 กรัม

วิธีทำ
1. นำทุกอย่างยกเว้นกะปิ โขลกรวมกันในครกให้ละเอียด
2. ใส่กะปิโขลกให้เข้ากัน พักไว้เพื่อนำไปแกง

หมายเหตุ: สูตรน้ำพริกนี้เมื่อทำเสร็จจะได้ 90 กรัม (6 ช้อนโต๊ะ) ข้าวสารทำให้แกงมีน้ำข้นนำไปเป็นเครื่องปรุงน้ำพริกแกงเหลืองใส่ผัก และปลาหรือกุ้งสดได้หลากหลาย เช่น แกงเหลืองมะละกอใส่กุ้งสด หรือแกงเหลืองสับปะรดใส่ปลาช่อน 
หรือแกงเหลืองยอดมะพร้าวใส่ปลากะพง ฯลฯ`,
Region: "ภาคใต้",
		},

		{
			Title: "น้ำพริกกุ้งสด",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- กะปิ: 2 1/3 ช้อนชา (13 กรัม)
- กุ้งสด: 8 ตัว (80 กรัม)
- กระเทียมแกะเปลือก: 1 1/2 หัว (25 กรัม)
- น้ำตาลปี๊บ: 4 ช้อนชา (20 กรัม)
- น้ำมะนาว: 3 ช้อนโต๊ะ (45 กรัม)
- พริกขี้หนูสวน: 8 เม็ด (10 กรัม)
- หอมแดงซอย: 8 หัว (40 กรัม)
- ผักจิ้มน้ำพริก: แตงกวา 1 ลูกใหญ่ (30 กรัม), ถั่วพูต้มสุก 4 ฝัก (30 กรัม), ใบมะม่วงหิมพานต์ 6 ยอด (30 กรัม), ลูกเนียง 1 ลูก (10 กรัม), สะตอ 2 เม็ด (10 กรัม)

วิธีทำ
1. นำกุ้งไปต้มให้สุก แกะเอาแต่เนื้อ แล้วหั่นเป็นชิ้นเล็กๆ
2. นำกะปิห่อใบตองปิ้งให้สุกหอมพักไว้
3. นำกะปิที่ปิ้งไว้ กระเทียม และพริกขี้หนู โขลกหยาบๆ ในครก แบ่งเนื้อกุ้งมา 1 ใน 3 ส่วน ใส่ลงไปโขลกพร้อมน้ำพริก ปรุงรสด้วยน้ำตาลปี๊บ และมะนาว ชิมดูให้ออกรสเปรี้ยวหวาน
4. ใส่เนื้อกุ้งที่เหลือ หอมแดงซอยลงไปคลุกเคล้าให้เข้ากัน (ไม่ต้องตำ) จากนั้นตักใส่ถ้วย เสิร์ฟคู่กับผักสด - ผักลวกตามชอบ`,
Region: "ภาคใต้",
		},

		{
			Title: "แกงคั่วหมูใบยี่หร่า",
			Description: `ส่วนประกอบ (ต่อ 2 ที่)
- หมูสันนอกหั่นเป็นชิ้นขนาด 0.5×1.5×1 นิ้ว: 531 ช้อนโต๊ะ (80 กรัม)
- น้ำพริกแกงเหลือง: 31 ช้อนโต๊ะ (20 กรัม)
- น้ำเปล่า: 1 1/2 ถ้วย (360 มิลลิลิตร)
- น้ำปลาดี: 1 ช้อนชา (5 กรัม)
- น้ำตาลปี๊บ: 1 ช้อนชา (5 กรัม)
- ใบมะกรูดฉีกเป็นชิ้นเล็ก: 5 ใบ (5 กรัม)
- ใบยี่หร่า: 20 ใบ (30 กรัม)

วิธีทำ
1. ตั้งน้ำให้ร้อน ใส่หมูเนื้อแดงลงไปต้มจนเดือด
2. เติมน้ำพริกแกงคนให้เข้ากัน แล้วเคี่ยวด้วยไฟอ่อนๆ ใส่ใบมะกรูดลงไป เคี่ยวจนหมูเริ่มเปื่อย
3. ปรุงรสด้วยน้ำปลาดี น้ำตาลปี๊บ เคี่ยวให้เหลือน้ำขลุกขลิก ใส่ใบยี่หร่ายกลงตักเสิร์ฟกับข้าวสวยร้อนๆ`,
Region: "ภาคใต้",
		},

		{
			Title: "ผัดหมี่กุ้งสด",
			Description: `ส่วนประกอบน้ำพริกผัด (ต่อ 3 ที่)
- พริกชี้ฟ้าแห้งเม็ดใหญ่ เอาไส้ออกแช่น้ำให้นิ่ม: 3 เม็ด (7 กรัม)
- หอมแดง: 4 หัว (20 กรัม)

ส่วนประกอบ (ต่อ 3 ที่)
- ก๋วยเตี๋ยวเส้นเล็กหรือเส้นหมี่ขาว: 180 กรัม
- น้ำกะทิ: 1 ถ้วยตวง (240 กรัม)
- กุ้งสดแกะเปลือกผ่าหลัง: 6 ตัว (60 กรัม)
- น้ำตาลปี๊บ: 5 ช้อนชา (25 กรัม)
- น้ำเปล่า: 100 มิลลิลิตร (100 กรัม)
- น้ำปลาอย่างดี: 1 ช้อนชา (5 กรัม)
- น้ำมะขามเปียก: 1 ช้อนโต๊ะ (15 กรัม)

ผักเคียง (ต่อ 3 ที่)
- ถั่วงอก: 3 ช้อนโต๊ะ (30 กรัม)
- มะม่วงสับหั่นฝอย: 3 ช้อนโต๊ะ (30 กรัม)
- ใบกุยช่าย: 2 ช้อนโต๊ะ (20 กรัม)
- ใบบัวบก: 2 ช้อนโต๊ะ (20 กรัม)

วิธีทำ
1. เตรียมส่วนผสมน้ำพริกผัด โดยนำพริกชี้ฟ้า หอมแดงโขลกรวมกันให้ละเอียด จะได้น้ำพริกสำหรับผัด 25 กรัม พักไว้เพื่อนำไปผัดหมี่
2. นำเส้นก๋วยเตี๋ยวเส้นเล็กหรือเส้นหมี่ขาวแช่น้ำให้นิ่ม สรงใส่ตะแกรงพักไว้
3. ตั้งกระทะใส่กะทิเคี่ยวกับน้ำพริกหมี่ที่โขลกไว้ คนให้เข้ากัน เติมน้ำตาลปี๊บ น้ำมะขามเปียก น้ำปลา คนให้น้ำตาลปี๊บละลาย
4. นำก๋วยเตี๋ยวเส้นเล็กหรือเส้นหมี่ขาวลงผัดกับน้ำแกงผัดหมี่ ใส่กุ้งสดลงผัดให้สุก เติมน้ำเปล่า ผัดคลุกจนเส้นนิ่ม ยกลงจัดใส่จาน รับประทานกับผัก เช่น แตงกวา ใบบัวบก ถั่วงอก ใบกุยช่าย มะนาว มะม่วงสับฝอย หรือลูกมุดสับฝอย`,
Region: "ภาคใต้",
		},

		{
			Title: "ปลาต้มขมิ้นและข้าวยำปักษ์ใต้",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- ปลาทูสดล้างสะอาด หั่นเป็นชิ้น (ชิ้นละ 30 กรัม): 2 ตัว (120 กรัม)
- ขมิ้นชันล้างสะอาด ปอกผิวออก ทุบหรือหั่นเป็นชิ้น: 12 แว่น (25 กรัม)
- หอมแดง: 5 หัว (25 กรัม)
- ตะไคร้ล้างสะอาดหั่นแฉลบเป็นชิ้น: 4 ต้น (40 กรัม)
- ส้มแขก: 4 ชิ้น (3 กรัม)
- กระเทียมแกะกลีบ: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำมะขามเปียก: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำตาลปี๊บ: 1 ช้อนชา (5 กรัม)
- น้ำตาลทราย: 2 ช้อนชา (10 กรัม)
- เกลือป่น: 1/4 ช้อนชา (1.5 กรัม)
- พริกขี้หนูสดบุบพอแตก: 4 เม็ด (5 กรัม)
- น้ำเปล่า: 2 ถ้วยตวง (480 กรัม)

ส่วนประกอบข้าวยำปักษ์ใต้ (ต่อ 1 ที่)
- มะพร้าวคั่ว: 2 ช้อนโต๊ะ (30 กรัม)
- กุ้งแห้งป่น: 1 ช้อนชา (5 กรัม)
- ตะไคร้หั่นฝอย: 2 ช้อนโต๊ะ (30 กรัม)
- ถั่วฝักยาวหั่นฝอย: 3 ฝัก (30 กรัม)
- ใบมะกรูดหั่นฝอย: 10 ใบ (10 กรัม)
- ใบชะพลูหั่นฝอย: 12 ใบ (20 กรัม)
- มะม่วงดิบสับหั่นฝอย: 2 ช้อนโต๊ะ (30 กรัม)
- ส้มโอแกะกลีบ: 2 กลีบ (30 กรัม)
- ถั่วงอกเด็ดหาง: 2 ช้อนโต๊ะ (15 กรัม)
- ถั่วพูหั่นฝอย: 3 ช้อนโต๊ะ (30 กรัม)
- แครอทหั่นฝอย: 2 ช้อนชา (10 กรัม)
- พริกขี้หนูปั่นละเอียด: 1/2 ช้อนชา (2 กรัม)
- ข้าวสวย: 1/3 ถ้วย (55 กรัม)
- น้ำบูดู: 1 2/3 ช้อนโต๊ะ (25 กรัม)

วิธีทำ
1. ตั้งหม้อใส่น้ำเปล่า ตะไคร้ ขมิ้น หอมแดงบุบ และกระเทียม ตั้งไฟเคี่ยวจนมีกลิ่นหอมและสีขมิ้นออก
2. พอเดือด ใส่ส้มแขก เกลือป่น น้ำตาลปี๊บ น้ำตาลทราย และน้ำมะขามเปียก เคี่ยวสักพัก
3. ใส่ปลาทูต้มจนสุก
4. ใส่พริกขี้หนูสด ยกลงตักเสิร์ฟ`,
Region: "ภาคใต้",
		},
		{
			Title: "ข้าวยำปักษ์ใต้และน้ำบูดู",
			Description: `วิธีทำข้าวยำปักษ์ใต้
ผสมน้ำบูดูในข้าวสวย คลุกเคล้าจนทั่ว ใส่มะพร้าวคั่ว กุ้งแห้งป่น ใส่ผักทุกอย่างลงไปคลุกให้เข้ากัน เติมพริกขี้หนูแห้งปั่น หากชอบเปรี้ยวปรุงรสด้วยน้ำมะนาวตามชอบ
ส่วนประกอบน้ำบูดู (ต่อ 24 ช้อนโต๊ะ)
- น้ำตาลปี๊บ: 4 ช้อนโต๊ะ (60 กรัม)
- ตะไคร้: 2 1/2 ต้น (25 กรัม)
- หอมแดง: 6 หัว (30 กรัม)
- ข่าสด: 5 แว่น (10 กรัม)
- น้ำบูดู: 2 ช้อนโต๊ะ (30 กรัม)
- ซีอิ๊วแดงหวาน: 1/2 ช้อนชา (3 กรัม)
- น้ำเปล่า: 2 ถ้วยตวง (480 มิลลิลิตร)

ส่วนประกอบข้าวยำ (ต่อ 4 ที่)
- ผักหวานเด็ดใบอ่อน: 3 ถ้วยตวง (100 กรัม)
- ผักติ้ว: 5 ยอด (5 กรัม)
- ไข่มดแดง: 6 ช้อนโต๊ะ (120 กรัม)
- ปลาช่อน: 6 ช้อนโต๊ะ (90 กรัม)
- เกลือ: 1/6 ช้อนชา (0.75 กรัม)
- น้ำปลาร้า: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำเปล่า: 2 ถ้วยตวง (400 กรัม)
- พริกขี้หนูสด: 5 - 6 เม็ด (5 กรัม)
- หอมแดงซอย: 10 ช้อนชา (50 กรัม)
- ตะไคร้: 6 ช้อนชา (30 กรัม)

วิธีทำน้ำบูดู
1. นำน้ำเปล่าเทใส่หม้อต้มให้เดือด
2. ใส่เครื่องสมุนไพรทั้งหมดลงไปต้มให้กลิ่นหอม
3. เติมน้ำตาลปี๊บลงไปแล้วคนจนละลาย
4. ใส่น้ำบูดู แต่งสีให้เข้มด้วยซีอิ๊วแดงหวาน
5. เคี่ยวต่อประมาณ 5 นาที ยกลงพักไว้

หมายเหตุ: น้ำบูดูสูตรนี้จะได้ปริมาณ 360 มิลลิลิตร หรือ 24 ช้อนโต๊ะ มีรสหวานนำและมีกลิ่นของสมุนไพรจากข่า ตะไคร้ หอมแดง เมื่อนำไปผสมกับข้าวสวยและเครื่องข้าวยำ จะช่วยเพิ่มรสเปรี้ยวและกลมกล่อมด้วยมะม่วงดิบ ส้มโอ และมะนาว`,
Region: "ภาคใต้",
		},
		{
			Title: "แกงผักหวานไข่มดแดง",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- เนื้อปลานิล: 5 ช้อนโต๊ะ (80 กรัม)
- ไข่ขาวต้ม: 4 ฟอง (140 กรัม)
- ต้นหอม: 1/4 ถ้วยตวง (15 กรัม)
- ผักชี: 1/4 ถ้วยตวง (15 กรัม)
- น้ำปลาร้า: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำเปล่า: 4 ถ้วยตวง (800 กรัม)
- เกลือ: 1/3 ช้อนชา (1.5 กรัม)
- ขนมจีน: 8 จับ (400 กรัม)
- กระเทียม: 3 ช้อนโต๊ะ (30 กรัม)
- หอมแดง: 3 ช้อนโต๊ะ (30 กรัม)
- พริกแห้งเม็ดใหญ่ 7 เม็ด: 1/2 ถ้วยตวง (20 กรัม)
- ตะไคร้: 4 ช้อนโต๊ะ (20 กรัม)
- กระชาย: 1/2 ถ้วยตวง (40 กรัม)
- ขิงแก่: 3 ช้อนโต๊ะ (15 กรัม)
- กะหล่ำปลีหั่นฝอย: 1/4 ถ้วยตวง (20 กรัม)
- ถั่วฝักยาวหั่นฝอย: 1 ฝัก (10 กรัม)

วิธีทำ
1. นำพริกขี้หนู หอมซอย ตะไคร้ โขลกรวมกันให้ละเอียด
2. เติมน้ำเปล่าในหม้อตั้งไฟให้เดือด เติมเครื่องแกงที่โขลก ข้อ 1 ลงในหม้อ ใส่ปลาช่อนต้มจนสุก
3. ล้างไข่มดแดงในน้ำให้สะอาด สรงใส่ตะแกรงให้สะเด็ดน้ำ
4. นำผักหวานที่ล้างน้ำแล้ว ใส่ลงในหม้อคนให้ทั่ว แล้วหรี่ไฟลง
5. ปรุงรสด้วยน้ำปลาร้า เติมผักติ้ว ไข่มดแดง คนจนทั่ว เคี่ยวจนเดือดประมาณ 5 นาที ปิดไฟ ตักใส่ชามพร้อมเสิร์ฟ`,
Region: "ภาคตะวันออกเฉียงเหนือ",
		},
		{
			Title: "ขนมจีนน้ำยาลาว",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- หยวกกล้วย: 2 ถ้วยตวง (200 กรัม)
- อกไก่ไม่มีหนัง: 4 ช้อนโต๊ะ (40 กรัม)
- วุ้นเส้น 1 ห่อเล็ก: 1 ถ้วยตวง (40 กรัม)
- ตะไคร้: 3 ช้อนชา (15 กรัม)
- พริกแห้งเม็ดใหญ่: 4 ช้อนโต๊ะ (10 กรัม)
- กระเทียม: 1 ช้อนชา (5 กรัม)
- หอมแดง: 4 ช้อนชา (20 กรัม)
- ข่า: 1 แว่น (5 กรัม)
- กะปิ: 1/4 ช้อนชา (1.25 กรัม)
- เกลือ: 1/4 ช้อนชา (1.25 กรัม)
- น้ำมันรำข้าว: 2 ช้อนชา (10 กรัม)

วิธีทำ
1. ล้างและปอกเปลือกหอมแดง กระเทียม ตะไคร้ ขิง กระชาย พริกแห้ง นำไปต้มในหม้อพร้อมปลานิล
2. นำเครื่องสมุนไพรในข้อ 1 มาโขลกให้ละเอียด
3. นำปลาต้มมายีและผสมกับเครื่องแกง ข้อ 2 โขลกให้เข้ากัน
4. นำน้ำที่ต้มเครื่องแกงมากรองด้วยกระชอน ตั้งไฟให้เดือด นำส่วนผสม ข้อ 3 ใส่ลงในน้ำ คนให้เข้ากัน ปรุงรสด้วยปลาร้า เกลือ พอน้ำเดือดได้ที่ ปิดไฟ เสิร์ฟพร้อมขนมจีน ผักหั่นฝอย ไข่ขาวต้ม`,
Region: "ภาคตะวันออกเฉียงเหนือ",
		},
		{
			Title: "แกงหยวกกล้วย",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- หยวกกล้วย: 2 ถ้วยตวง (200 กรัม)
- อกไก่ไม่มีหนัง: 4 ช้อนโต๊ะ (40 กรัม)
- วุ้นเส้น 1 ห่อเล็ก: 1 ถ้วยตวง (40 กรัม)
- ตะไคร้: 3 ช้อนชา (15 กรัม)
- พริกแห้งเม็ดใหญ่: 4 ช้อนโต๊ะ (10 กรัม)
- กระเทียม: 1 ช้อนชา (5 กรัม)
- หอมแดง: 4 ช้อนชา (20 กรัม)
- ข่า: 1 แว่น (5 กรัม)
- กะปิ: 1/4 ช้อนชา (1.25 กรัม)
- เกลือ: 1/4 ช้อนชา (1.25 กรัม)
- น้ำมันรำข้าว: 2 ช้อนชา (10 กรัม)

วิธีทำ
1. หั่นหยวกกล้วยเป็นแว่น แช่น้ำเกลือ
2. โขลกพริก หอม กระเทียม ข่า ตะไคร้ กะปิ รวมกันจนละเอียด
3. ตั้งกระทะผัดเครื่องแกง ข้อ 2 กับน้ำมันจนหอม ใส่อกไก่ผัดให้เข้ากัน ใส่เกลือ
4. เติมน้ำพอท่วม ใส่หยวกกล้วย
5. รอให้เดือดอีกครั้ง เติมวุ้นเส้น ปิดไฟ พร้อมเสิร์ฟ`,
Region: "ภาคตะวันออกเฉียงเหนือ",
		},
		{
			Title: "ห่อหมกปลาช่อนกะหล่ำปลี",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- เนื้อปลาช่อน: 6 ช้อนโต๊ะ (90 กรัม)
- ไข่ขาวดิบ: 1 ฟอง (35 กรัม)
- กะหล่ำปลี: 1/2 ถ้วยตวง (30 กรัม)
- ผักแขยงหั่นฝอย: 1/4 ถ้วยตวง (30 กรัม)
- ใบแมงลัก: 2 กิ่ง (10 กรัม)
- พริกชี้ฟ้าแดงสด 5 เม็ด: 1/4 ถ้วยตวง (50 กรัม)
- หอมแดง: 2 ช้อนชา (10 กรัม)
- ตะไคร้: 2 ช้อนชา (10 กรัม)
- กะปิ: 1 ช้อนชา (5 กรัม)
- กะทิ: 2 ช้อนโต๊ะ (25 กรัม)
- ใบตอง: ไม่มีปริมาณ/น้ำหนักระบุ

วิธีทำ
1. ล้างปลา ขอดเกล็ด แล่เนื้อ หั่นเป็นชิ้น
2. โขลกพริกสด หอมแดง ตะไคร้ กะปิ ให้ละเอียด ตักใส่ชามผสม
3. ผสมกะทิ ไข่ขาว คนให้เข้ากัน จากนั้นเติมผักแขยงคลุกให้เข้ากัน
4. รองใบตองด้วยใบแมงลัก และกะหล่ำปลีหั่นต้มสุก ตักส่วนผสมข้อ 2 และ 3 ใส่กระทงใบตอง นึ่งในน้ำเดือดจัดประมาณ 30 นาที`,
Region: "ภาคตะวันออกเฉียงเหนือ",
		},
		{
			Title: "ส้มตำปลาร้าพายัพ",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
- มะละกอดิบ: 1/2 ถ้วยตวง (30 กรัม)
- มะเขือเทศสีดา: 1 ช้อนโต๊ะ (15 กรัม)
- ถั่วฝักยาว: 1 ฝัก (10 กรัม)
- กระเทียมกลีบเล็ก: 2 ช้อนชา (10 กรัม)
- พริกขี้หนู: 5 เม็ด (5 กรัม)
- มะกอก: 1/2 ผล (5 กรัม)
- มะอึก: 1/2 ผล (5 กรัม)
- มะเขือเจ้าพระยา: 1/2 ผล (5 กรัม)
- ไข่ขาวนึ่ง: 2 ฟอง (70 กรัม)
- น้ำมะขามเปียกคั้น: 1 ช้อนชา (5 กรัม)
- น้ำมะนาว: 1 ช้อนชา (5 กรัม)
- น้ำปลาร้า: 1 ช้อนชา (5 กรัม)
- ขนมจีน: 1 จับ (100 กรัม)

วิธีทำ
1. โขลกกระเทียม พริกขี้หนูเข้าด้วยกัน จากนั้นหั่นถั่วฝักยาว ฝานมะเขือเทศ โขลกรวมกับมะละกอ มะกอกฝาน
2. นำเนื้อมะอึก มะเขือเจ้าพระยา หั่นเป็นชิ้นบางๆ คลุกเคล้ากับส่วนผสมข้อ 1 ให้เข้ากัน
3. หั่นไข่ขาวต้มเป็นเส้นคล้ายมะละกอ คลุกเคล้าในส่วนผสมข้อ 2
4. เติมน้ำปลาร้า น้ำมะขามเปียก น้ำมะนาว ผสมให้เข้ากัน ตักใส่จาน เสิร์ฟพร้อมขนมจีน`,
Region: "ภาคตะวันออกเฉียงเหนือ",
		},
		{
			Title: "แกงลาวผักรวม",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
- เนื้อปลาช่อนสด: 1 ช้อนโต๊ะ (15 กรัม)
- ฟักทอง: 3 ชิ้น (10 กรัม)
- บวบหอม: 3 ชิ้น (10 กรัม)
- เห็ดขอนขาว: 3 ชิ้น (10 กรัม)
- เห็ดนางฟ้า: 3 ชิ้น (10 กรัม)
- หอมแดง: 1 ช้อนโต๊ะ (15 กรัม)
- กระเทียม: 1 ช้อนชา (5 กรัม)
- พริกขี้หนูหั่น: 1 ช้อนชา (5 กรัม)
- ตะไคร้: 1 ช้อนชา (5 กรัม)
- กระชาย: 1 ช้อนชา (5 กรัม)
- ข่าอ่อน: 1/2 ช้อนชา (2.5 กรัม)
- ผิวมะกรูด: 1/2 ช้อนชา (2.5 กรัม)
- น้ำใบย่านาง (ใช้ใบย่านาง 5 กรัม): 2 ช้อนโต๊ะ (5 กรัม)
- น้ำปลาร้า: 1 ช้อนชา (5 กรัม)
- ข้าวเบือ: 1/2 ช้อนชา (5 กรัม)
- ใบมะกรูด: 3 ใบ (2 กรัม)
- พริกแดง: 1 เม็ด (5 กรัม)
- ใบแมงลัก: 3 ช่อ (5 กรัม)

วิธีทำ
1. เตรียมข้าวเบือ โดยโขลกข้าวเหนียวที่คั่วจนหอมแล้วให้ละเอียด
2. ล้างใบย่านางให้สะอาด โขลกให้ละเอียด จากนั้นเติมน้ำ 1 แก้ว กรองให้เป็นน้ำสีเขียว
3. ตัดโคนเห็ดทิ้ง จากนั้นหั่นหรือฉีกเห็ดเป็นชิ้นๆ ปอกเปลือกบวบหอม และฟักทอง แล้วหั่นเป็นชิ้น เด็ดใบแมงลักเป็นช่อ
4. เตรียมเครื่องแกงพริกขี้หนู หอมแดง กระเทียม ตะไคร้ ข่า ผิวมะกรูด กระชายหั่นฝอย ตวงตามส่วน โขลกรวมกันจนละเอียด
5. ต้มน้ำใบย่านางพอเดือดใส่เครื่องแกง ฟักทองพอสุก บวบ เห็ด ข้าวเบือ ปรุงรสด้วยน้ำปลาร้า พอเดือดใส่ ใบมะกรูดฉีก ใบแมงลัก พริกแดง ยกลงตักเสิร์ฟ`,
Region: "ภาคตะวันออกเฉียงเหนือ",
		},
		{
			Title: "แจ่วบองสมุนไพร",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- ปลาร้าปลาช่อน: 1 ช้อนโต๊ะ (13 กรัม)
- ตะไคร้ซอยละเอียด: 2 ช้อนโต๊ะ (10 กรัม)
- หอมซอยบางๆ: 2 ช้อนโต๊ะ (20 กรัม)
- กระเทียมซอยบางๆ: 2 ช้อนโต๊ะ (20 กรัม)
- ข่าหั่นหยาบ: 2 ช้อนชา (10 กรัม)
- พริกคั่วป่นละเอียด: 1 ช้อนชา (5 กรัม)
- มะเขือเทศเนื้อ: 1/2 ถ้วยตวง (80 กรัม)
- น้ำมะขามเปียกคั้น: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำมันพืช: 1 ช้อนโต๊ะ (15 กรัม)
- เนื้อปลาช่อน: 5 ช้อนโต๊ะ (75 กรัม)
- ใบมะกรูด: 3 ใบ (2 กรัม)
- แตงกวา: 4 ลูก (100 กรัม)
- มะเขือเจ้าพระยา: 4 ลูก (100 กรัม)
- ผักกาดขาว: 8 กาบ (100 กรัม)

วิธีทำ
1. ล้างปลาร้า เอาแต่เนื้อ 1 ช้อนโต๊ะ สับให้ละเอียด รวมกับเนื้อปลาช่อน ห่อใบตอง ปิ้งให้สุก
2. คั่วข่า ตะไคร้ หอม กระเทียม ให้หอม แล้วนำมาโขลกให้ละเอียด
3. เผามะเขือเทศ ลอกเปลือกออกแล้วสับละเอียด
4. นำส่วนผสมในข้อ 1-3 มาโขลกรวมกัน ใส่น้ำมะขามเปียก พริกป่น นำลงผัดในน้ำมันให้เข้ากัน
5. ตักใส่จาน โรยหน้าด้วยใบมะกรูดหั่นฝอย จัดเสิร์ฟพร้อมผักสด`,
Region: "ภาคตะวันออกเฉียงเหนือ",
		},
		{
			Title: "ลาบไข่ขาว",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- ไข่ขาวนึ่งสุก: 4 ฟอง (140 กรัม)
- หอมแดงซอย: 2 ช้อนโต๊ะ (30 กรัม)
- ผักชีใบเลื่อย: 2 ช้อนโต๊ะ (15 กรัม)
- ต้นหอมซอย: 2 ช้อนโต๊ะ (15 กรัม)
- พริกขี้หนูแดงซอย: 1 ช้อนชา (5 กรัม)
- พริกขี้หนูปั่น: 1/2 ช้อนโต๊ะ (2.5 กรัม)
- ข้าวคั่ว: 2 ช้อนโต๊ะ (15 กรัม)
- น้ำมะนาว: 1 ช้อนชา (20 กรัม)
- น้ำปลา: 1 ช้อนชา (5 กรัม)
- น้ำตาลทราย: 1 ช้อนชา (5 กรัม)
- น้ำมันพืช: 2 ช้อนชา (10 กรัม)
- ใบสะระแหน่: 2 ช้อนโต๊ะ (15 กรัม)
- ผักกาดขาว: 2 กาบ (20 กรัม)
- แตงกวา: 2 ลูก (100 กรัม)
- ถั่วฝักยาว: 4 เส้น (50 กรัม)
- น้ำเปล่าต้มสุก: 3 ช้อนโต๊ะ (45 กรัม)

วิธีทำ
1. นำไข่ขาวนึ่งให้สุก สับหยาบๆ ผัดพอเหลือง
2. ผสมน้ำตาลทราย น้ำปลา คนให้ละลาย ใส่น้ำมะนาว
3. นำไข่ขาว ใส่น้ำปรุงรส ข้อ 2. เติมน้ำต้มสุก ใส่หอมแดง ข้าวคั่ว พริกขี้หนูซอย พริกป่น ต้นหอม ผักชี คลุกเคล้าให้เข้ากัน จัดใส่จาน แต่งหน้าด้วยสะระแหน่ เสิร์ฟพร้อมผักสด`,
Region: "ภาคตะวันออกเฉียงเหนือ",
		},
		{
			Title: "ผัดหมี่พิมาย",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- หมี่โคราช: 3 ถ้วยตวง (150 กรัม)
- หอมแดงซอย: 3 ช้อนโต๊ะ (30 กรัม)
- กระเทียมซอย: 1 ช้อนโต๊ะ (15 กรัม)
- หมูเนื้อแดง: 5 ช้อนโต๊ะ (80 กรัม)
- ไข่ไก่: 1 ฟอง (50 กรัม)
- น้ำปลา: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำตาลทราย: 3 ช้อนโต๊ะ (45 กรัม)
- น้ำส้มสายชู: 3 ช้อนโต๊ะ (45 กรัม)
- น้ำมันพืช: 2 ช้อนชา (5 กรัม)
- พริกชี้ฟ้าแห้งปั่น: 1 ช้อนโต๊ะ (5 กรัม)
- ต้นหอม: 10 ต้น (80 กรัม)
- ถั่วงอก: 2 ถ้วยตวง (150 กรัม)
- น้ำมะขามเปียก: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำเปล่า: 1/2 ถ้วยตวง (120 กรัม)

วิธีทำ
1. หั่นหมูเนื้อแดงเป็นชิ้นบางๆ
2. ตีไข่ไก่ให้เป็นเนื้อเดียวกัน ทอดเป็นแผ่นบางพอสุก ม้วน แล้วหั่นฝอย
3. แช่เส้นหมี่จนนุ่ม สะเด็ดน้ำ พักไว้
4. ตั้งกระทะใส่น้ำมัน เจียวหอม กระเทียม จนเหลือง ใส่น้ำปลา น้ำตาล น้ำมะขามเปียก น้ำส้มสายชู และน้ำเปล่า เคี่ยวพอได้สีที่ต้องการ ใส่พริกป่นลงไป
5. นำเส้นหมี่ลงผัดในน้ำปรุง เคล้าให้เข้ากัน ถ้าเส้นแข็งเติมน้ำเปล่าเพิ่ม
6. ตักเสิร์ฟ ตกแต่งด้วยไข่ฝอย ถั่วงอก และต้นหอม`,
Region: "ภาคตะวันออกเฉียงเหนือ",
		},
		{
			Title: "ป่นปลาผักต้ม",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- เนื้อปลาช่อนย่าง: 4 ช้อนโต๊ะ (60 กรัม)
- พริกชี้ฟ้า เขียว แดง: 1/4 ถ้วยตวง (50 กรัม)
- กระเทียม: 2 ช้อนโต๊ะ (30 กรัม)
- หอมแดง: 1/4 ถ้วยตวง (50 กรัม)
- มะเขือเทศเนื้อ เผา: 1 ลูก (80 กรัม)
- น้ำปลาร้าต้มสุก: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำมะขามเปียกต้มสุก: 1 ช้อนโต๊ะ (20 กรัม)
- เกลือป่น: 1/10 ช้อนชา (0.5 กรัม)
- ผักกาดขาว: 8 กาบ (100 กรัม)
- แตงกวา: 2 ลูก (100 กรัม)
- ดอกโสน: 1 ถ้วยตวง (50 กรัม)
- มะเขือเปราะ: 4 ลูก (100 กรัม)
- พริกขี้หนู: 6 เม็ด (10 กรัม)
- น้ำมะนาว: 2 ช้อนชา (10 กรัม)

วิธีทำ
1. นำพริก กระเทียม หอมแดง เผาแล้วโขลกรวมกัน
2. นำปลาช่อนย่าง แกะก้างออก โขลกรวมกับส่วนผสมในข้อ 1
3. เผามะเขือเทศ ปอกเปลือก โขลกรวมกับส่วนผสมในข้อ 1 และ ข้อ 2 ให้เข้ากัน
4. ปรุงรสด้วยน้ำปลาร้า น้ำมะขามเปียก น้ำมะนาว หากข้นไปให้เติมน้ำต้มสุกเพิ่ม จัดเสิร์ฟพร้อมผักสด และผักต้ม`,
Region: "ภาคตะวันออกเฉียงเหนือ",
		},
	}
	for _, pkg := range Menu {
		db.FirstOrCreate(&pkg, entity.Menu{Title: pkg.Title})
	}

	images := []entity.MenuImage{
		{MenuID: 1, Image: "https://f.ptcdn.info/511/002/000/1361646707-IMG2766Med-o.jpg"},
		{MenuID: 2, Image: "https://img.wongnai.com/p/1920x0/2017/09/24/c415bbcecc5145c9a967b132e28a1087.jpg"},
		{MenuID: 3, Image: "https://i.ytimg.com/vi/Jvf4KMuuoEQ/maxresdefault.jpg"},
		{MenuID: 4, Image: "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEikO0YvxPPCqwJAgtPfgJjjdTX2oZvUWFvgAHLRItqY9q1UbwYqXBIEZqUmjsrk4wfTavQfzmLbPzMUSd6LBjZmxI3Vhag7jsOMyxPg3V2AVikonT_SdHb5CiDBbQkI2Fv68L8eMmlyKhM/s1600/%E0%B9%81%E0%B8%81%E0%B8%87%E0%B8%95%E0%B8%B9%E0%B8%99%E0%B9%83%E0%B8%AA%E0%B9%88%E0%B8%9B%E0%B8%A5%E0%B8%B2.jpg"},
		{MenuID: 5, Image: "https://static.thairath.co.th/media/4DQpjUtzLUwmJZZSC41tBS2JyaLrHhBkHieCf4lwMRxT.jpg"},
		{MenuID: 6, Image: "https://png.pngtree.com/thumb_back/fh260/background/20220324/pngtree-spicy-thai-pork-salad-with-ground-pork-and-pork-liver-larb-mu-photo-image_21814272.jpg"},
		{MenuID: 7, Image: "https://sharp-weeclub.com/wp-content/uploads/2022/01/%E0%B8%82%E0%B8%99%E0%B8%A1%E0%B8%88%E0%B8%B5%E0%B8%991-990x510-1.jpg"},
		{MenuID: 8, Image: "https://www.maeban.co.th/upfiles/blog/469811576_1757125385107540_8515113923452393484_n.jpg"},
		{MenuID: 9, Image: "https://img.kapook.com/u/surauch/cook1/Thai_2.jpg"},
		{MenuID: 10, Image: "https://img.wongnai.com/p/256x256/2023/06/04/b1e8748c61d4459d826187fb574aeb1f.jpg"},
		{MenuID: 11, Image: "https://api2.krua.co/wp-content/uploads/2020/06/SlideBanner1140x507-650.jpg"},
		{MenuID: 12, Image: "https://thecookingsociety.com/wp-content/uploads/2022/02/Screen-Shot-2565-02-26-at-15.54.50.png"},
		{MenuID: 13, Image: "https://sdmntpritalynorth.oaiusercontent.com/files/00000000-5a60-6246-a89c-6716f0dd5147/raw?se=2025-06-21T10%3A06%3A25Z&sp=r&sv=2024-08-04&sr=b&scid=04d39307-bed5-5c2e-8538-5d9312cb33df&skoid=f28c0102-4d9d-4950-baf0-4a8e5f6cf9d4&sktid=a48cca56-e6da-484e-a814-9c849652bcb3&skt=2025-06-20T17%3A13%3A30Z&ske=2025-06-21T17%3A13%3A30Z&sks=b&skv=2024-08-04&sig=bfNJ1VWoxr7gIVKpWTS493w%2B38gfwnwKC3QwnRJp83w%3D"},
		{MenuID: 14, Image: "https://www.bloggang.com/data/jazzy-bong/picture/1436528038.jpg"},
		{MenuID: 15, Image: "https://img.wongnai.com/p/1920x0/2021/02/19/4ebb3ee1417746ba8f552a195f26e908.jpg"},
	}

	for _, img := range images {
		db.FirstOrCreate(&img, entity.MenuImage{MenuID: img.MenuID})
	}

}
