package config

import (
	"fmt"
	"math/rand"

	// "time"
	// "log"
	"github.com/helloeve02/CPE681012/entity"
	"gorm.io/driver/sqlite"
	"gorm.io/gorm"
)

var db *gorm.DB

// DB returns the database connection instance
func DB() *gorm.DB {
	return db
}

// ConnectionDB initializes the database connection
func ConnectionDB() {
	database, err := gorm.Open(sqlite.Open("nutrition.db?cache=shared"), &gorm.Config{})
	if err != nil {
		panic("failed to connect database")
	}
	fmt.Println("connected database")
	db = database
}

func SetupDatabase() {
	// Automigrate Tables
	err := db.AutoMigrate(
		&entity.Menu{},
		&entity.Admin{},
		&entity.Disease{},
		&entity.EducationalContent{},
		&entity.Tag{},
		&entity.MealMenu{},
		&entity.Meal{},
		&entity.Mealday{},
		&entity.Mealplan{},
		&entity.AgeRange{},
		&entity.FoodGroup{},
		&entity.IbwRange{},
		&entity.MealTime{},
		&entity.NutritionGroup{},
		&entity.NutritionRecommendation{},
		&entity.PortionRecommendation{},
		&entity.Rule{},
		&entity.MenuTag{},
		&entity.FoodFlag{},
		&entity.FoodItem{},
		&entity.EducationalGroup{},
		&entity.FoodChoice{},
		&entity.FoodchoiceDisease{},
		&entity.FoodExchange{},
	)
	if err != nil {
		panic("failed to migrate database: " + err.Error())
	}
	fmt.Println("Database tables migrated successfully")

	Menu := []entity.Menu{
		{
			Title: "ยำถั่วฝักยาว/มะเขือ",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
		- ถั่วฝักยาวลวกพอสุกหั่นเป็นท่อนสั้น: 4 ฝัก (40 กรัม)
		- มะเขือผ่อย หรือมะเขือเปราะลวกพอสุกหั่นเป็นชิ้นเล็ก: 2 ช้อนโต๊ะ (30 กรัม)
		- มะเขือพวงลวกสุก: 15 เม็ด (15 กรัม)
		- หมูไม่ติดมันบด: 1 ช้อนโต๊ะ (15 กรัม)
		- น้ำมันรำข้าว: 2 ช้อนชา (10 กรัม)
		- กระเทียม: 3 กลีบ (7.5 กรัม)
		- หอมแดง: 2 หัวเล็ก (10 กรัม)
		- พริกหนุ่มเม็ดใหญ่: 4 เม็ด (40 กรัม)
		- น้ำเห็ดหอม: 50 ซีซี (50 กรัม)
		- กะปิ: 1/2 ช้อนชา (2.5 กรัม)
		- รากผักชี: 3 ราก (6 กรัม)
		- ต้นหอม / ผักชี / ใบแมงลัก: เล็กน้อยสำหรับตกแต่งอาหาร

		วิธีทำ
		1. โขลกพริกหนุ่ม กระเทียม หอมแดง รากผักชี ให้เข้ากัน
		2. ใส่กะปิ โขลกรวมกัน จากนั้นใส่ถั่วฝักยาว มะเขือเปราะ และมะเขือพวง โขลกให้เข้ากัน
		3. ผัดเครื่องแกงที่โขลกไว้กับน้ำมันรำข้าว
		4. ใส่หมูบดลงไป ผัดจนหมูสุกและเข้ากันดี
		5. ตักใส่จาน โรยหน้าด้วยต้นหอม ผักชี และใบแมงลักเพื่อความสวยงาม`,
			// Region: "ภาคเหนือ",
			Image:     "https://f.ptcdn.info/511/002/000/1361646707-IMG2766Med-o.jpg",
			Sodium:    180.30,
			Credit:    "https://pantip.com/topic/30178641",
			Potassium: "344.14",
		},
		{
			Title: "น้ำพริกอ่อง",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
	- หมูไม่ติดมันบด: 1 ช้อนโต๊ะ (15 กรัม)
	- มะเขือส้ม หรือมะเขือเทศลูกเล็กหั่นสี่เหลี่ยม: 1/2 ถ้วย (40 กรัม)
	- พริกแห้งเม็ดใหญ่ เอาทั้งเม็ด: 2 เม็ด (5 กรัม)
	- น้ำเปล่า: 1/4 ถ้วย (60 กรัม)
	- น้ำตาล: 1/4 ช้อนชา (1.25 กรัม)
	- กระเทียมปอกเปลือก: 3 กลีบ (7.5 กรัม)
	- หอมแดงปอกเปลือก: 1.5 หัว (7.5 กรัม)
	- กะปิ: 1/4 ช้อนชา (1.25 กรัม)
	- น้ำปลา: 1/5 ช้อนชา (1 กรัม)
	- น้ำมันรำข้าว: 1.5 ช้อนชา (7.5 กรัม)
	- มะขามเปียก: 1 ช้อนชา (5 กรัม)
	- แตงกวา: 1 ลูก (40 กรัม)
	- มะเขือเปราะ: 1 ลูก (25 กรัม)
	- ผักกาดขาวปลี: 2 ก้าน (20 กรัม)
	- ผักชีหั่นฝอย: เล็กน้อยสำหรับตกแต่งอาหาร

	วิธีทำ
	1. นำพริกแห้งเม็ดใหญ่แช่น้ำให้นิ่ม
	2. โขลกพริกแห้ง กระเทียม หอมแดง กะปิ ให้ละเอียด
	3. ใส่มะเขือเทศลูกเล็ก คนให้เข้ากันรวมกับเครื่องแกงในข้อ 2
	4. ผัดเครื่องแกงที่โขลกไว้กับน้ำมันให้หอม ใส่หมูบดผัดให้สุก ใส่น้ำ
	5. ปรุงรสด้วยน้ำปลา และน้ำมะขามเปียก
	6. ตักใส่ถ้วย แต่งหน้าด้วยผักชี รับประทานกับผักสด`,
			// Region: "ภาคเหนือ",
			Image:     "https://img.wongnai.com/p/1920x0/2017/09/24/c415bbcecc5145c9a967b132e28a1087.jpg",
			Sodium:    206.31,
			Credit:    "https://www.facebook.com/amonrat.Thuamchot",
			Potassium: "383",
		},
		{
			Title: "แกงแคไก่บ้าน",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
	- เนื้ออกไก่หั่นเป็นชิ้นขนาดพอคำ: 1 ช้อนโต๊ะ (15 กรัม)
	- ถั่วฝักยาว: 2 ฝัก (20 กรัม)
	- มะเขือผ่อย หรือมะเขือเปราะ: 1 ลูก (25 กรัม)
	- มะเขือพวง: 10 ลูก (10 กรัม)
	- ใบชะพลู: 3 ใบ (5 กรัม)
	- ชะอมเด็ดยอดอ่อน: 2 ช้อนชา (5 กรัม)
	- ใบพริกอ่อน: 2 ช้อนโต๊ะ (5 กรัม)
	- พริกขี้หนูแห้ง: 3 เม็ดเล็ก (2.5 กรัม)
	- กระเทียม: 4 กลีบ (10 กรัม)
	- หอมแดง: 4 หัวเล็ก (20 กรัม)
	- กะปิ: 1/2 ช้อนชา (2.5 กรัม)
	- น้ำเห็ดหอมสดต้มเคี่ยว 1 ชั่วโมง: 150 ซี.ซี. (150 กรัม)

	วิธีทำ
	1. โขลกพริกขี้หนูแห้ง กระเทียม หอมแดง และกะปิให้ละเอียดจนเข้ากัน
	2. ตั้งน้ำเห็ดหอมให้เดือด แล้วใส่เครื่องแกงที่โขลกไว้ลงไป
	3. ใส่เนื้อไก่ลงต้มจนเริ่มสุก จากนั้นใส่ผักที่สุกยาก เช่น ถั่วฝักยาว มะเขือเปราะ
	4. เมื่อน้ำเดือดอีกครั้ง ใส่ผักสุกง่าย เช่น ใบชะพลู ชะอม ใบพริกอ่อน
	5. รอให้เดือดอีกครั้ง แล้วยกลงจากเตา ตักเสิร์ฟร้อน ๆ`,
			// Region: "ภาคเหนือ",
			Image:     "https://i.ytimg.com/vi/Jvf4KMuuoEQ/maxresdefault.jpg",
			Sodium:    194.05,
			Credit:    "https://www.facebook.com/profile.php?id=100080562848664",
			Potassium: "319",
		},
		{
			Title: "แกงส้มตูนปลานิล",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
	- ก้านตูนเด็ดเป็นท่อนขนาด 1/2 นิ้ว: 3/4 ถ้วยตวง (60 กรัม)
	- เนื้อปลานิล: 1 ช้อนโต๊ะ (15 กรัม)
	- ยอดอ่อนตำลึง: 1/2 ถ้วยตวง (15 กรัม)
	- มะเขือส้มหรือมะเขือเทศลูกเล็กผ่า: 1/3 ถ้วยตวง (30 กรัม)
	- น้ำมะกรูด: 3 ลูก (15 กรัม)
	- พริกขี้หนูสด: 7 เม็ด (3 กรัม)
	- หอมแดง: 4 หัว (20 กรัม)
	- กระเทียม: 6 กลีบ (15 กรัม)
	- กะปิ: 1/2 ช้อนชา (2.5 กรัม)
	- ขมิ้น: 1 แว่น (2 กรัม)
	- น้ำเปล่า: 200 ซี.ซี. (200 กรัม)

	วิธีทำ
	1. โขลกพริกขี้หนูสด หอมแดง กระเทียม และกะปิรวมกันให้ละเอียด
	2. ใส่ขมิ้นลงไปโขลกรวมกันอีกครั้งจนเนียน
	3. ต้มน้ำให้เดือด แล้วใส่เครื่องแกงที่โขลกไว้ลงไป
	4. ใส่เนื้อปลานิล ก้านตูน และยอดตำลึงลงไปต้มจนสุก
	5. ปรุงรสด้วยน้ำมะกรูดก่อนยกลง ตักใส่ถ้วยพร้อมเสิร์ฟ`,
			// Region: "ภาคเหนือ",
			Image:     "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEikO0YvxPPCqwJAgtPfgJjjdTX2oZvUWFvgAHLRItqY9q1UbwYqXBIEZqUmjsrk4wfTavQfzmLbPzMUSd6LBjZmxI3Vhag7jsOMyxPg3V2AVikonT_SdHb5CiDBbQkI2Fv68L8eMmlyKhM/s1600/%E0%B9%81%E0%B8%81%E0%B8%87%E0%B8%95%E0%B8%B9%E0%B8%99%E0%B9%83%E0%B8%AA%E0%B9%88%E0%B8%9B%E0%B8%A5%E0%B8%B2.jpg",
			Sodium:    173.34,
			Credit:    "https://th.wikipedia.org/wiki/%E0%B8%A1%E0%B8%AB%E0%B8%B2%E0%B8%A7%E0%B8%B4%E0%B8%97%E0%B8%A2%E0%B8%B2%E0%B8%A5%E0%B8%B1%E0%B8%A2%E0%B9%80%E0%B8%8A%E0%B8%B5%E0%B8%A2%E0%B8%87%E0%B9%83%E0%B8%AB%E0%B8%A1%E0%B9%88",
			Potassium: "299",
		},
		{
			Title: "จอผักกาด",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
	- ผักกาดจ้อน หรือดอกผักกวางตุ้งหั่นเป็นท่อน: 3/4 ถ้วยตวง (80 กรัม)
	- หมูไม่ติดมัน: 1 ช้อนโต๊ะ (15 กรัม)
	- น้ำเห็ดหอมสด: 3/4 ถ้วยตวง (180 กรัม)
	- กะปิ: 1/4 ช้อนชา (1.25 กรัม)
	- กระเทียมสับหยาบ: 2 กลีบ (5 กรัม)
	- หอมแดงปอกเปลือกทุบพอแตก: 1 หัว (5 กรัม)
	- พริกขี้หนูแห้ง: 5 เม็ด (5 กรัม)
	- น้ำมะขามเปียก: 3 ช้อนโต๊ะ (45 กรัม)
	- น้ำตาลปี๊บ: 3/4 ช้อนชา (3.75 กรัม)
	- น้ำมันรำข้าว: 2 ช้อนชา (10 กรัม)

	วิธีทำ
	1. เจียวกระเทียมพอเหลือง ตักขึ้นพักไว้ แล้วทอดพริกขี้หนูแห้งให้กรอบ
	2. ผัดกะปิกับน้ำมันที่เหลือให้หอม แล้วใส่หมูลงผัดพอสุก จากนั้นตักใส่หม้อ
	3. เติมน้ำเห็ดหอมลงในหม้อ รอให้เดือดแล้วใส่ผักกวางตุ้ง เคี่ยวจนผักเปื่อยนุ่ม
	4. ใส่พริกทอด 2 เม็ดลงเคี่ยวพร้อมผัก ปรุงรสด้วยน้ำมะขามเปียกและน้ำตาลปี๊บ คนให้เข้ากัน
	5. ตักใส่ถ้วย โรยหน้าด้วยกระเทียมเจียว และแต่งหน้าด้วยพริกทอดที่เหลือ`,
			// Region: "ภาคเหนือ",
			Image:     "https://static.thairath.co.th/media/4DQpjUtzLUwmJZZSC41tBS2JyaLrHhBkHieCf4lwMRxT.jpg",
			Sodium:    180.70,
			Credit:    "https://www.thairath.co.th/lifestyle/food/2168370",
			Potassium: "279",
		},
		{
			Title: "ลาบคั่ว",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
	- ไข่ขาวเบอร์ 2: 4 ฟอง (140 กรัม)
	- วุ้นเส้น: 1 ห่อ (50 กรัม)
	- แป้งมัน: 5 ช้อนโต๊ะ (25 กรัม)
	- รากผักชีโขลกละเอียด: 5 ราก (10 กรัม)
	- ต้นหอมหั่น: 1.5 ช้อนโต๊ะ (15 กรัม)
	- ผักชีหั่น: 3 ช้อนโต๊ะ (15 กรัม)
	- ขิงแก่หั่นฝอย: 3 ช้อนโต๊ะ (45 กรัม)
	- กระเทียมปอกสับ: 6 กลีบ (15 กรัม)
	- น้ำมันรำข้าว: 5 ช้อนชา (25 กรัม)
	- ซีอิ๊วขาว: 1 ช้อนชา (5 กรัม)
	- น้ำตาล: 1.5 ช้อนชา (7.5 กรัม)
	- น้ำมะนาว: 4 ช้อนชา (20 กรัม)
	- เครื่องเทศลาบ: 1 ช้อนชา (5 กรัม)
	- น้ำเห็ดหอมต้ม: 150 ซี.ซี. (150 กรัม)
	- ผักกาดขาว: 5 ก้าน (150 กรัม)

	วิธีทำ
	1. นำวุ้นเส้นแช่น้ำให้นิ่มมาตัดและสับ ผสมไข่ขาวให้เข้ากันแล้วร่อนแป้งมันทีละน้อย คนให้เข้ากัน
	2. นำถาดสำหรับนึ่งไข่ทาน้ำมันให้ทั่ว เทส่วนผสมข้อ 1 ลงไป แล้วนำไปนึ่งประมาณ 20 นาทีให้สุก พักให้เย็น แล้วแกะออกมาหั่นเป็นสี่เหลี่ยมเล็ก
	3. ผสมเครื่องเทศลาบ คลุกเคล้ากับส่วนผสมในข้อ 2 ให้ทั่ว
	4. เจียวขิงหั่นฝอยให้เหลืองตักพักไว้ในข้อ 3 จากนั้นนำน้ำมันที่เหลือเจียวกระเทียม ตักขึ้น และเจียวรากผักชีให้หอม
	5. นำส่วนผสมข้อ 3 ผัดต่อใส่น้ำเห็ดหอมผัดจนแห้ง ปรุงรสด้วยซีอิ๊วขาว ต้นหอม ผักชี
	6. ปิดไฟใส่น้ำมะนาวคนให้เข้ากันตักใส่จาน โรยด้วยต้นหอม ผักชีอีกเล็กน้อย รับประทานคู่กับผักกาดขาว`,
			// Region: "ภาคเหนือ",
			Image:     "https://png.pngtree.com/thumb_back/fh260/background/20220324/pngtree-spicy-thai-pork-salad-with-ground-pork-and-pork-liver-larb-mu-photo-image_21814272.jpg",
			Sodium:    203.24,
			Credit:    "https://th.pngtree.com/freebackground/spicy-thai-pork-salad-with-ground-pork-and-pork-liver-larb-mu-photo_8413949.html",
			Potassium: "222",
		},
		{
			Title: "ขนมจีนน้ำเงี้ยว",
			Description: `ส่วนประกอบพริกแกง (ต่อ 2 ที่)
	- พริกชี้ฟ้าแห้ง: 3 เม็ด (3 กรัม)
	- หอมแดง: 2 หัว (10 กรัม)
	- กระเทียม: 2 ช้อนชา (10 กรัม)
	- ตะไคร้ซอย: 1 ต้น (10 กรัม)
	- ข่าแก่: 5 แว่น (15 กรัม)
	- รากผักชี: 1 ต้น (2 กรัม)
	- เกลือป่น: 1/4 ช้อนชา (1 กรัม)

	ส่วนประกอบ (ต่อ 2 ที่)
	- น้ำมันรำข้าว: 2 ช้อนชา (10 กรัม)
	- เนื้อหมูสับ: 4 1/3 ช้อนโต๊ะ (65 กรัม)
	- น้ำเปล่า: 400 มิลลิลิตร (400 มิลลิลิตร)
	- ดอกงิ้ว: 4 ดอก (2 กรัม)
	- มะเขือเทศ: 5 ลูก (120 กรัม)
	- ขนมจีน: 2 จับ (18 กรัม)
	- น้ำปลา: 1/2 ช้อนชา (2 กรัม)

	วิธีทำ
	1. โขลกส่วนผสมพริกแกงให้เข้ากัน
	2. ใส่น้ำมันพืชในหม้อตั้งไฟพอร้อน ใส่น้ำพริกแกงลงผัดจนหอม
	3. ผัดเนื้อหมูจนสุก และเข้ากันดี
	4. ใส่น้ำเปล่าลงไป หรี่ไฟแล้วเคี่ยวจนเดือด และมีกลิ่นหอม จากนั้นใส่ดอกงิ้ว และมะเขือเทศ เคี่ยวจนเข้ากัน
	5. จัดเสิร์ฟ พร้อมกะหล่ำปลีซอย กระเทียมเจียว หากชอบรสเปรี้ยวสามารถปรุงรสด้วยน้ำมะนาวตามชอบ`,
			// Region: "ภาคเหนือ",
			Image:     "https://sharp-weeclub.com/wp-content/uploads/2022/01/%E0%B8%82%E0%B8%99%E0%B8%A1%E0%B8%88%E0%B8%B5%E0%B8%991-990x510-1.jpg",
			Sodium:    401.79,
			Credit:    "https://kongthaijeen.com/cn/41301/",
			Potassium: "301",
		},
		{
			Title: "ตำขนุน",
			Description: `ส่วนประกอบพริกแกง (ต่อ 2 ที่)
  - พริกขี้หนูแห้ง: 3 เม็ด (3 กรัม)
  - กระเทียม: 3 กลีบ (6 กรัม)
  - หอมแดง: 1 หัว (6 กรัม)
  - ข่าหั่น: 1 แว่น (3 กรัม)
  - ตะไคร้ซอย: 1 ต้น (3 กรัม)
  - กะปิ: 1/4 ช้อนชา (2 กรัม)

  ส่วนประกอบ (ต่อ 2 ที่)
  - ขนุนอ่อน: 2 ชิ้น (100 กรัม)
  - เนื้อหมูสับ: 2 ช้อนโต๊ะ (40 กรัม)
  - มะเขือเทศ: 2 ลูก (15 กรัม)
  - ใบมะกรูด: 2 ใบ (1 กรัม)
  - กระเทียมเจียว: 1 ช้อนชา (5 กรัม)
  - ผักชีซอย: 1 กรัม
  - ต้นหอมซอย: 3 กรัม
  - พริกขี้หนูแห้งทอด: 1 เม็ด (1 กรัม)
  - น้ำมันรำข้าว: 2 ช้อนชา (10 กรัม)
  - กระเทียมสับ: 1 ช้อนชา (5 กรัม)
  - น้ำปลา: 1/2 ช้อนชา (2 กรัม)

  วิธีทำ
  1. หั่นขนุนอ่อนตามขวาง นำไปต้มให้เปื่อย ตักขึ้นพักไว้
  2. โขลกขนุนให้ละเอียดแล้วพักไว้ จากนั้นโขลกส่วนประกอบของพริกแกงรวมกันให้ละเอียด
  3. นำพริกแกง เนื้อหมูสับ มะเขือเทศ และขนุนมาโขลกรวมกัน
  4. เจียวกระเทียมพอเหลือง ใส่ส่วนผสมที่โขลกรวมกันแล้วลงผัดให้หอม
  5. เมื่อเนื้อหมูสุกดีแล้ว ใส่ใบมะกรูด ตามด้วยผักชี ต้นหอมซอย ลงผัดให้เข้ากัน`,
			// Region: "ภาคเหนือ",
			Image:     "https://www.maeban.co.th/upfiles/blog/469811576_1757125385107540_8515113923452393484_n.jpg",
			Sodium:    188.92,
			Credit:    "https://phiangphitc.wordpress.com/2013/07/18/%E0%B8%95%E0%B8%B3%E0%B8%82%E0%B8%99%E0%B8%B8%E0%B8%99/",
			Potassium: "152",
		},
		{
			Title: "น้ำพริกมะเขือเทศ",
			Description: `ส่วนประกอบพริกแกง (ต่อ 1 ที่)
  - มะเขือเทศย่างไฟ: 3 ลูก (50 กรัม)
  - พริกหนุ่มย่างไฟ: 3 เม็ด (40 กรัม)
  - หอมแดงย่างไฟ: 3 หัว (15 กรัม)
  - กระเทียมย่างไฟ: 4 กลีบ (8 กรัม)
  - น้ำปลา: 1/3 ช้อนชา (1.5 กรัม)
  - ไข่ต้ม: 1/2 ฟอง (25 กรัม)
  - ถั่วฝักยาว: 2 ฝัก (20 กรัม)
  - กะหล่ำปลี: 1/6 ลูก (20 กรัม)

  วิธีทำ
  1. ย่างมะเขือเทศ พริกหนุ่ม หอมแดง กระเทียม ให้สุกทั่วกัน
  2. ลอกเปลือกที่ไหม้ออก
  3. หากต้องการเผ็ดน้อย ควรเอาไส้พริกหนุ่มออก
  4. โขลกพริกหนุ่ม มะเขือเทศ หอมแดง กระเทียม ทั้งหมดให้เข้ากัน ปรุงรสด้วยน้ำปลา
  5. หากชอบรสเปรี้ยว ให้ปรุงรสด้วยน้ำมะนาวเล็กน้อย รับประทานแนมกับผักลวก และไข่ต้ม`,
			// Region: "ภาคเหนือ",
			Image:     "https://img.kapook.com/u/surauch/cook1/Thai_2.jpg",
			Sodium:    192.19,
			Credit:    "https://www.bloggang.com/m/viewdiary.php?id=thewho&month=03-2018&date=31&group=18&gblog=1",
			Potassium: "355",
		},
		{
			Title: "แอ๊บหมู",
			Description: `ส่วนประกอบพริกแกง (ต่อ 2 ที่)
- น้ำพริกแกงเผ็ด: 1 ช้อนชาพูน (7 กรัม)
- เนื้อหมูสับ: 3 ช้อนโต๊ะ (50 กรัม)
- ผักกาดขาว: 1 ก้าน (20 กรัม)
- เห็ดหูหนู: 3 ดอก (15 กรัม)
- โหระพา: 1 กิ่ง (5 กรัม)
- ผักชีฝรั่ง ใบมะกรูด: เล็กน้อย

วิธีทำ
1. ผสมน้ำพริกแกงเผ็ดกับหมูสับให้เข้ากัน
2. ซอยเห็ดหูหนู ผักชีฝรั่ง ใบมะกรูด ผสมคลุกเคล้ากับเนื้อหมู
3. ตัดใบตองซ้อนกันสองชั้น รองด้วยผักกาดขาวและโหระพา
4. ตักส่วนผสมใส่ห่อใบตอง ใช้ไม้กลัดนำไปย่างหรืออบจนสุก`,
			// Region: "ภาคเหนือ",
			Image:     "https://img.wongnai.com/p/256x256/2023/06/04/b1e8748c61d4459d826187fb574aeb1f.jpg",
			Sodium:    187.69,
			Credit:    "https://shorturl.at/YuvZu",
			Potassium: "132",
		},
		{
			Title: "ต้มโคล้งปลาช่อน",
			Description: `ส่วนประกอบพริกแกง (ต่อ 1 ที่)
- เนื้อปลาช่อนสด: 1 ช้อนโต๊ะ (25 กรัม)
- กระเทียม, ข่า, กระชาย, หอมแดง: อย่างละ 3 กรัม (รวม 18 กรัม)
- ตะไคร้, พริกบางใหญ่แห้ง
- มะเขือเทศราชินี, เห็ดนางฟ้า: 1/2 ทัพพี (40 กรัม)
- ใบมะกรูด, ใบกะเพรา, ผักชีฝรั่ง: อย่างละ 2-3 ใบ (รวม 5 กรัม)
- น้ำมะนาว: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำปลา: 1/4 ช้อนชา (1.25 กรัม)
- น้ำสะอาด: 200 มิลลิลิตร

วิธีทำ
1. นำหอม, กระเทียม, ข่า, กระชาย, ตะไคร้, พริก คั่วด้วยไฟปานกลางจนหอมและเกรียมเล็กน้อย
2. ตั้งน้ำให้เดือด ใส่เครื่องสมุนไพรที่คั่วไว้ มะเขือเทศ และเห็ดนางฟ้าลงต้มต่อจนเดือด
3. ใส่เนื้อปลาช่อนหั่นชิ้นบางลงในน้ำซุป ต้มต่อจนสุก
4. จัดใบมะกรูด, ใบกะเพรา, ผักชีฝรั่ง, น้ำมะนาว, น้ำปลา ลงในภาชนะ
5. ตักต้มโคล้งใส่ลงไป รับประทานกับข้าวสวยร้อน ๆ`,
			// Region: "ภาคกลาง",
			Image:     "https://api2.krua.co/wp-content/uploads/2020/06/SlideBanner1140x507-650.jpg",
			Sodium:    143.50,
			Credit:    "https://www.wongnai.com/reviews/71c0729575454bc18a87cdc060ac937c",
			Potassium: "230",
		},
		{
			Title: "แกงส้มเปลือกแตงโม กุ้งสด",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
- เนื้อกุ้งสดขนาดกลาง: 3 ตัว (15 กรัม) (ปอกเปลือก ผ่าหลัง)
- เนื้อปลาช่อน: 1/2 ช้อนโต๊ะ (10 กรัม)
- เปลือกแตงโม: 1 ทัพพี (80 กรัม) (เอาเฉพาะส่วนเนื้อขาว หั่นชิ้นพอดีคำ)
- พริกชี้ฟ้าแห้ง: 3 ดอก (3 กรัม) (เอาเมล็ดออก หั่นท่อนเล็กๆ)
- หอมแดง: 1/2 ช้อนโต๊ะ (10 กรัม) (ปอกเปลือก หั่นเป็นชิ้นเล็ก)
- กระเทียม: 1 กลีบเล็ก (2 กรัม) (ปอกเปลือก หั่นเป็นชิ้นเล็ก)
- กระชาย: 1/2 ช้อนโต๊ะ (10 กรัม) (หั่นท่อนเล็ก)
- กะปิ: 1/2 ช้อนชา (3 กรัม)
- น้ำตาลปี๊บ: 1/2 ช้อนชา (3 กรัม)
- มะขามเปียก: 30 กรัม (ละลายเนื้อมะขาม 10 กรัมในน้ำ 3 ช้อนโต๊ะ)
- น้ำสะอาด: 1 ถ้วยตวง (240 มิลลิลิตร)

วิธีทำ
1. ต้มน้ำให้เดือด ใส่เนื้อปลาและกุ้งสด พอสุกตักขึ้นมาพักไว้
2. เตรียมน้ำพริกแกงโดยโขลกพริกแห้ง, กระชาย, กระเทียมพอละเอียด ใส่หอมแดงลงโขลกต่อจนละเอียด
3. ใส่กะปิและเนื้อปลาที่ต้มไว้ลงโขลกให้เข้ากัน จะได้น้ำพริกแกงส้มสำหรับ 1 ที่
4. ใส่น้ำพริกแกงและเปลือกแตงโมลงต้มจนเปลือกแตงโมนุ่ม
5. ปรุงรสด้วยน้ำตาลและน้ำมะขามเปียก ตามด้วยกุ้ง รอจนสุกพร้อมตักเสิร์ฟ`,
			// Region: "ภาคกลาง",
			Image:     "https://thecookingsociety.com/wp-content/uploads/2022/02/Screen-Shot-2565-02-26-at-15.54.50.png",
			Sodium:    189.81,
			Credit:    "https://cooking.kapook.com/view75219.html",
			Potassium: "76",
		},
		{
			Title: "ผัดฉ่าไข่ขาว",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
- ไข่ต้มสุกเอาแต่ไข่ขาว: 1 ฟอง (30 กรัม)
- พริกบางใหญ่แห้ง: 2 ดอก (10 กรัม)
- กระเทียม: 3 กลีบ
- พริกหนุ่มสดหั่นเฉลียงเป็นชิ้นใหญ่: 3 ดอก (20 กรัม)
- พริกชี้ฟ้าสด (เขียว/แดง/เหลือง): อย่างละ 1 ดอกเล็ก (รวม 10 กรัม) (เอาเมล็ดออก หั่นเฉลียงเป็นชิ้นพอสวย)
- ใบมะกรูด, ผักชีฝรั่ง (ฉีกเป็นชิ้นเล็ก): อย่างละ 2-3 ใบ (รวม 3 กรัม)
- ใบกะเพราเด็ด: 3 กรัม
- กระชายสด (ซอยเป็นเส้นพอสวย): 1 ช้อนโต๊ะ (15 กรัม)
- พริกไทยอ่อน: 3 ช่อเล็ก (10 กรัม)
- น้ำมันพืช: 3 ช้อนชา (15 กรัม)
- น้ำปลา: 1/4 ช้อนชา (1.25 กรัม)
- น้ำตาลปี๊บ: 1/3 ช้อนชา (2 กรัม)

วิธีทำ
1. หั่นไข่ขาวต้มสุก 1 ฟองเป็นลูกเต๋าขนาดพอสวย คั่วด้วยไฟปานกลางพอเป็นสีเหลืองนวล ตักขึ้นพักไว้
2. โขลกกระเทียมและพริกบางใหญ่แห้งจนละเอียดและเข้ากัน จากนั้นนำไปผัดในน้ำมันจนหอม ใส่ใบมะกรูด, กระชาย แล้วใส่ไข่ขาว ตามด้วยพริกหนุ่ม, พริกชี้ฟ้าสามสี, ใบมะกรูด, ผักชีฝรั่ง, ใบกะเพรา และพริกไทยอ่อน ผัดให้เข้ากัน (ถ้าแห้ง เติมน้ำเปล่าพอขลุกขลิก)
3. ปรุงรสด้วยน้ำตาล, น้ำปลา แล้วจึงใส่ผักชีฝรั่งและใบกะเพรา ยกลงพร้อมเสิร์ฟ`,
			// Region: "ภาคกลาง",
			Image:     "https://i.ytimg.com/vi/dGQwq6GshVw/maxresdefault.jpg",
			Sodium:    185.97,
			Credit:    "https://www.youtube.com/watch?v=QluWnJGqMuU&ab_channel=%E0%B8%84%E0%B8%B8%E0%B8%93%E0%B8%AD%E0%B9%89%E0%B8%AD%E0%B8%A1%E0%B8%AA%E0%B8%B2%E0%B8%A3%E0%B8%B4%E0%B8%99%E0%B8%B5%E0%B8%81%E0%B8%B4%E0%B8%99%E0%B8%94%E0%B8%B5%E0%B8%A1%E0%B8%B5%E0%B8%AA%E0%B8%95%E0%B8%B4",
			Potassium: "130",
		},
		{
			Title: "หลนกุ้ง ผักสด",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
- เนื้อกุ้งสด ปอกเปลือก สับหยาบๆ: 1 ช้อนโต๊ะ (20 กรัม)
- น้ำกะทิ: 2 ช้อนโต๊ะ (30 กรัม)
- หอมแดงซอย: 1 ช้อนโต๊ะ (15 กรัม)
- พริกหนุ่มสด (พริกชี้ฟ้าสดเขียว/แดง/เหลือง): อย่างละ 1 ดอก (รวม 15 กรัม)
- ตะไคร้อ่อนซอยบาง: 2 ช้อนชา (10 กรัม)
- ใบมะกรูดอ่อนหั่นฝอย: 2 ช้อนชา (4 กรัม)
- มะขามเปียก: 10 กรัม (ละลายเนื้อมะขาม 10 กรัมในน้ำ 3 ช้อนโต๊ะ)
- น้ำตาลปี๊บ: 1/4 ช้อนชา (2 กรัม)
- เนื้อแตงกวาหั่น: 1/2 ลูก (20 กรัม)
- ขมิ้นขาวหั่น: 10 แว่น (20 กรัม)
- ผักกาดขาวหั่น: 1/2 ก้าน (10 กรัม)
- ถั่วฝักยาวหั่น: 1 ฝัก (10 กรัม)
- เกลือป่น: 1/8 ช้อนชา (0.5 กรัม)

วิธีทำ
1. เคี่ยวน้ำกะทิด้วยไฟปานกลาง ใส่กุ้งสับ พอสุก ใส่หอมแดงทั้งหมด, ตะไคร้ซอย 1 ช้อนชา, ใบมะกรูดซอย 1 ช้อนชา คลุกเคล้าให้เข้ากัน
2. ใส่พริกหนุ่ม, พริก 3 สี (เหลือไว้แต่งหน้าอย่างละ 2-3 ชิ้น) แล้วปรุงรสด้วยน้ำตาล, น้ำมะขามเปียก
3. พอสุก ตักใส่ถ้วย ตกแต่งโรยหน้าด้วยพริกสี, ตะไคร้ซอย, ใบมะกรูดซอย ตกแต่งด้วยผักให้สวยงาม`,
			// Region: "ภาคกลาง",
			Image:     "https://www.bloggang.com/data/jazzy-bong/picture/1436528038.jpg",
			Sodium:    203.52,
			Credit:    "https://www.bloggang.com/m/mainblog.php?id=jazzy-bong&month=11-07-2015&group=28&gblog=20",
			Potassium: "152",
		},
		{
			Title: "ข้าวผัดเบญจรงค์",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
- ข้าวสวย: 1.5 ทัพพี (80 กรัม)
- สันในไก่หั่นลูกเต๋าเล็ก: 1 ช้อนโต๊ะ (30 กรัม)
- แครอทหั่นลูกเต๋าเล็ก: 1 ช้อนโต๊ะ (10 กรัม)
- หอมใหญ่หั่นลูกเต๋าเล็ก: 1 ช้อนโต๊ะ (10 กรัม)
- เห็ดหอมหั่นลูกเต๋าเล็ก: 1 ช้อนโต๊ะ (10 กรัม)
- เมล็ดข้าวโพดหวานต้มสุก: 1 ช้อนโต๊ะ (10 กรัม)
- ถั่วฝักยาวหั่นลูกเต๋าเล็ก: 1 ช้อนโต๊ะ (10 กรัม)
- แตงกวาหั่น: 1/2 ผลเล็ก (15 กรัม)
- ต้นหอม: 1 ต้นเล็ก (40 กรัม)
- น้ำมันรำข้าว: 2 ช้อนชา (10 กรัม)
- ซีอิ๊วขาว: 1/2 ช้อนชา (3 กรัม)
- พริกไทย: เล็กน้อย

วิธีทำ
1. ตั้งกระทะใส่น้ำมันบนไฟกลางพอร้อน ใส่หอมใหญ่, เห็ดหอมลงไปผัดพอหอม
2. ใส่สันในไก่, แครอท, ถั่วฝักยาว ผัดจนสุก และใส่เมล็ดข้าวโพดหวาน
3. ใส่ข้าวสวยปรุงรสด้วยซีอิ๊วขาว ผัดให้เข้ากัน ตักใส่จาน โรยด้วยพริกไทย ตกแต่งด้วยแตงกวา, ต้นหอม`,
			// Region: "ภาคกลาง",
			Image:     "https://img.wongnai.com/p/1920x0/2021/02/19/4ebb3ee1417746ba8f552a195f26e908.jpg",
			Sodium:    355.21,
			Credit:    "https://www.sanook.com/women/tag/%E0%B8%82%E0%B9%89%E0%B8%B2%E0%B8%A7%E0%B8%9C%E0%B8%B1%E0%B8%94%E0%B8%81%E0%B8%B8%E0%B9%89%E0%B8%87/",
			Potassium: "334",
		},
		{
			Title: "ปลาสามรส",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
- เนื้อปลากะพงหั่นเป็นชิ้น: 2 ช้อนโต๊ะ (25 กรัม)
- พริกชี้ฟ้าแดง: 2 เม็ด (10 กรัม)
- หอมใหญ่หั่นสี่เหลี่ยมเล็ก: 2 ช้อนโต๊ะ (20 กรัม)
- มะเขือเทศหั่นสี่เหลี่ยมเล็ก: 2 ช้อนโต๊ะ (20 กรัม)
- มันฝรั่งหั่นสี่เหลี่ยมเล็ก: 1 ช้อนโต๊ะ (10 กรัม)
- น้ำตาลปี๊บ: 1/2 ช้อนโต๊ะ (10 กรัม)
- น้ำมะขามเปียก: 2 ช้อนโต๊ะ (20 กรัม)
- กระเทียม: 1/2 ช้อนชา (2 กรัม)
- พริกไทย: 5 เม็ด (1 กรัม)
- น้ำมันรำข้าว: 2 ช้อนชา (10 กรัม)
- น้ำปลา: 1/2 ช้อนชา (2 กรัม)
- น้ำต้มสุก: 1/4 ถ้วยตวง (60 กรัม)
- ผักชีเด็ดใบสำหรับตกแต่ง

วิธีทำ
1. ตั้งกระทะให้ร้อน ทอดปลากะพงให้เหลือง ตักขึ้นพักไว้
2. โขลกกระเทียม, พริกไทย, พริกสดพอหยาบ ใส่น้ำซุปลงไปเล็กน้อย ผัดให้หอม
3. ใส่หอมใหญ่, มันฝรั่ง, มะเขือเทศ ปรุงรสด้วยน้ำตาลปี๊บ, น้ำมะขาม, น้ำปลา
4. นำปลาที่ทอดไว้จัดใส่จาน ราดซอสบนปลาที่ทอดแล้ว แต่งหน้าด้วยผักชีและพริกชี้ฟ้าแดง`,
			// Region: "ภาคกลาง",
			Image:     "https://www.ajinomoto.co.th/storage/photos/shares/Recipe/Menu/Lot5-16/61fa99ec4d2b6.jpg",
			Sodium:    207.17,
			Credit:    "https://shop.line.me/@nuy98/product/1000746977",
			Potassium: "269",
		},
		{
			Title: "ยำใหญ่",
			Description: `ส่วนประกอบ (ต่อ 3 ที่)
- ไข่ขาวต้มปอกเปลือกผ่าสี่: 1 ฟอง (30 กรัม)
- ปลาหมึกสดหั่น: 1/4 ถ้วยตวง (40 กรัม)
- กุ้งสดปอกเปลือกผ่าหลัง: 3 ตัว (40 กรัม)
- แครอทฝานบางๆ: 1/2 ถ้วยตวง (20 กรัม)
- หอมใหญ่หั่น: 1/2 ถ้วยตวง (40 กรัม)
- หัวไชเท้าฝานบางๆ: 1/4 ถ้วยตวง (40 กรัม)
- แตงกวาฝานบางๆ: 1/2 ถ้วยตวง (40 กรัม)
- ขึ้นฉ่ายหั่น: 1/4 ถ้วยตวง (20 กรัม)

ส่วนประกอบน้ำปรุงรส (ต่อ 3 ที่)
- พริกชี้ฟ้าแดงโขลกหยาบ: 3 เม็ด (20 กรัม)
- น้ำมะนาว: 2 ช้อนโต๊ะ (30 กรัม)
- น้ำปลา: 1/2 ช้อนชา (3 กรัม)
- น้ำตาลทราย: 2 ช้อนชา (10 กรัม)
วิธีทำ
1. ลวกปลาหมึกสด, กุ้งสดในน้ำเดือด จากนั้นตักขึ้นพักไว้ให้สะเด็ดน้ำ
2. ผสมน้ำปลา, น้ำตาลทราย เติมน้ำเล็กน้อย คนพอเข้ากัน ใส่พริกสดที่โขลกละเอียดแล้ว จากนั้นเคี่ยวบนไฟพอเดือดทิ้งให้เย็น ใส่น้ำมะนาว
3. ผสมปลาหมึกสด, กุ้งสด, ไข่ขาว, แครอท, หอมใหญ่, แตงกวา, หัวไชเท้า และน้ำยำในข้อ 2 คลุกให้เข้ากัน จากนั้นตักใส่จาน ยกขึ้นเสิร์ฟ`,
			// Region: "ภาคกลาง",
			Image:     "https://img.wongnai.com/p/1920x0/2018/09/11/60880f95ecfd4ff68756ec9e680a6f3f.jpg",
			Sodium:    169.32,
			Credit:    "https://www.wongnai.com/recipes/mixed-spicy-salad-recipe",
			Potassium: "175",
		},

		{
			Title: "ต้มจับฉ่ายหมูสันนอก",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- หมูสันนอกหั่นชิ้น: 4 ช้อนโต๊ะ (60 กรัม)
- หัวไชเท้า: 1/2 ถ้วยตวง (50 กรัม)
- เห็ดฟาง: 1/2 ถ้วยตวง (50 กรัม)
- กะหล่ำปลี: 1/2 ถ้วยตวง (40 กรัม)
- ต้นกระเทียม: 1/2 ถ้วยตวง (30 กรัม)
- ผักโขม: 1/2 ถ้วยตวง (30 กรัม)
- ขึ้นฉ่าย: 1/2 ถ้วยตวง (30 กรัม)
- คะน้า: 1/2 ถ้วยตวง (30 กรัม)
- ผักกาดขาว: 1/2 ถ้วยตวง (30 กรัม)
- ผักกวางตุ้ง: 1/2 ถ้วยตวง (30 กรัม)
- กระเทียม: 10 กรัม
- น้ำมันรำข้าว: 2 ช้อนชา (10 กรัม)
- น้ำตาลปี๊บ: 1 ช้อนชา (5 กรัม)
- ซีอิ๊วดำ: 1/2 ช้อนชา (3 กรัม)
- ซีอิ๊วขาว: 1 ช้อนชา (5 กรัม)
- น้ำเปล่า: 3 ถ้วยตวง (750 กรัม)
  วิธีทำ
1. ล้างผักทุกชนิดด้วยน้ำสะอาด สะเด็ดน้ำให้แห้ง
2. หั่นผักทุกชนิดเป็นชิ้นใหญ่ๆ
3. ทุบกระเทียมพอแตก นำลงผัดในน้ำมันให้หอม ใส่เนื้อหมูลงผัด เคี่ยวหมูจนนุ่ม ใส่น้ำตาลปี๊บผัดให้หอมจนน้ำตาลละลาย
4. ใส่ซีอิ๊วขาว, ซีอิ๊วดำ ผัดไปเรื่อยๆ เติมผักที่หั่นลงไป ผัดต่อประมาณ 10 นาที
5. เติมน้ำต้มสุกให้ปริมาณน้ำต่ำกว่าผักเล็กน้อย ต้มไฟอ่อนๆ ต่อจนผักเปื่อย แล้วตักใส่ชามพร้อมเสิร์ฟ`,
			// Region: "ภาคกลาง",
			Image:     "https://static.thairath.co.th/media/dFQROr7oWzulq5Fa5LJGNmDUIqkiQVkYDqXcFTh41EztNktBWbceEb2EWQpvlrKxcWU.jpg",
			Sodium:    203.95,
			Credit:    "https://shorturl.at/Wdgo0",
			Potassium: "329",
		},

		{
			Title: "ผัดผักรวมไข่ขาว",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
- ไข่ไก่ไข่ขาว: 3 ช้อนโต๊ะ (30 กรัม)
- น้ำมันพืชสำหรับทอดไข่: 1 ช้อนชา (5 กรัม)
- ผักกาดขาว: 1 ถ้วยตวง (70 กรัม)
- ถั่วฝักยาวหั่นท่อน: 2 ช้อนโต๊ะ (20 กรัม)
- แครอทหั่นสี่เหลี่ยม: 1 ช้อนโต๊ะ (10 กรัม)
- กระเทียมสับ: 1 ช้อนชา (5 กรัม)
- ซีอิ๊วขาว: 1/4 ช้อนชา (1.25 กรัม)
- น้ำมันพืชสำหรับผัด: 1 ช้อนชา (5 กรัม)
วิธีทำ
1. ทอดไข่ขาวให้พอเหลือง หั่นเป็นสี่เหลี่ยม
2. ล้างผักต่างๆ ให้สะอาด
3. ตั้งไฟ เจียวกระเทียมให้เหลืองหอม ใส่ถั่วฝักยาว, แครอท, ผักกาดขาว, ไข่ขาว แล้วผัดให้สุก
4. ปรุงรสด้วยซีอิ๊วขาว คนให้เข้ากันพอสุกยกลง`,
			// Region: "ภาคกลาง",
			Image:     "https://img.kapook.com/u/2018/surauch/cooking/co1/pk2.jpg",
			Sodium:    216.82,
			Credit:    "https://cooking.kapook.com/view207896.html",
			Potassium: "350",
		},

		{
			Title: "ไข่ยัดไส้กะเพราหอม",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
- ไข่ขาวดิบ: 4 1/2 ช้อนโต๊ะ (45 กรัม)
- นมสดพร่องมันเนย: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำมันพืชสำหรับผัด: 1 ช้อนชา (5 กรัม)
- กระเทียม: 1 ช้อนชา (5 กรัม)
- พริกขี้หนูสับ: 1/2 ช้อนชา (3 กรัม)
- หอมใหญ่: 1 ช้อนโต๊ะ (15 กรัม)
- เห็ดฟาง: 2 ช้อนโต๊ะ (20 กรัม)
- ใบกะเพรา: 1 ช้อนโต๊ะ (15 กรัม)
- ซีอิ๊วขาว: 1/5 ช้อนชา (1 กรัม)
- น้ำมันพืชสำหรับทอด: 1 ช้อนชา (5 กรัม)
วิธีทำ 
1. ตั้งกระทะใส่น้ำมันพอร้อน ใส่กระเทียมสับ, พริกขี้หนูสับ, หอมใหญ่ ผัดพอหอม ใส่เห็ดฟาง ผัดให้เข้ากันใส่ใบกะเพรา ปรุงรสด้วยซีอิ๊วขาว ยกลงพักไว้
2. ผสมไข่ขาวกับนมสดคนให้เข้ากัน
3. ตั้งกระทะพอร้อน ใส่ไข่ที่ผสมแล้ว ทอดแผ่ให้ทั่วกระทะใส่ส่วนผสมข้อที่ 1 วางตรงกลางไข่ เสร็จแล้วจึงค่อยๆ ห่อไข่เป็นรูปสี่เหลี่ยม พอสุกยกลงเสิร์ฟพร้อมผักต่างๆ`,
			// Region: "ภาคกลาง",
			Image:     "https://img.wongnai.com/p/1968x0/2020/03/24/524ed43d3e914520934b9f277820f00b.jpg",
			Sodium:    212.36,
			Credit:    "https://www.wongnai.com/recipes/ugc/08e2db7d1ac74e20b284c21388751dbd",
			Potassium: "244",
		},
		{
			Title: "ขนมจีนน้ำยาปักษ์ใต้",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- เนื้อปลาต้มหรือนึ่งสุก: 8 ช้อนโต๊ะ (120 กรัม) (ใช้ปลาช่อน หรือปลาทะเลเช่นปลาน้ำดอกไม้หรือปลาทูสด)
- น้ำพริกน้ำยาแกงปักษ์ใต้: 1 ช้อนโต๊ะ (15 กรัม)
- กะทิ: 1/2 ถ้วย (120 กรัม)
- น้ำเปล่า หรือหางกะทิ: 1.5 ถ้วย (360 กรัม)
- น้ำตาลปี๊บ: 1 ช้อนชา (5 กรัม)
- น้ำปลาดี: 1 ช้อนชา (5 กรัม)
- ใบมะกรูด (ฉีกเป็นชิ้นเล็ก): 5 ใบ (5 กรัม)
- ขนมจีน (คนละ 1.5 จับ หรือ 135 กรัม): 540 กรัม
- ผักเคียง: แตงกวาหั่นเป็นชิ้น 2 ลูก (50 กรัม), ถั่วฝักยาวหั่นเป็นท่อน 3 ผักใหญ่ (35 กรัม), ยอดมะม่วงหิมพานต์ 7 ยอด (40 กรัม)

วิธีทำ
1. นำเนื้อปลาต้มสุกแกะเอาแต่เนื้อมาโขลกรวมกันกับพริกแกงน้ำยาให้เป็นเนื้อเดียวกัน พักไว้
2. นำหางกะทิหรือน้ำเปล่า 1.5 ถ้วยตั้งไฟใช้ไฟปานกลาง คนให้เดือด ใส่เนื้อปลาที่โขลกรวมกับพริกแกง ละลายคนให้เข้ากัน
3. ใส่ใบมะกรูดที่ฉีกเป็นชิ้นเล็ก ๆ ลงในน้ำยา ปรุงรสด้วยน้ำตาลปี๊บ และน้ำปลาดี ชิมรส คนให้เข้ากัน เติมกะทิ 1/2 ถ้วย คนจนเดือด ยกลงเสิร์ฟพร้อมขนมจีน และผักเคียง

หมายเหตุ: กรณีผู้ป่วยเบาหวาน สามารถเพิ่มรสหวานโดยใส่น้ำตาลเทียมแทนน้ำตาลปี๊บและน้ำตาลทราย`,
			// Region: "ภาคใต้",
			Image:     "https://img.kapook.com/u/2017/surauch/cooking/y1_4.jpg",
			Sodium:    315.75,
			Credit:    "https://shorturl.at/TpDA3",
			Potassium: "156",
		},
		{
			Title: "น้ำพริกแกงปักษ์ใต้",
			Description: `ส่วนประกอบ (ต่อ 13 ช้อนโต๊ะ)
- พริกขี้หนูแห้ง: 22 เม็ด (18 กรัม)
- ตะไคร้หั่นซอย: 5 ต้น (50 กรัม)
- ขมิ้นสด: 2 แง่ง (40 กรัม)
- หอมแดงปอกเปลือก: 5 หัว (25 กรัม)
- กระเทียม: 40 กลีบ (50 กรัม)
- ข่าหั่นละเอียด: 5 แว่น (10 กรัม)
- ผิวมะกรูดหั่นซอยเป็นชิ้นเล็ก: 10 กรัม
- เกลือป่น: 1/2 ช้อนชา (2.5 กรัม)
- พริกไทยเม็ด: 15 เม็ด (15 กรัม)
- กะปิ: 4 ช้อนชา (20 กรัม)

วิธีทำ
1. นำทุกอย่างยกเว้นกะปิ โขลกรวมกันในครกให้ละเอียด
2. ใส่กะปิโขลกให้เข้ากันพักไว้เพื่อนำไปปรุงน้ำยา

หมายเหตุ: สูตรน้ำพริกนี้เมื่อทำเสร็จจะได้ 195 กรัม (13 ช้อนโต๊ะ) สามารถนำไปเป็นเครื่องปรุงน้ำพริกแกงคั่ว น้ำยาปักษ์ใต้ ผัดเผ็ด คั่วกลิ้ง หรือแกงไตปลา ฯลฯ`,
			// Region: "ภาคใต้",
			Image:     "https://jeeor.com/wp-content/uploads/2023/08/%E0%B8%A0%E0%B8%B2%E0%B8%9E%E0%B8%9B%E0%B8%81%E0%B8%AB%E0%B8%99%E0%B9%89%E0%B8%B2%E0%B9%84%E0%B8%95%E0%B8%9B%E0%B8%A5%E0%B8%B2-Recovered.jpg",
			Sodium:    172.66,
			Credit:    "https://jeeor.com/?page_id=3444",
			Potassium: "69",
		},
		{
			Title: "คั่วกลิ้งหมู",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- หมูเนื้อแดง บดละเอียด: 6 1/3 ช้อนโต๊ะ (100 กรัม)
- น้ำพริกแกงปักษ์ใต้: 4 ช้อนชา (20 กรัม)
- น้ำเปล่า: 1/4 ถ้วยตวง (60 กรัม)
- พริกไทยสด: 5 ช่อ (20 กรัม)
- ตะไคร้หั่นฝอย: 1 ช้อนโต๊ะ (15 กรัม)
- ข่าสดสับละเอียด: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำปลาดี: 1 ช้อนชา (5 กรัม)
- น้ำตาลปี๊บ: 1 ช้อนชา (5 กรัม)
- พริกชี้ฟ้าแดงหั่นเป็นเส้นสำหรับโรยหน้า: 1 เม็ด (3 กรัม)
- ใบมะกรูดหั่นฝอยละเอียด: 5 ใบ (5 กรัม)
- ผักสด: แตงกวาหั่นเป็นชิ้น 1 ผล (30 กรัม), ถั่วฝักยาว 3 ผัก (30 กรัม), ยอดมะม่วงหิมพานต์ 8 ยอด (40 กรัม), ยอดมันปู 5 ยอด (30 กรัม)

วิธีทำ
1. ใส่น้ำเปล่าลงในกระทะ ตั้งไฟพอร้อนใส่เนื้อหมูสับลงไปผัดจนเกือบสุก
2. จากนั้นใส่น้ำพริกคั่วกลิ้งลงไปผัดกับหมูสับให้เข้ากัน ปรุงรสด้วยน้ำตาลปี๊บ และน้ำปลา ผัดให้เข้ากัน
3. ปิดไฟแล้วใส่พริกไทยอ่อน, ตะไคร้หั่นฝอย ข่าสดสับ พริกชี้ฟ้าแดงหั่น และใบมะกรูดซอยลงไปผัดให้เข้ากัน ตักใส่จาน เสิร์ฟพร้อมกับผักสดตามชอบ`,
			// Region: "ภาคใต้",
			Image:     "https://www.unileverfoodsolutions.co.th/dam/global-ufs/mcos/SEA/calcmenu/recipes/TH-recipes/red-meats-&-red-meat-dishes/%E0%B8%84%E0%B8%B1%E0%B9%88%E0%B8%A7%E0%B8%81%E0%B8%A5%E0%B8%B4%E0%B9%89%E0%B8%87%E0%B8%AB%E0%B8%A1%E0%B8%B9/%E0%B8%84%E0%B8%B1%E0%B9%88%E0%B8%A7%E0%B8%81%E0%B8%A5%E0%B8%B4%E0%B9%89%E0%B8%87%E0%B8%AB%E0%B8%A1%E0%B8%B9_header.jpg",
			Sodium:    201.02,
			Credit:    "https://www.unileverfoodsolutions.co.th/th/recipe/%E0%B8%84%E0%B8%B1%E0%B9%88%E0%B8%A7%E0%B8%81%E0%B8%A5%E0%B8%B4%E0%B9%89%E0%B8%87%E0%B8%AB%E0%B8%A1%E0%B8%B9-R90018816.html",
			Potassium: "164",
		},
		{
			Title: "ต้มกะทิผักเหลียงกุ้งสด",
			Description: `ส่วนประกอบเครื่องปรุง (ต่อ 3 ที่)
- หอมแดง: 5 หัว (25 กรัม)
- กะปิ: 1 ช้อนชา (5 กรัม)
- พริกไทย: 20 เม็ด (8 กรัม)

ส่วนประกอบต่อ 3 ที่
- กะทิคั้น: 1/2 ถ้วยตวง (120 กรัม)
- น้ำเปล่าหรือหางกะทิ: 1 ถ้วยตวง (240 กรัม)
- ผักเหลียงเด็ดเอาแต่ใบ: 100 กรัม
- กุ้งสดปอกเปลือก หั่นเป็นชิ้นสั้นขนาด 1 ซม.: 8 ตัว (80 กรัม)
- น้ำตาลปี๊บ: 1 ช้อนชา (5 กรัม)
- น้ำปลาดี: 1/2 ช้อนชา (2.5 กรัม)

วิธีทำ
1. ล้างผักเหลียงให้สะอาด สะเด็ดน้ำ เด็ดเอาแต่ใบ หากใบใหญ่ให้ฉีกให้เล็กลง
2. โขลกหอมแดง กะปิ พริกไทย จนละเอียด และเข้ากัน
3. นำหางกะทิตั้งไฟพอใกล้เดือดใส่เครื่องปรุงรสที่โขลกละลายคนให้เข้ากัน
4. พอเดือดใส่ใบผักเหลียง กะทิ น้ำตาลปี๊บ น้ำปลาดี เมื่อน้ำเดือด เคี่ยวต่อสักพัก
5. หมั่นคนกะทิบ่อยๆ อย่าให้กะทิแตกมัน
6. ใส่กุ้งสด เร่งไฟให้แรง จะช่วยป้องกันผักเหม็นเขียวได้ เติมหัวกะทิคนไม่ให้กะทิแตกมัน เมื่อกะทิเดือดอีกครั้ง ยกลงตักเสิร์ฟ`,
			// Region: "ภาคใต้",
			Image:     "https://img.wongnai.com/p/1920x0/2017/10/13/c4cd67bcd224401f800730cd9e4f3d02.jpg",
			Sodium:    115.93,
			Credit:    "https://nlovecooking.com/%E0%B9%83%E0%B8%9A%E0%B9%80%E0%B8%AB%E0%B8%A5%E0%B8%B5%E0%B8%A2%E0%B8%87%E0%B8%95%E0%B9%89%E0%B8%A1%E0%B8%81%E0%B8%B0%E0%B8%97%E0%B8%B4/",
			Potassium: "53",
		},
		{
			Title: "ผัดผักเหลียงไข่ขาว",
			Description: `ส่วนประกอบ (ต่อ 3 ที่)
- ผักเหลียง: 2 กำ (120 กรัม)
- ไข่ขาว: 3 ฟอง (105 กรัม)
- น้ำตาลทราย: 1 ช้อนชา (5 กรัม)
- น้ำมันหอย: 1 ช้อนชา (5 กรัม)
- ซีอิ๊วขาว: 1/2 ช้อนชา (2.5 กรัม)
- พริกไทยป่น: 1/2 ช้อนชา (2.5 กรัม)
- กระเทียมสับละเอียด: 2 ช้อนชา (10 กรัม)
- น้ำมันพืช: 3 ช้อนชา (15 กรัม)
- น้ำเปล่า: 6 ช้อนโต๊ะ (90 กรัม)

วิธีทำ
1. ล้างผักเหลียงให้สะอาด สะเด็ดน้ำ เด็ดเอาแต่ใบ หากใบใหญ่ให้ฉีกให้เล็กลง
2. ตอกไข่ไก่แยกไข่ขาว-ไข่แดง เติมน้ำเปล่า 50 ซีซี ตีผสมให้เข้ากันแล้วพักไว้
3. ตั้งกระทะ ใส่น้ำมัน ตั้งไฟกลาง รอน้ำมันอุ่น จากนั้นนำกระเทียมลงไปเจียวพอหอม หรือเริ่มเหลือง
4. เทไข่ขาวลงในกระทะคนให้สุก ใส่ใบเหลียงลงไป พร้อมน้ำเปล่า 30 ซีซี ผัดให้สุก
5. ใส่เครื่องปรุงรส น้ำมันหอย ซีอิ๊วขาว น้ำตาลทราย คนให้เข้ากันยกลงตักเสิร์ฟ
6. โรยหน้าด้วยพริกไทยป่น`,
			// Region: "ภาคใต้",
			Image:     "https://img.wongnai.com/p/1920x0/2019/03/07/fd1ee1e79c1043c281b46c47b8f8f6e6.jpg",
			Sodium:    201.07,
			Credit:    "https://www.wongnai.com/recipes/ugc/330d0ad616a2490ebdbef06a61f86835",
			Potassium: "79",
		},
		{
			Title: "แกงเหลืองสับปะรด ปลากะพง",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- น้ำเปล่า: 2 ถ้วย (480 กรัม)
- น้ำพริกแกงเหลือง: 1 ช้อนโต๊ะ (15 กรัม)
- สับปะรดหั่นเป็นชิ้น: 1/2 ลูก (250 กรัม)
- เนื้อปลากะพง: 1/2 ถ้วย (120 กรัม)
- น้ำมะขามเปียก: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำมะนาว: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำตาลปี๊บ: 2 ช้อนชา (10 กรัม)
- น้ำตาลทราย: 2 ช้อนชา (10 กรัม)
- ส้มแขก: 3 กรัม (3 กรัม)
- น้ำปลาดี: 1 ช้อนชา (5 กรัม)

วิธีทำ
1. ต้มน้ำเปล่าพอเดือด ใส่น้ำพริกแกงเหลืองคนให้เข้ากัน
2. ใส่สับปะรด ต้มด้วยไฟอ่อน ประมาณ 20 นาที
3. ใส่เนื้อปลากะพง ปิดฝาหม้อ รอให้เดือดและปลาสุก เปิดฝา คนพอเข้ากัน
4. ปรุงรสด้วยน้ำมะขามเปียก น้ำตาลทราย น้ำตาลปี๊บ ชิมรส และใส่น้ำมะนาว
5. คนให้เข้ากัน ยกลงตักเสิร์ฟ

หมายเหตุ: รสหวานของแกงเหลืองขึ้นอยู่กับความสุกของสับปะรด ดังนั้นควรค่อยๆ ปรุงน้ำตาลทีละน้อย`,
			// Region: "ภาคใต้",
			Image:     "https://img.wongnai.com/p/1920x0/2019/11/30/b3f5f4b444cd446aab4fc25d8b87880c.jpg",
			Sodium:    203.16,
			Credit:    "https://www.wongnai.com/recipes/ugc/aafcebb8d02d4b69a84a05a69e128a4e",
			Potassium: "134",
		},
		{
			Title: "พริกแกงเหลือง",
			Description: `ส่วนประกอบพริกแกง (ต่อ 6 ช้อนโต๊ะ)
- พริกขี้หนูแห้ง: 12 เม็ด (10 กรัม)
- หอมแดง: 8 หัว (40 กรัม)
- กระเทียม: 16 กลีบ (20 กรัม)
- กะปิ: 2 ช้อนชา (10 กรัม)
- เกลือป่น: 1/2 ช้อนชา (2.5 กรัม)
- ข้าวสาร: 20 กรัม

วิธีทำ
1. นำทุกอย่างยกเว้นกะปิ โขลกรวมกันในครกให้ละเอียด
2. ใส่กะปิโขลกให้เข้ากัน พักไว้เพื่อนำไปแกง

หมายเหตุ: สูตรน้ำพริกนี้เมื่อทำเสร็จจะได้ 90 กรัม (6 ช้อนโต๊ะ) ข้าวสารทำให้แกงมีน้ำข้นนำไปเป็นเครื่องปรุงน้ำพริกแกงเหลืองใส่ผัก และปลาหรือกุ้งสดได้หลากหลาย เช่น แกงเหลืองมะละกอใส่กุ้งสด หรือแกงเหลืองสับปะรดใส่ปลาช่อน 
หรือแกงเหลืองยอดมะพร้าวใส่ปลากะพง ฯลฯ`,
			// Region: "ภาคใต้",
			Image:     "https://www.thaimee-d.com/pub/media/catalog/product/cache/9ef2995c1c404cd4852076153399d50d/f/i/file_17_3.jpg",
			Sodium:    268.32,
			Credit:    "https://www.lazada.co.th/products/500-i4821168369.html",
			Potassium: "41",
		},

		{
			Title: "น้ำพริกกุ้งสด",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- กะปิ: 2 1/3 ช้อนชา (13 กรัม)
- กุ้งสด: 8 ตัว (80 กรัม)
- กระเทียมแกะเปลือก: 1 1/2 หัว (25 กรัม)
- น้ำตาลปี๊บ: 4 ช้อนชา (20 กรัม)
- น้ำมะนาว: 3 ช้อนโต๊ะ (45 กรัม)
- พริกขี้หนูสวน: 8 เม็ด (10 กรัม)
- หอมแดงซอย: 8 หัว (40 กรัม)
- ผักจิ้มน้ำพริก: แตงกวา 1 ลูกใหญ่ (30 กรัม), ถั่วพูต้มสุก 4 ฝัก (30 กรัม), ใบมะม่วงหิมพานต์ 6 ยอด (30 กรัม), ลูกเนียง 1 ลูก (10 กรัม), สะตอ 2 เม็ด (10 กรัม)

วิธีทำ
1. นำกุ้งไปต้มให้สุก แกะเอาแต่เนื้อ แล้วหั่นเป็นชิ้นเล็กๆ
2. นำกะปิห่อใบตองปิ้งให้สุกหอมพักไว้
3. นำกะปิที่ปิ้งไว้ กระเทียม และพริกขี้หนู โขลกหยาบๆ ในครก แบ่งเนื้อกุ้งมา 1 ใน 3 ส่วน ใส่ลงไปโขลกพร้อมน้ำพริก ปรุงรสด้วยน้ำตาลปี๊บ และมะนาว ชิมดูให้ออกรสเปรี้ยวหวาน
4. ใส่เนื้อกุ้งที่เหลือ หอมแดงซอยลงไปคลุกเคล้าให้เข้ากัน (ไม่ต้องตำ) จากนั้นตักใส่ถ้วย เสิร์ฟคู่กับผักสด - ผักลวกตามชอบ`,
			// Region: "ภาคใต้",
			Image:     "https://www.gourmetandcuisine.com/Images/cooking/recipes/recipe_502detail.jpg",
			Sodium:    197.37,
			Credit:    "https://www.wongnai.com/restaurants/2146372Lg-%E0%B9%80%E0%B8%A2%E0%B8%B5%E0%B9%88%E0%B8%A2%E0%B8%A1%E0%B9%83%E0%B8%95%E0%B9%89-south-cuisine",
			Potassium: "106",
		},

		{
			Title: "แกงคั่วหมูใบยี่หร่า",
			Description: `ส่วนประกอบ (ต่อ 2 ที่)
- หมูสันนอกหั่นเป็นชิ้นขนาด 0.5×1.5×1 นิ้ว: 531 ช้อนโต๊ะ (80 กรัม)
- น้ำพริกแกงเหลือง: 31 ช้อนโต๊ะ (20 กรัม)
- น้ำเปล่า: 1 1/2 ถ้วย (360 มิลลิลิตร)
- น้ำปลาดี: 1 ช้อนชา (5 กรัม)
- น้ำตาลปี๊บ: 1 ช้อนชา (5 กรัม)
- ใบมะกรูดฉีกเป็นชิ้นเล็ก: 5 ใบ (5 กรัม)
- ใบยี่หร่า: 20 ใบ (30 กรัม)

วิธีทำ
1. ตั้งน้ำให้ร้อน ใส่หมูเนื้อแดงลงไปต้มจนเดือด
2. เติมน้ำพริกแกงคนให้เข้ากัน แล้วเคี่ยวด้วยไฟอ่อนๆ ใส่ใบมะกรูดลงไป เคี่ยวจนหมูเริ่มเปื่อย
3. ปรุงรสด้วยน้ำปลาดี น้ำตาลปี๊บ เคี่ยวให้เหลือน้ำขลุกขลิก ใส่ใบยี่หร่ายกลงตักเสิร์ฟกับข้าวสวยร้อนๆ`,
			// Region: "ภาคใต้",
			Image:     "https://i.ytimg.com/vi/5WmM3b-gaIY/sddefault.jpg",
			Sodium:    180.15,
			Credit:    "https://www.youtube.com/watch?v=5WmM3b-gaIY&ab_channel=EasyYummy",
			Potassium: "158",
		},

		{
			Title: "ผัดหมี่กุ้งสด",
			Description: `ส่วนประกอบน้ำพริกผัด (ต่อ 3 ที่)
- พริกชี้ฟ้าแห้งเม็ดใหญ่ เอาไส้ออกแช่น้ำให้นิ่ม: 3 เม็ด (7 กรัม)
- หอมแดง: 4 หัว (20 กรัม)

ส่วนประกอบ (ต่อ 3 ที่)
- ก๋วยเตี๋ยวเส้นเล็กหรือเส้นหมี่ขาว: 180 กรัม
- น้ำกะทิ: 1 ถ้วยตวง (240 กรัม)
- กุ้งสดแกะเปลือกผ่าหลัง: 6 ตัว (60 กรัม)
- น้ำตาลปี๊บ: 5 ช้อนชา (25 กรัม)
- น้ำเปล่า: 100 มิลลิลิตร (100 กรัม)
- น้ำปลาอย่างดี: 1 ช้อนชา (5 กรัม)
- น้ำมะขามเปียก: 1 ช้อนโต๊ะ (15 กรัม)

ผักเคียง (ต่อ 3 ที่)
- ถั่วงอก: 3 ช้อนโต๊ะ (30 กรัม)
- มะม่วงสับหั่นฝอย: 3 ช้อนโต๊ะ (30 กรัม)
- ใบกุยช่าย: 2 ช้อนโต๊ะ (20 กรัม)
- ใบบัวบก: 2 ช้อนโต๊ะ (20 กรัม)

วิธีทำ
1. เตรียมส่วนผสมน้ำพริกผัด โดยนำพริกชี้ฟ้า หอมแดงโขลกรวมกันให้ละเอียด จะได้น้ำพริกสำหรับผัด 25 กรัม พักไว้เพื่อนำไปผัดหมี่
2. นำเส้นก๋วยเตี๋ยวเส้นเล็กหรือเส้นหมี่ขาวแช่น้ำให้นิ่ม สรงใส่ตะแกรงพักไว้
3. ตั้งกระทะใส่กะทิเคี่ยวกับน้ำพริกหมี่ที่โขลกไว้ คนให้เข้ากัน เติมน้ำตาลปี๊บ น้ำมะขามเปียก น้ำปลา คนให้น้ำตาลปี๊บละลาย
4. นำก๋วยเตี๋ยวเส้นเล็กหรือเส้นหมี่ขาวลงผัดกับน้ำแกงผัดหมี่ ใส่กุ้งสดลงผัดให้สุก เติมน้ำเปล่า ผัดคลุกจนเส้นนิ่ม ยกลงจัดใส่จาน รับประทานกับผัก เช่น แตงกวา ใบบัวบก ถั่วงอก ใบกุยช่าย มะนาว มะม่วงสับฝอย หรือลูกมุดสับฝอย`,
			// Region: "ภาคใต้",
			Image:     "https://img.wongnai.com/p/1920x0/2019/11/03/0f27887e3dcf43c9879e6693588e3751.jpg",
			Sodium:    228.69,
			Credit:    "https://www.wongnai.com/recipes/ugc/74fb5e3274c24f17b01926ffcf9bcabe",
			Potassium: "108",
		},

		{
			Title: "ปลาต้มขมิ้น",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- ปลาทูสดล้างสะอาด หั่นเป็นชิ้น (ชิ้นละ 30 กรัม): 2 ตัว (120 กรัม)
- ขมิ้นชันล้างสะอาด ปอกผิวออก ทุบหรือหั่นเป็นชิ้น: 12 แว่น (25 กรัม)
- หอมแดง: 5 หัว (25 กรัม)
- ตะไคร้ล้างสะอาดหั่นแฉลบเป็นชิ้น: 4 ต้น (40 กรัม)
- ส้มแขก: 4 ชิ้น (3 กรัม)
- กระเทียมแกะกลีบ: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำมะขามเปียก: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำตาลปี๊บ: 1 ช้อนชา (5 กรัม)
- น้ำตาลทราย: 2 ช้อนชา (10 กรัม)
- เกลือป่น: 1/4 ช้อนชา (1.5 กรัม)
- พริกขี้หนูสดบุบพอแตก: 4 เม็ด (5 กรัม)
- น้ำเปล่า: 2 ถ้วยตวง (480 กรัม)

วิธีทำ
1. ตั้งหม้อใส่น้ำเปล่า ตะไคร้ ขมิ้น หอมแดงบุบ และกระเทียม ตั้งไฟเคี่ยวจนมีกลิ่นหอมและสีขมิ้นออก
2. พอเดือด ใส่ส้มแขก เกลือป่น น้ำตาลปี๊บ น้ำตาลทราย และน้ำมะขามเปียก เคี่ยวสักพัก
3. ใส่ปลากระบอกต้มจนสุก
4. ใส่พริกขี้หนูสด ยกลงตักเสิร์ฟ`,
			// Region: "ภาคใต้",
			Image:     "https://i.ytimg.com/vi/S3V3tA18wAY/maxresdefault.jpg",
			Sodium:    182.28,
			Credit:    "https://www.youtube.com/watch?v=S3V3tA18wAY&ab_channel=%E0%B8%84%E0%B8%A3%E0%B8%B1%E0%B8%A7%E0%B8%9E%E0%B8%B5%E0%B9%88%E0%B8%81%E0%B8%B1%E0%B8%8D%E0%B8%8D%E0%B9%8CKruaP%27gunn",
			Potassium: "157",
		},
		{
			Title: "ข้าวยำปักษ์ใต้และน้ำบูดู",
			Description: `วิธีทำข้าวยำปักษ์ใต้
ผสมน้ำบูดูในข้าวสวย คลุกเคล้าจนทั่ว ใส่มะพร้าวคั่ว กุ้งแห้งป่น ใส่ผักทุกอย่างลงไปคลุกให้เข้ากัน เติมพริกขี้หนูแห้งปั่น หากชอบเปรี้ยวปรุงรสด้วยน้ำมะนาวตามชอบ
ส่วนประกอบน้ำบูดู (ต่อ 24 ช้อนโต๊ะ)
- น้ำตาลปี๊บ: 4 ช้อนโต๊ะ (60 กรัม)
- ตะไคร้: 2 1/2 ต้น (25 กรัม)
- หอมแดง: 6 หัว (30 กรัม)
- ข่าสด: 5 แว่น (10 กรัม)
- น้ำบูดู: 2 ช้อนโต๊ะ (30 กรัม)
- ซีอิ๊วแดงหวาน: 1/2 ช้อนชา (3 กรัม)
- น้ำเปล่า: 2 ถ้วยตวง (480 มิลลิลิตร)

ส่วนประกอบข้าวยำ (ต่อ 4 ที่)
- ผักหวานเด็ดใบอ่อน: 3 ถ้วยตวง (100 กรัม)
- ผักติ้ว: 5 ยอด (5 กรัม)
- ไข่มดแดง: 6 ช้อนโต๊ะ (120 กรัม)
- ปลาช่อน: 6 ช้อนโต๊ะ (90 กรัม)
- เกลือ: 1/6 ช้อนชา (0.75 กรัม)
- น้ำปลาร้า: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำเปล่า: 2 ถ้วยตวง (400 กรัม)
- พริกขี้หนูสด: 5 - 6 เม็ด (5 กรัม)
- หอมแดงซอย: 10 ช้อนชา (50 กรัม)
- ตะไคร้: 6 ช้อนชา (30 กรัม)

วิธีทำน้ำบูดู
1. นำน้ำเปล่าเทใส่หม้อต้มให้เดือด ใส่เครื่องสมุนไพรทั้งหมดลงไปต้มให้กลิ่นหอม 
2. เติมน้ำตาลปี๊บลงไปแล้วคนจนละลาย
3. ใส่น้ำบูดู แต่งสีให้เข้มด้วยซีอิ๊วแดงหวาน เคี่ยวต่อประมาณ 5 นาที ยกลงพักไว้
หมายเหตุ: น้ำบูดูสูตรนี้จะได้ปริมาณ 360 มิลลิลิตร หรือ 24 ช้อนโต๊ะ มีรสหวานนำและมีกลิ่นของสมุนไพรจากข่า ตะไคร้ หอมแดง เมื่อนำไปผสมกับข้าวสวยและเครื่องข้าวยำ จะช่วยเพิ่มรสเปรี้ยวและกลมกล่อมด้วยมะม่วงดิบ ส้มโอ และมะนาว

วิธีทำข้าวยำปักษ์ใต้
1.ผสมน้ำบูดูในข้าวสวย คลุกเคล้าจนทั่ว
2.ใส่น้ำมะพร้าวคั่ว กุ้งแห้งป่น ใส่ผักทุกอย่างลงไปคลุกให้เข้ากัน
3.เติมพริกขี้หนูแห้งป่น หากชอบทานเปรี้ยวปรุงรสด้วยน้ำมะนาวตามชอบ`,
			// Region: "ภาคใต้",
			Image:     "https://storage.googleapis.com/gsk-site/khao-yam-1.jpg",
			Sodium:    289.81,
			Credit:    "https://www.genyoungactive.com/articles/khao-yam",
			Potassium: "9",
		},
		{
			Title: "แกงผักหวานไข่มดแดง",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- ผักหวานเด็ดใบอ่อน: 3 ถ้วยตวง (100 กรัม)
- ผักติ้ว: 5 ยอด (5 กรัม)
- ไข่มดแดง: 6 ช้อนโต๊ะ (120 กรัม)
- ปลาช่อน: 6 ช้อนโต๊ะ (90 กรัม)
- เกลือ: 1/6 ช้อนชา (0.75 กรัม)
- น้ำปลาร้า: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำเปล่า: 2 ถ้วยตวง (400 กรัม)
- พริกขี้หนูสด: 5 - 6 เม็ด (5 กรัม)
- หอมแดงซอย: 10 ช้อนชา (50 กรัม)
- ตะไคร้: 6 ช้อนชา (30 กรัม)

วิธีทำ
1. นำพริกขี้หนู หอมซอย ตะไคร้ โขลกรวมกันให้ละเอียด
2. เติมน้ำเปล่าในหม้อตั้งไฟให้เดือด เติมเครื่องแกงที่โขลก ข้อ 1 ลงในหม้อ ใส่ปลาช่อนต้มจนสุก
3. ล้างไข่มดแดงในน้ำให้สะอาด สรงใส่ตะแกรงให้สะเด็ดน้ำ
4. นำผักหวานที่ล้างน้ำแล้ว ใส่ลงในหม้อคนให้ทั่ว แล้วหรี่ไฟลง
5. ปรุงรสด้วยน้ำปลาร้า เติมผักติ้ว ไข่มดแดง คนจนทั่ว เคี่ยวจนเดือดประมาณ 5 นาที ปิดไฟ ตักใส่ชามพร้อมเสิร์ฟ`,
			// Region: "ภาคอีสาน",
			Image:     "https://img.wongnai.com/p/1920x0/2017/10/04/f4d2d901befc492f9569d9e47d3aca14.jpg",
			Sodium:    214.84,
			Credit:    "https://www.wongnai.com/cooking/cookbooks/ant-eggs-recipes",
			Potassium: "151",
		},
		{
			Title: "ขนมจีนน้ำยาลาว",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- เนื้อปลานิล: 5 ช้อนโต๊ะ (80 กรัม)
- ไข่ขาวต้ม: 4 ฟอง (140 กรัม)
- ต้นหอม: 1/4 ถ้วยตวง (15 กรัม)
- ผักชี: 1/4 ถ้วยตวง (15 กรัม)
- น้ำปลาร้า: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำเปล่า: 4 ถ้วยตวง (800 กรัม)
- เกลือ: 1/3 ช้อนชา (1.5 กรัม)
- ขนมจีน: 8 จับ (400 กรัม)
- กระเทียม: 3 ช้อนโต๊ะ (30 กรัม)
- หอมแดง: 3 ช้อนโต๊ะ (30 กรัม)
- พริกแห้งเม็ดใหญ่ 7 เม็ด: 1/2 ถ้วยตวง (20 กรัม)
- ตะไคร้: 4 ช้อนโต๊ะ (20 กรัม)
- กระชาย: 1/2 ถ้วยตวง (40 กรัม)
- ขิงแก่: 3 ช้อนโต๊ะ (15 กรัม)
- กะหล่ำปลีหั่นฝอย: 1/4 ถ้วยตวง (20 กรัม)
- ถั่วฝักยาวหั่นฝอย: 1 ฝัก (10 กรัม)

วิธีทำ
1. ล้างและปอกเปลือกหอมแดง กระเทียม ตะไคร้ ขิง กระชาย พริกแห้ง นำไปต้มในหม้อพร้อมปลานิล
2. นำเครื่องสมุนไพรในข้อ 1 มาโขลกให้ละเอียด
3. นำปลาต้มมายีและผสมกับเครื่องแกง ข้อ 2 โขลกให้เข้ากัน
4. นำน้ำที่ต้มเครื่องแกงมากรองด้วยกระชอน ตั้งไฟให้เดือด นำส่วนผสม ข้อ 3 ใส่ลงในน้ำ คนให้เข้ากัน ปรุงรสด้วยปลาร้า เกลือ พอน้ำเดือดได้ที่ ปิดไฟ เสิร์ฟพร้อมขนมจีน ผักหั่นฝอย ไข่ขาวต้ม`,
			// Region: "ภาคอีสาน",
			Image:     "https://food-heal.com/wp-content/uploads/2022/10/%E0%B8%82%E0%B9%89%E0%B8%B2%E0%B8%A7%E0%B8%9B%E0%B8%B8%E0%B9%89%E0%B8%99%E0%B8%99%E0%B9%89%E0%B8%B3%E0%B8%A2%E0%B8%B2%E0%B8%A5%E0%B8%B2%E0%B8%A7.png",
			Sodium:    406.67,
			Credit:    "https://food-heal.com/%E0%B8%82%E0%B9%89%E0%B8%B2%E0%B8%A7%E0%B8%9B%E0%B8%B8%E0%B9%89%E0%B8%99%E0%B8%99%E0%B9%89%E0%B8%B3%E0%B8%A2%E0%B8%B2%E0%B8%A5%E0%B8%B2%E0%B8%A7/",
			Potassium: "240",
		},
		{
			Title: "แกงหยวกกล้วย",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- หยวกกล้วย: 2 ถ้วยตวง (200 กรัม)
- อกไก่ไม่มีหนัง: 4 ช้อนโต๊ะ (40 กรัม)
- วุ้นเส้น 1 ห่อเล็ก: 1 ถ้วยตวง (40 กรัม)
- ตะไคร้: 3 ช้อนชา (15 กรัม)
- พริกแห้งเม็ดใหญ่: 4 ช้อนโต๊ะ (10 กรัม)
- กระเทียม: 1 ช้อนชา (5 กรัม)
- หอมแดง: 4 ช้อนชา (20 กรัม)
- ข่า: 1 แว่น (5 กรัม)
- กะปิ: 1/4 ช้อนชา (1.25 กรัม)
- เกลือ: 1/4 ช้อนชา (1.25 กรัม)
- น้ำมันรำข้าว: 2 ช้อนชา (10 กรัม)

วิธีทำ
1. หั่นหยวกกล้วยเป็นแว่น แช่น้ำเกลือ
2. โขลกพริก หอม กระเทียม ข่า ตะไคร้ กะปิ รวมกันจนละเอียด
3. ตั้งกระทะผัดเครื่องแกง ข้อ 2 กับน้ำมันจนหอม ใส่อกไก่ผัดให้เข้ากัน ใส่เกลือ
4. เติมน้ำพอท่วม ใส่หยวกกล้วย
5. รอให้เดือดอีกครั้ง เติมวุ้นเส้น ปิดไฟ พร้อมเสิร์ฟ`,
			// Region: "ภาคอีสาน",
			Image:     "https://img.wongnai.com/p/1920x0/2023/08/01/7c1432face3448ffa084b0d7b204cddf.jpg",
			Sodium:    194.48,
			Credit:    "https://www.wongnai.com/recipes/ugc/19c117fd310344ec86eeb1dada5225b0",
			Potassium: "69",
		},
		{
			Title: "ห่อหมกปลาช่อนกะหล่ำปลี",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- เนื้อปลาช่อน: 6 ช้อนโต๊ะ (90 กรัม)
- ไข่ขาวดิบ: 1 ฟอง (35 กรัม)
- กะหล่ำปลี: 1/2 ถ้วยตวง (30 กรัม)
- ผักแขยงหั่นฝอย: 1/4 ถ้วยตวง (30 กรัม)
- ใบแมงลัก: 2 กิ่ง (10 กรัม)
- พริกชี้ฟ้าแดงสด 5 เม็ด: 1/4 ถ้วยตวง (50 กรัม)
- หอมแดง: 2 ช้อนชา (10 กรัม)
- ตะไคร้: 2 ช้อนชา (10 กรัม)
- กะปิ: 1 ช้อนชา (5 กรัม)
- กะทิ: 2 ช้อนโต๊ะ (25 กรัม)
- ใบตอง: ไม่มีปริมาณ/น้ำหนักระบุ

วิธีทำ
1. ล้างปลา ขอดเกล็ด แล่เนื้อ หั่นเป็นชิ้น
2. โขลกพริกสด หอมแดง ตะไคร้ กะปิ ให้ละเอียด ตักใส่ชามผสม
3. ผสมกะทิ ไข่ขาว คนให้เข้ากัน จากนั้นเติมผักแขยงคลุกให้เข้ากัน
4. รองใบตองด้วยใบแมงลัก และกะหล่ำปลีหั่นต้มสุก ตักส่วนผสมข้อ 2 และ 3 ใส่กระทงใบตอง นึ่งในน้ำเดือดจัดประมาณ 30 นาที`,
			// Region: "ภาคอีสาน",
			Image:     "https://i.ytimg.com/vi/7sL1cOs-q68/sddefault.jpg",
			Sodium:    106.26,
			Credit:    "https://youtu.be/7sL1cOs-q68?si=Nao2LeC2WagHDAsf",
			Potassium: "174",
		},
		{
			Title: "ส้มตำปลาร้าพายัพ",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
- มะละกอดิบ: 1/2 ถ้วยตวง (30 กรัม)
- มะเขือเทศสีดา: 1 ช้อนโต๊ะ (15 กรัม)
- ถั่วฝักยาว: 1 ฝัก (10 กรัม)
- กระเทียมกลีบเล็ก: 2 ช้อนชา (10 กรัม)
- พริกขี้หนู: 5 เม็ด (5 กรัม)
- มะกอก: 1/2 ผล (5 กรัม)
- มะอึก: 1/2 ผล (5 กรัม)
- มะเขือเจ้าพระยา: 1/2 ผล (5 กรัม)
- ไข่ขาวนึ่ง: 2 ฟอง (70 กรัม)
- น้ำมะขามเปียกคั้น: 1 ช้อนชา (5 กรัม)
- น้ำมะนาว: 1 ช้อนชา (5 กรัม)
- น้ำปลาร้า: 1 ช้อนชา (5 กรัม)
- ขนมจีน: 1 จับ (100 กรัม)

วิธีทำ
1. โขลกกระเทียม พริกขี้หนูเข้าด้วยกัน จากนั้นหั่นถั่วฝักยาว ฝานมะเขือเทศ โขลกรวมกับมะละกอ มะกอกฝาน
2. นำเนื้อมะอึก มะเขือเจ้าพระยา หั่นเป็นชิ้นบางๆ คลุกเคล้ากับส่วนผสมข้อ 1 ให้เข้ากัน
3. หั่นไข่ขาวต้มเป็นเส้นคล้ายมะละกอ คลุกเคล้าในส่วนผสมข้อ 2
4. เติมน้ำปลาร้า น้ำมะขามเปียก น้ำมะนาว ผสมให้เข้ากัน ตักใส่จาน เสิร์ฟพร้อมขนมจีน`,
			// Region: "ภาคอีสาน",
			Image:     "https://img.wongnai.com/p/1920x0/2020/10/18/1ac05bb40f974c268374a1ae7c491e94.jpg",
			Sodium:    393.39,
			Credit:    "https://www.wongnai.com/reviews/5fd7db16875b4da9843cfd227a12ade3",
			Potassium: "319",
		},
		{
			Title: "แกงลาวผักรวม",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
- เนื้อปลาช่อนสด: 1 ช้อนโต๊ะ (15 กรัม)
- ฟักทอง: 3 ชิ้น (10 กรัม)
- บวบหอม: 3 ชิ้น (10 กรัม)
- เห็ดขอนขาว: 3 ชิ้น (10 กรัม)
- เห็ดนางฟ้า: 3 ชิ้น (10 กรัม)
- หอมแดง: 1 ช้อนโต๊ะ (15 กรัม)
- กระเทียม: 1 ช้อนชา (5 กรัม)
- พริกขี้หนูหั่น: 1 ช้อนชา (5 กรัม)
- ตะไคร้: 1 ช้อนชา (5 กรัม)
- กระชาย: 1 ช้อนชา (5 กรัม)
- ข่าอ่อน: 1/2 ช้อนชา (2.5 กรัม)
- ผิวมะกรูด: 1/2 ช้อนชา (2.5 กรัม)
- น้ำใบย่านาง (ใช้ใบย่านาง 5 กรัม): 2 ช้อนโต๊ะ (5 กรัม)
- น้ำปลาร้า: 1 ช้อนชา (5 กรัม)
- ข้าวเบือ: 1/2 ช้อนชา (5 กรัม)
- ใบมะกรูด: 3 ใบ (2 กรัม)
- พริกแดง: 1 เม็ด (5 กรัม)
- ใบแมงลัก: 3 ช่อ (5 กรัม)

วิธีทำ
1. เตรียมข้าวเบือ โดยโขลกข้าวเหนียวที่คั่วจนหอมแล้วให้ละเอียด
2. ล้างใบย่านางให้สะอาด โขลกให้ละเอียด จากนั้นเติมน้ำ 1 แก้ว กรองให้เป็นน้ำสีเขียว
3. ตัดโคนเห็ดทิ้ง จากนั้นหั่นหรือฉีกเห็ดเป็นชิ้นๆ ปอกเปลือกบวบหอม และฟักทอง แล้วหั่นเป็นชิ้น เด็ดใบแมงลักเป็นช่อ
4. เตรียมเครื่องแกงพริกขี้หนู หอมแดง กระเทียม ตะไคร้ ข่า ผิวมะกรูด กระชายหั่นฝอย ตวงตามส่วน โขลกรวมกันจนละเอียด
5. ต้มน้ำใบย่านางพอเดือดใส่เครื่องแกง ฟักทองพอสุก บวบ เห็ด ข้าวเบือ ปรุงรสด้วยน้ำปลาร้า พอเดือดใส่ ใบมะกรูดฉีก ใบแมงลัก พริกแดง ยกลงตักเสิร์ฟ`,
			// Region: "ภาคอีสาน",
			Image:     "https://i.ytimg.com/vi/bWBpR0KQXD4/maxresdefault.jpg",
			Sodium:    205.34,
			Credit:    "https://www.youtube.com/watch?v=bWBpR0KQXD4",
			Potassium: "276",
		},
		{
			Title: "แจ่วบองสมุนไพร",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- ปลาร้าปลาช่อน: 1 ช้อนโต๊ะ (13 กรัม)
- ตะไคร้ซอยละเอียด: 2 ช้อนโต๊ะ (10 กรัม)
- หอมซอยบางๆ: 2 ช้อนโต๊ะ (20 กรัม)
- กระเทียมซอยบางๆ: 2 ช้อนโต๊ะ (20 กรัม)
- ข่าหั่นหยาบ: 2 ช้อนชา (10 กรัม)
- พริกคั่วป่นละเอียด: 1 ช้อนชา (5 กรัม)
- มะเขือเทศเนื้อ: 1/2 ถ้วยตวง (80 กรัม)
- น้ำมะขามเปียกคั้น: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำมันพืช: 1 ช้อนโต๊ะ (15 กรัม)
- เนื้อปลาช่อน: 5 ช้อนโต๊ะ (75 กรัม)
- ใบมะกรูด: 3 ใบ (2 กรัม)
- แตงกวา: 4 ลูก (100 กรัม)
- มะเขือเจ้าพระยา: 4 ลูก (100 กรัม)
- ผักกาดขาว: 8 กาบ (100 กรัม)

วิธีทำ
1. ล้างปลาร้า เอาแต่เนื้อ 1 ช้อนโต๊ะ สับให้ละเอียด รวมกับเนื้อปลาช่อน ห่อใบตอง ปิ้งให้สุก
2. คั่วข่า ตะไคร้ หอม กระเทียม ให้หอม แล้วนำมาโขลกให้ละเอียด
3. เผามะเขือเทศ ลอกเปลือกออกแล้วสับละเอียด
4. นำส่วนผสมในข้อ 1-3 มาโขลกรวมกัน ใส่น้ำมะขามเปียก พริกป่น นำลงผัดในน้ำมันให้เข้ากัน
5. ตักใส่จาน โรยหน้าด้วยใบมะกรูดหั่นฝอย จัดเสิร์ฟพร้อมผักสด`,
			// Region: "ภาคอีสาน",
			Image:     "https://th-live-01.slatic.net/p/d885d27f6948ca0a9876c3beccf3a912.jpg",
			Sodium:    196.95,
			Credit:    "https://www.lazada.co.th/products/1-kg-i619954353.html",
			Potassium: "347",
		},
		{
			Title: "ลาบไข่ขาว",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- ไข่ขาวนึ่งสุก: 4 ฟอง (140 กรัม)
- หอมแดงซอย: 2 ช้อนโต๊ะ (30 กรัม)
- ผักชีใบเลื่อย: 2 ช้อนโต๊ะ (15 กรัม)
- ต้นหอมซอย: 2 ช้อนโต๊ะ (15 กรัม)
- พริกขี้หนูแดงซอย: 1 ช้อนชา (5 กรัม)
- พริกขี้หนูปั่น: 1/2 ช้อนโต๊ะ (2.5 กรัม)
- ข้าวคั่ว: 2 ช้อนโต๊ะ (15 กรัม)
- น้ำมะนาว: 1 ช้อนชา (20 กรัม)
- น้ำปลา: 1 ช้อนชา (5 กรัม)
- น้ำตาลทราย: 1 ช้อนชา (5 กรัม)
- น้ำมันพืช: 2 ช้อนชา (10 กรัม)
- ใบสะระแหน่: 2 ช้อนโต๊ะ (15 กรัม)
- ผักกาดขาว: 2 กาบ (20 กรัม)
- แตงกวา: 2 ลูก (100 กรัม)
- ถั่วฝักยาว: 4 เส้น (50 กรัม)
- น้ำเปล่าต้มสุก: 3 ช้อนโต๊ะ (45 กรัม)

วิธีทำ
1. นำไข่ขาวนึ่งให้สุก สับหยาบๆ ผัดพอเหลือง
2. ผสมน้ำตาลทราย น้ำปลา คนให้ละลาย ใส่น้ำมะนาว
3. นำไข่ขาว ใส่น้ำปรุงรส ข้อ 2. เติมน้ำต้มสุก ใส่หอมแดง ข้าวคั่ว พริกขี้หนูซอย พริกป่น ต้นหอม ผักชี คลุกเคล้าให้เข้ากัน จัดใส่จาน แต่งหน้าด้วยสะระแหน่ เสิร์ฟพร้อมผักสด`,
			// Region: "ภาคอีสาน",
			Image:     "https://sou-dai.com/wp-content/uploads/2022/03/21-1.png",
			Sodium:    200.31,
			Credit:    "https://youtu.be/G2wsykvvx_U?si=pNtg4x9Ywf5Qkwa3",
			Potassium: "215",
		},
		{
			Title: "ผัดหมี่พิมาย",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- หมี่โคราช: 3 ถ้วยตวง (150 กรัม)
- หอมแดงซอย: 3 ช้อนโต๊ะ (30 กรัม)
- กระเทียมซอย: 1 ช้อนโต๊ะ (15 กรัม)
- หมูเนื้อแดง: 5 ช้อนโต๊ะ (80 กรัม)
- ไข่ไก่: 1 ฟอง (50 กรัม)
- น้ำปลา: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำตาลทราย: 3 ช้อนโต๊ะ (45 กรัม)
- น้ำส้มสายชู: 3 ช้อนโต๊ะ (45 กรัม)
- น้ำมันพืช: 2 ช้อนชา (5 กรัม)
- พริกชี้ฟ้าแห้งปั่น: 1 ช้อนโต๊ะ (5 กรัม)
- ต้นหอม: 10 ต้น (80 กรัม)
- ถั่วงอก: 2 ถ้วยตวง (150 กรัม)
- น้ำมะขามเปียก: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำเปล่า: 1/2 ถ้วยตวง (120 กรัม)

วิธีทำ
1. หั่นหมูเนื้อแดงเป็นชิ้นบางๆ
2. ตีไข่ไก่ให้เป็นเนื้อเดียวกัน ทอดเป็นแผ่นบางพอสุก ม้วน แล้วหั่นฝอย
3. แช่เส้นหมี่จนนุ่ม สะเด็ดน้ำ พักไว้
4. ตั้งกระทะใส่น้ำมัน เจียวหอม กระเทียม จนเหลือง ใส่น้ำปลา น้ำตาล น้ำมะขามเปียก น้ำส้มสายชู และน้ำเปล่า เคี่ยวพอได้สีที่ต้องการ ใส่พริกป่นลงไป
5. นำเส้นหมี่ลงผัดในน้ำปรุง เคล้าให้เข้ากัน ถ้าเส้นแข็งเติมน้ำเปล่าเพิ่ม
6. ตักเสิร์ฟ ตกแต่งด้วยไข่ฝอย ถั่วงอก และต้นหอม`,
			// Region: "ภาคอีสาน",
			Image:     "https://img.wongnai.com/p/1920x0/2017/10/21/2b9ba64f21e84f40a041377cd3b58e1d.jpg",
			Sodium:    412.70,
			Credit:    "https://shorturl.at/JTFGx",
			Potassium: "254",
		},
		{
			Title: "ป่นปลาผักต้ม",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- เนื้อปลาช่อนย่าง: 4 ช้อนโต๊ะ (60 กรัม)
- พริกชี้ฟ้า เขียว แดง: 1/4 ถ้วยตวง (50 กรัม)
- กระเทียม: 2 ช้อนโต๊ะ (30 กรัม)
- หอมแดง: 1/4 ถ้วยตวง (50 กรัม)
- มะเขือเทศเนื้อ เผา: 1 ลูก (80 กรัม)
- น้ำปลาร้าต้มสุก: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำมะขามเปียกต้มสุก: 1 ช้อนโต๊ะ (20 กรัม)
- เกลือป่น: 1/10 ช้อนชา (0.5 กรัม)
- ผักกาดขาว: 8 กาบ (100 กรัม)
- แตงกวา: 2 ลูก (100 กรัม)
- ดอกโสน: 1 ถ้วยตวง (50 กรัม)
- มะเขือเปราะ: 4 ลูก (100 กรัม)
- พริกขี้หนู: 6 เม็ด (10 กรัม)
- น้ำมะนาว: 2 ช้อนชา (10 กรัม)

วิธีทำ
1. นำพริก กระเทียม หอมแดง เผาแล้วโขลกรวมกัน
2. นำปลาช่อนย่าง แกะก้างออก โขลกรวมกับส่วนผสมในข้อ 1
3. เผามะเขือเทศ ปอกเปลือก โขลกรวมกับส่วนผสมในข้อ 1 และ ข้อ 2 ให้เข้ากัน
4. ปรุงรสด้วยน้ำปลาร้า น้ำมะขามเปียก น้ำมะนาว หากข้นไปให้เติมน้ำต้มสุกเพิ่ม จัดเสิร์ฟพร้อมผักสด และผักต้ม`,
			// Region: "ภาคอีสาน",
			Image:     "https://siamfishing.com/_pictures/content/upload2014/201401/1389089340.jpg",
			Sodium:    203,
			Credit:    "https://siamfishing.com/m/content/m.view.php?cat=recipe&nid=150703",
			Potassium: "388",
		},
		{
			Title: "ซาหริ่ม",
			Description: `ส่วนประกอบ 
		- แป้งถั่วเขียว: 1 ถ้วย 
		- น้ำเปล่า: 2 ถ้วย
		- สีผสมอาหาร (สีเขียวจากใบเตย, สีชมพู, สีฟ้า)
		- กะทิสด: 500 มิลลิลิตร
		- น้ำตาลทราย: 1 ถ้วย
		- เกลือป่น: 1/4 ช้อนชา
		- น้ำเชื่อมสำหรับเสิร์ฟ

		วิธีทำเส้นซ่าหริ่ม
		1.ผสมแป้งถั่วเขียวกับน้ำเปล่า คนให้เข้ากันดี
		2.ตั้งกระทะใช้ไฟอ่อน กวนแป้งจนข้นเหนียว
		3.แบ่งแป้งออกเป็นส่วนๆ ผสมสีผสมอาหารตามต้องการ
		4.นำแป้งที่ได้ใส่ถุงบีบหรือพิมพ์ซ่าหริ่ม บีบลงในน้ำเย็นจัดเพื่อให้แป้งเซ็ตตัว

		วิธีทำน้ำกะทิ
		1.ตั้งหม้อ ใส่กะทิ น้ำตาลทราย และเกลือ คนให้ละลาย
		2.ต้มด้วยไฟอ่อนจนกะทิหอมและเนียน ไม่ต้องให้เดือดจัด`,
			// Region: "ภาคเหนือ",
			Image:  "https://cookinghub.in.th/wp-content/uploads/2024/12/%E0%B8%8B%E0%B8%B2%E0%B8%AB%E0%B8%A3%E0%B8%B4%E0%B9%88%E0%B8%A1-%E0%B8%A7%E0%B8%B1%E0%B8%95%E0%B8%96%E0%B8%B8%E0%B8%94%E0%B8%B4%E0%B8%9A.jpg",
			Sodium: 0,
			Credit: "https://cookinghub.in.th/%E0%B8%AA%E0%B8%B9%E0%B8%95%E0%B8%A3-%E0%B8%8B%E0%B9%88%E0%B8%B2%E0%B8%AB%E0%B8%A3%E0%B8%B4%E0%B9%88%E0%B8%A1-%E0%B8%A7%E0%B8%B1%E0%B8%95%E0%B8%96%E0%B8%B8%E0%B8%94%E0%B8%B4%E0%B8%9A%E0%B9%81%E0%B8%A5/",
		},
		{
			Title: "ลอดช่องน้ำกะทิ",
			Description: ` ส่วนประกอบ 
			- แป้งข้าวเจ้า 200 กรัม
- แป้งเท้ายายม่อม หรือแป้งมัน 50 กรัม
- แป้งถั่วเขียว 40 กรัม
- ใบเตย 20 ใบ
- น้ำปูนใส 1.2 ลิตร
- น้ำปูนใส 250 มิลลิลิตร (สำหรับกวนขนม)
- น้ำผสมน้ำแข็ง
- หัวกะทิ 500 กรัม
- น้ำตาลมะพร้าว 300 กรัม
- ใบเตย 10 ใบ
- เกลือป่น 1/2 ช้อนชา
- เทียนอบขนม`,
			Image:     "https://s359.kapook.com/pagebuilder/1b30a4c9-dbe6-46d5-8477-e8bc66bb94a7.jpg",
			Sodium:    62,
			Credit:    "https://cooking.kapook.com/view268218.html",
			Potassium: "0",
		},
		{
			Title: "ก๋วยเตี๋ยวลูกชิ้นน้ำใส ",
			Description: ` ส่วนประกอบ 
			- น้ำสะอาด 3 ลิตร
- กระดูกหมู 500 กรัม
- คนอร์ 2 ก้อน
- รากผักชี 5 ก้าน
- พริกไทย 10 เม็ด
- น้ำตาล 1 ช้อนตวง
- ซีอิ๋วขาว 2 ช้อนตวง
- ซอสปรุงรสฝาเขียว 2 ช้อนตวง
- ลูกชิ้น
- เส้นก๋วยเตี๋ยว
- ถั่วงอก
- กระเทียมเจียว
- ต้นหอมผักชี
- เกลือ 1 ช้อนชา `,
			Image:     "https://img.wongnai.com/p/1968x0/2019/03/17/abef3072f4924196a2ae1d06f5c948ed.jpg",
			Sodium:    62,
			Credit:    "https://www.wongnai.com/recipes/ugc/6c273742a82a4d588d5a610113a62bf9?ref=ct",
			Potassium: "0",
		},
	}

	for _, pkg := range Menu {
		db.FirstOrCreate(&pkg, entity.Menu{Title: pkg.Title})
	}

	// 1️⃣ สร้าง Mealplans
	mealplans := []entity.Mealplan{
		{DiseaseID: 1, PlanName: "แผนอาหารสำหรับผู้ป่วยโรคไตระยะ 1-3a"},
		{DiseaseID: 2, PlanName: "แผนอาหารสำหรับผู้ป่วยโรคไตระยะ 3b-5"},
		{DiseaseID: 3, PlanName: "แผนอาหารสำหรับผู้ป่วยโรคไตระยะ HD"},
		{DiseaseID: 4, PlanName: "แผนอาหารสำหรับผู้ป่วยโรคไตระยะ CAPD"},
		{DiseaseID: 5, PlanName: "แผนอาหารสำหรับผู้ป่วยโรคเบาหวาน"},
	}

	for i := range mealplans {
		db.FirstOrCreate(&mealplans[i], map[string]interface{}{
			"disease_id": mealplans[i].DiseaseID,
			"plan_name":  mealplans[i].PlanName,
		})
	}

	// 2️⃣ สร้าง Mealdays (1 แผนอาหาร = 7 วัน)
	mealdays := []entity.Mealday{}
	daysOfWeek := []string{"วันจันทร์", "วันอังคาร", "วันพุธ", "วันพฤหัสบดี", "วันศุกร์", "วันเสาร์", "วันอาทิตย์"}

	for _, plan := range mealplans {
		for _, day := range daysOfWeek {
			mealdays = append(mealdays, entity.Mealday{
				MealplanID: plan.ID,
				DayofWeek:  day,
			})
		}
	}

	for i := range mealdays {
		db.FirstOrCreate(&mealdays[i], map[string]interface{}{
			"mealplan_id": mealdays[i].MealplanID,
			"dayof_week":  mealdays[i].DayofWeek,
		})
	}

	// 3️⃣ สร้าง Meals (เช้า, ว่าง, กลางวัน, เย็น)
	mealTypes := []string{"มื้อเช้า", "มื้อว่าง", "มื้อกลางวัน", "มื้อเย็น"}
	meals := []entity.Meal{}

	for _, day := range mealdays {
		for _, mType := range mealTypes {
			meals = append(meals, entity.Meal{
				MealdayID: day.ID,
				MealType:  mType,
			})
		}
	}

	for i := range meals {
		db.FirstOrCreate(&meals[i], map[string]interface{}{
			"mealday_id": meals[i].MealdayID,
			"meal_type":  meals[i].MealType,
		})
	}

	// 4️⃣ สร้าง MealMenus แบบสุ่ม (ตัวอย่าง MenuID สมมติเป็น 1-30)
	mealMenus := []entity.MealMenu{}
	for _, meal := range meals {
		menuID := uint(rand.Intn(30) + 1) // 1-30
		mealMenus = append(mealMenus, entity.MealMenu{
			MealID:      meal.ID,
			MenuID:      menuID,
			PortionText: "",
		})
	}

	for i := range mealMenus {
		db.FirstOrCreate(&mealMenus[i], map[string]interface{}{
			"meal_id":      mealMenus[i].MealID,
			"menu_id":      mealMenus[i].MenuID,
			"portion_text": mealMenus[i].PortionText,
		})
	}

	/* Mealplans := []entity.Mealplan{
		{AdminID: 1 , DiseaseID: 1, PlanName: "แผนอาหารสำหรับผู้ป่วยโรคไตระยะ 1-3a"},
		{AdminID: 1 , DiseaseID: 2, PlanName: "แผนอาหารสำหรับผู้ป่วยโรคไตระยะ 3b-5"},
		{AdminID: 1 , DiseaseID: 3, PlanName: "แผนอาหารสำหรับผู้ป่วยโรคไตระยะ HD"},
		{AdminID: 1 , DiseaseID: 4, PlanName: "แผนอาหารสำหรับผู้ป่วยโรคไตระยะ CAPD"},
		{AdminID: 1 , DiseaseID: 5, PlanName: "แผนอาหารสำหรับผู้ป่วยโรคเบาหวาน"},
	}

	for _, mealplan := range Mealplans {
		db.FirstOrCreate(&mealplan, entity.Mealplan{
			AdminID: mealplan.AdminID,
			DiseaseID: mealplan.DiseaseID,
			PlanName: mealplan.PlanName,
		})
	}

	Mealdays := []entity.Mealday{
		{MealplanID: 1, DayofWeek: "วันจันทร์"},
		{MealplanID: 1, DayofWeek: "วันอังคาร"},
		{MealplanID: 1, DayofWeek: "วันพุธ"},
		{MealplanID: 1, DayofWeek: "วันพฤหัสบดี"},
		{MealplanID: 1, DayofWeek: "วันศุกร์"},
		{MealplanID: 1, DayofWeek: "วันเสาร์"},
		{MealplanID: 1, DayofWeek: "วันอาทิตย์"},
	}

	for _, day := range Mealdays {
		db.FirstOrCreate(&day, entity.Mealday{
			MealplanID: day.MealplanID,
			DayofWeek:  day.DayofWeek,
		})
	}

	Meals := []entity.Meal{
		{MealdayID: 1, MealType: "มื้อเช้า"},
		{MealdayID: 1, MealType: "มื้อว่าง"},
		{MealdayID: 1, MealType: "มื้อกลางวัน"},
		{MealdayID: 1, MealType: "มื้อเย็น"},
		{MealdayID: 2, MealType: "มื้อเช้า"},
		{MealdayID: 2, MealType: "มื้อว่าง"},
		{MealdayID: 2, MealType: "มื้อกลางวัน"},
		{MealdayID: 2, MealType: "มื้อเย็น"},
		{MealdayID: 3, MealType: "มื้อเช้า"},
		{MealdayID: 3, MealType: "มื้อว่าง"},
		{MealdayID: 3, MealType: "มื้อกลางวัน"},
		{MealdayID: 3, MealType: "มื้อเย็น"},
		{MealdayID: 4, MealType: "มื้อเช้า"},
		{MealdayID: 4, MealType: "มื้อว่าง"},
		{MealdayID: 4, MealType: "มื้อกลางวัน"},
		{MealdayID: 4, MealType: "มื้อเย็น"},
		{MealdayID: 5, MealType: "มื้อเช้า"},
		{MealdayID: 5, MealType: "มื้อว่าง"},
		{MealdayID: 5, MealType: "มื้อกลางวัน"},
		{MealdayID: 5, MealType: "มื้อเย็น"},
		{MealdayID: 6, MealType: "มื้อเช้า"},
		{MealdayID: 6, MealType: "มื้อว่าง"},
		{MealdayID: 6, MealType: "มื้อกลางวัน"},
		{MealdayID: 6, MealType: "มื้อเย็น"},
		{MealdayID: 7, MealType: "มื้อเช้า"},
		{MealdayID: 7, MealType: "มื้อว่าง"},
		{MealdayID: 7, MealType: "มื้อกลางวัน"},
		{MealdayID: 7, MealType: "มื้อเย็น"},
	}

	for _, mealtype := range Meals {
		db.FirstOrCreate(&mealtype, entity.Meal{
			MealdayID: mealtype.MealdayID,
			MealType:  mealtype.MealType,
		})
	}

	MealMenus := []entity.MealMenu{
		{MealID: 1, MenuID: 1, PortionText: ""},
		{MealID: 2, MenuID: 1, PortionText: ""},
		{MealID: 3, MenuID: 6, PortionText: ""},
		{MealID: 4, MenuID: 1, PortionText: ""},
		{MealID: 5, MenuID: 1, PortionText: ""},
		{MealID: 6, MenuID: 1, PortionText: ""},
		{MealID: 7, MenuID: 1, PortionText: ""},
		{MealID: 8, MenuID: 1, PortionText: ""},
		{MealID: 9, MenuID: 1, PortionText: ""},
		{MealID: 10, MenuID: 1, PortionText: ""},
		{MealID: 11, MenuID: 1, PortionText: ""},
		{MealID: 12, MenuID: 1, PortionText: ""},
		{MealID: 13, MenuID: 1, PortionText: ""},
		{MealID: 14, MenuID: 1, PortionText: ""},
		{MealID: 15, MenuID: 1, PortionText: ""},
		{MealID: 16, MenuID: 1, PortionText: ""},
		{MealID: 17, MenuID: 1, PortionText: ""},
		{MealID: 18, MenuID: 1, PortionText: ""},
		{MealID: 19, MenuID: 1, PortionText: ""},
		{MealID: 20, MenuID: 1, PortionText: ""},
		{MealID: 21, MenuID: 1, PortionText: ""},
		{MealID: 22, MenuID: 1, PortionText: ""},
		{MealID: 23, MenuID: 1, PortionText: ""},
		{MealID: 24, MenuID: 1, PortionText: ""},
		{MealID: 25, MenuID: 1, PortionText: ""},
		{MealID: 26, MenuID: 1, PortionText: ""},
		{MealID: 27, MenuID: 30, PortionText: ""},
		{MealID: 28, MenuID: 1, PortionText: ""},
	}

	for _, mealmenu := range MealMenus {
		db.FirstOrCreate(&mealmenu, entity.MealMenu{
			MealID:      mealmenu.MealID,
			MenuID:      mealmenu.MenuID,
			PortionText: mealmenu.PortionText,
		})
	} */

	AgeRanges := []entity.AgeRange{
		{AgeMin: 0, AgeMax: 60},
		{AgeMin: 61, AgeMax: 200},
	}

	for _, ageRange := range AgeRanges {
		db.FirstOrCreate(&ageRange, entity.AgeRange{
			AgeMin: ageRange.AgeMin,
			AgeMax: ageRange.AgeMax,
		})
	}

	FoodGroups := []entity.FoodGroup{
		{Name: "ข้าว/แป้ง", Unit: "ทัพพี"},      //1
		{Name: "แป้งปลอดโปรตีน", Unit: "ทัพพี"}, //2
		{Name: "ผัก", Unit: "ทัพพี"},            //3
		{Name: "ผลไม้", Unit: "ส่วน"},           //4
		{Name: "เนื้อสัตว์", Unit: "ช้อนโต๊ะ"},  //5
		{Name: "ไขมัน", Unit: "ช้อนชา"},         //6
		{Name: "ซอสปรุงรส", Unit: "ช้อนชา"},     //7
		{Name: "นม", Unit: "กล่อง"},             //8
	}

	for _, foodGroup := range FoodGroups {
		db.FirstOrCreate(&foodGroup, entity.FoodGroup{
			Name: foodGroup.Name,
			Unit: foodGroup.Unit,
		})
	}

	IbwRanges := []entity.IbwRange{
		{IbwMin: 0, IbwMax: 50},
		{IbwMin: 51, IbwMax: 55},
		{IbwMin: 56, IbwMax: 60},
		{IbwMin: 61, IbwMax: 200},
		{IbwMin: 61, IbwMax: 65},
		{IbwMin: 66, IbwMax: 200},
		{IbwMin: 45, IbwMax: 200},
	}

	for _, ibwRange := range IbwRanges {
		db.FirstOrCreate(&ibwRange, entity.IbwRange{
			IbwMin: ibwRange.IbwMin,
			IbwMax: ibwRange.IbwMax,
		})
	}

	MealTimes := []entity.MealTime{
		{Name: "เช้า"},
		{Name: "กลางวัน"},
		{Name: "เย็น"},
	}

	for _, mealTime := range MealTimes {
		db.FirstOrCreate(&mealTime, entity.MealTime{
			Name: mealTime.Name,
		})
	}

	NutritionGroups := []entity.NutritionGroup{
		{Name: "คาร์โบไฮเดรต"},
		{Name: "โปรตีน"},
		{Name: "ไขมัน"},
	}

	for _, nutritionGroup := range NutritionGroups {
		db.FirstOrCreate(&nutritionGroup, entity.NutritionGroup{
			Name: nutritionGroup.Name,
		})
	}

	Diseases := []entity.Disease{
		{Name: "โรคไต", Stage: "1-3a"},   //1
		{Name: "โรคไต", Stage: "3b-5"},   //2
		{Name: "โรคไต", Stage: "HD"},     //3
		{Name: "โรคไต", Stage: "CAPD"},   //4
		{Name: "โรคเบาหวาน", Stage: "-"}, //5
	}

	for _, disease := range Diseases {
		db.FirstOrCreate(&disease, entity.Disease{
			Name:  disease.Name,
			Stage: disease.Stage,
		})
	}

	/*ขาดข้อมูลผู้ป่วยไตที่อายุ 61 ปี ขึ้นไป*/ /*ีupdate 61 ปีขึ้นไปแล้ว*/
	Rules := []entity.Rule{
		{Calories: 1750, IbwRangeID: 1, AgeRangeID: 1, DiseaseID: 1}, //1
		{Calories: 1925, IbwRangeID: 2, AgeRangeID: 1, DiseaseID: 1}, //2
		{Calories: 2100, IbwRangeID: 3, AgeRangeID: 1, DiseaseID: 1}, //3
		{Calories: 2275, IbwRangeID: 4, AgeRangeID: 1, DiseaseID: 1}, //4

		{Calories: 1750, IbwRangeID: 1, AgeRangeID: 1, DiseaseID: 2}, //5
		{Calories: 1925, IbwRangeID: 2, AgeRangeID: 1, DiseaseID: 2}, //6
		{Calories: 2100, IbwRangeID: 3, AgeRangeID: 1, DiseaseID: 2}, //7
		{Calories: 2275, IbwRangeID: 4, AgeRangeID: 1, DiseaseID: 2}, //8

		{Calories: 1750, IbwRangeID: 1, AgeRangeID: 1, DiseaseID: 3}, //9
		{Calories: 1925, IbwRangeID: 2, AgeRangeID: 1, DiseaseID: 3}, //10
		{Calories: 2100, IbwRangeID: 3, AgeRangeID: 1, DiseaseID: 3}, //11
		{Calories: 2275, IbwRangeID: 4, AgeRangeID: 1, DiseaseID: 3}, //12

		{Calories: 1750, IbwRangeID: 1, AgeRangeID: 1, DiseaseID: 4}, //13
		{Calories: 1925, IbwRangeID: 2, AgeRangeID: 1, DiseaseID: 4}, //14
		{Calories: 2100, IbwRangeID: 3, AgeRangeID: 1, DiseaseID: 4}, //15
		{Calories: 2275, IbwRangeID: 4, AgeRangeID: 1, DiseaseID: 4}, //16

		{Calories: 1500, IbwRangeID: 1, AgeRangeID: 1, DiseaseID: 5}, //17 //เบาหวาน
		{Calories: 1650, IbwRangeID: 2, AgeRangeID: 1, DiseaseID: 5}, //18
		{Calories: 1800, IbwRangeID: 3, AgeRangeID: 1, DiseaseID: 5}, //19
		{Calories: 1950, IbwRangeID: 5, AgeRangeID: 1, DiseaseID: 5}, //20
		{Calories: 2100, IbwRangeID: 6, AgeRangeID: 1, DiseaseID: 5}, //21

		{Calories: 1500, IbwRangeID: 7, AgeRangeID: 2, DiseaseID: 5}, //22

		{Calories: 1500, IbwRangeID: 1, AgeRangeID: 2, DiseaseID: 1}, //23 //ไต อายุ 61 ขึ้นไป
		{Calories: 1650, IbwRangeID: 2, AgeRangeID: 2, DiseaseID: 1}, //24
		{Calories: 1800, IbwRangeID: 3, AgeRangeID: 2, DiseaseID: 1}, //25
		{Calories: 1950, IbwRangeID: 4, AgeRangeID: 2, DiseaseID: 1}, //26

		{Calories: 1500, IbwRangeID: 1, AgeRangeID: 2, DiseaseID: 2}, //27
		{Calories: 1650, IbwRangeID: 2, AgeRangeID: 2, DiseaseID: 2}, //28
		{Calories: 1800, IbwRangeID: 3, AgeRangeID: 2, DiseaseID: 2}, //29
		{Calories: 1950, IbwRangeID: 4, AgeRangeID: 2, DiseaseID: 2}, //30

		{Calories: 1500, IbwRangeID: 1, AgeRangeID: 2, DiseaseID: 3}, //31
		{Calories: 1650, IbwRangeID: 2, AgeRangeID: 2, DiseaseID: 3}, //32
		{Calories: 1800, IbwRangeID: 3, AgeRangeID: 2, DiseaseID: 3}, //33
		{Calories: 1950, IbwRangeID: 4, AgeRangeID: 2, DiseaseID: 3}, //34

		{Calories: 1500, IbwRangeID: 1, AgeRangeID: 2, DiseaseID: 4}, //35
		{Calories: 1650, IbwRangeID: 2, AgeRangeID: 2, DiseaseID: 4}, //36
		{Calories: 1800, IbwRangeID: 3, AgeRangeID: 2, DiseaseID: 4}, //37
		{Calories: 1950, IbwRangeID: 4, AgeRangeID: 2, DiseaseID: 4}, //38
	}

	for _, rule := range Rules {
		db.FirstOrCreate(&rule, entity.Rule{
			Calories:   rule.Calories,
			IbwRangeID: rule.IbwRangeID,
			AgeRangeID: rule.AgeRangeID,
			DiseaseID:  rule.DiseaseID,
		})
	}

	NutritionRecommendations := []entity.NutritionRecommendation{
		{AmountInGrams: 240, AmountInPercentage: 55, NutritionGroupID: 1, RuleID: 1},
		{AmountInGrams: 43, AmountInPercentage: 10, NutritionGroupID: 2, RuleID: 1},
		{AmountInGrams: 68, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 1},

		{AmountInGrams: 265, AmountInPercentage: 55, NutritionGroupID: 1, RuleID: 2},
		{AmountInGrams: 48, AmountInPercentage: 10, NutritionGroupID: 2, RuleID: 2},
		{AmountInGrams: 75, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 2},

		{AmountInGrams: 288, AmountInPercentage: 55, NutritionGroupID: 1, RuleID: 3},
		{AmountInGrams: 53, AmountInPercentage: 10, NutritionGroupID: 2, RuleID: 3},
		{AmountInGrams: 82, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 3},

		{AmountInGrams: 313, AmountInPercentage: 55, NutritionGroupID: 1, RuleID: 4},
		{AmountInGrams: 57, AmountInPercentage: 10, NutritionGroupID: 2, RuleID: 4},
		{AmountInGrams: 88, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 4},

		{AmountInGrams: 249, AmountInPercentage: 57, NutritionGroupID: 1, RuleID: 5},
		{AmountInGrams: 35, AmountInPercentage: 8, NutritionGroupID: 2, RuleID: 5},
		{AmountInGrams: 68, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 5},

		{AmountInGrams: 274, AmountInPercentage: 57, NutritionGroupID: 1, RuleID: 6},
		{AmountInGrams: 38, AmountInPercentage: 8, NutritionGroupID: 2, RuleID: 6},
		{AmountInGrams: 75, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 6},

		{AmountInGrams: 299, AmountInPercentage: 57, NutritionGroupID: 1, RuleID: 7},
		{AmountInGrams: 41, AmountInPercentage: 8, NutritionGroupID: 2, RuleID: 7},
		{AmountInGrams: 82, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 7},

		{AmountInGrams: 324, AmountInPercentage: 57, NutritionGroupID: 1, RuleID: 8},
		{AmountInGrams: 45, AmountInPercentage: 8, NutritionGroupID: 2, RuleID: 8},
		{AmountInGrams: 88, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 8},

		{AmountInGrams: 219, AmountInPercentage: 57, NutritionGroupID: 1, RuleID: 9},
		{AmountInGrams: 65, AmountInPercentage: 8, NutritionGroupID: 2, RuleID: 9},
		{AmountInGrams: 68, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 9},

		{AmountInGrams: 240, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 10},
		{AmountInGrams: 72, AmountInPercentage: 15, NutritionGroupID: 2, RuleID: 10},
		{AmountInGrams: 75, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 10},

		{AmountInGrams: 263, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 11},
		{AmountInGrams: 78, AmountInPercentage: 15, NutritionGroupID: 2, RuleID: 11},
		{AmountInGrams: 82, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 11},

		{AmountInGrams: 284, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 12},
		{AmountInGrams: 85, AmountInPercentage: 15, NutritionGroupID: 2, RuleID: 12},
		{AmountInGrams: 88, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 12},

		{AmountInGrams: 218, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 13},
		{AmountInGrams: 75, AmountInPercentage: 17, NutritionGroupID: 2, RuleID: 13},
		{AmountInGrams: 64, AmountInPercentage: 33, NutritionGroupID: 3, RuleID: 13},

		{AmountInGrams: 240, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 14},
		{AmountInGrams: 82, AmountInPercentage: 17, NutritionGroupID: 2, RuleID: 14},
		{AmountInGrams: 71, AmountInPercentage: 33, NutritionGroupID: 3, RuleID: 14},

		{AmountInGrams: 263, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 15},
		{AmountInGrams: 90, AmountInPercentage: 17, NutritionGroupID: 2, RuleID: 15},
		{AmountInGrams: 77, AmountInPercentage: 33, NutritionGroupID: 3, RuleID: 15},

		{AmountInGrams: 284, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 16},
		{AmountInGrams: 97, AmountInPercentage: 17, NutritionGroupID: 2, RuleID: 16},
		{AmountInGrams: 83, AmountInPercentage: 33, NutritionGroupID: 3, RuleID: 16},

		{AmountInGrams: 187.5, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 17},
		{AmountInGrams: 75, AmountInPercentage: 20, NutritionGroupID: 2, RuleID: 17},
		{AmountInGrams: 50, AmountInPercentage: 30, NutritionGroupID: 3, RuleID: 17},

		{AmountInGrams: 206.25, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 18},
		{AmountInGrams: 82.5, AmountInPercentage: 20, NutritionGroupID: 2, RuleID: 18},
		{AmountInGrams: 55, AmountInPercentage: 30, NutritionGroupID: 3, RuleID: 18},

		{AmountInGrams: 225, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 19},
		{AmountInGrams: 90, AmountInPercentage: 20, NutritionGroupID: 2, RuleID: 19},
		{AmountInGrams: 60, AmountInPercentage: 30, NutritionGroupID: 3, RuleID: 19},

		{AmountInGrams: 243.75, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 20},
		{AmountInGrams: 97.5, AmountInPercentage: 20, NutritionGroupID: 2, RuleID: 20},
		{AmountInGrams: 65, AmountInPercentage: 30, NutritionGroupID: 3, RuleID: 20},

		{AmountInGrams: 262.5, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 21},
		{AmountInGrams: 105, AmountInPercentage: 20, NutritionGroupID: 2, RuleID: 21},
		{AmountInGrams: 70, AmountInPercentage: 30, NutritionGroupID: 3, RuleID: 21},

		{AmountInGrams: 187.5, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 22},
		{AmountInGrams: 75, AmountInPercentage: 20, NutritionGroupID: 2, RuleID: 22},
		{AmountInGrams: 50, AmountInPercentage: 30, NutritionGroupID: 3, RuleID: 22},

		{AmountInGrams: 206, AmountInPercentage: 55, NutritionGroupID: 1, RuleID: 23},
		{AmountInGrams: 41, AmountInPercentage: 11, NutritionGroupID: 2, RuleID: 23},
		{AmountInGrams: 57, AmountInPercentage: 34, NutritionGroupID: 3, RuleID: 23},

		{AmountInGrams: 227, AmountInPercentage: 55, NutritionGroupID: 1, RuleID: 24},
		{AmountInGrams: 50, AmountInPercentage: 12, NutritionGroupID: 2, RuleID: 24},
		{AmountInGrams: 61, AmountInPercentage: 33, NutritionGroupID: 3, RuleID: 24},

		{AmountInGrams: 248, AmountInPercentage: 55, NutritionGroupID: 1, RuleID: 25},
		{AmountInGrams: 54, AmountInPercentage: 12, NutritionGroupID: 2, RuleID: 25},
		{AmountInGrams: 66, AmountInPercentage: 33, NutritionGroupID: 3, RuleID: 25},

		{AmountInGrams: 268, AmountInPercentage: 55, NutritionGroupID: 1, RuleID: 26},
		{AmountInGrams: 59, AmountInPercentage: 12, NutritionGroupID: 2, RuleID: 26},
		{AmountInGrams: 72, AmountInPercentage: 33, NutritionGroupID: 3, RuleID: 26},

		{AmountInGrams: 214, AmountInPercentage: 57, NutritionGroupID: 1, RuleID: 27},
		{AmountInGrams: 30, AmountInPercentage: 8, NutritionGroupID: 2, RuleID: 27},
		{AmountInGrams: 58, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 27},

		{AmountInGrams: 227, AmountInPercentage: 55, NutritionGroupID: 1, RuleID: 28},
		{AmountInGrams: 41, AmountInPercentage: 10, NutritionGroupID: 2, RuleID: 28},
		{AmountInGrams: 64, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 28},

		{AmountInGrams: 248, AmountInPercentage: 55, NutritionGroupID: 1, RuleID: 29},
		{AmountInGrams: 45, AmountInPercentage: 10, NutritionGroupID: 2, RuleID: 29},
		{AmountInGrams: 70, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 29},

		{AmountInGrams: 248, AmountInPercentage: 55, NutritionGroupID: 1, RuleID: 30},
		{AmountInGrams: 45, AmountInPercentage: 10, NutritionGroupID: 2, RuleID: 30},
		{AmountInGrams: 70, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 30},

		{AmountInGrams: 191, AmountInPercentage: 51, NutritionGroupID: 1, RuleID: 31},
		{AmountInGrams: 53, AmountInPercentage: 14, NutritionGroupID: 2, RuleID: 31},
		{AmountInGrams: 58, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 31},

		{AmountInGrams: 206, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 32},
		{AmountInGrams: 62, AmountInPercentage: 15, NutritionGroupID: 2, RuleID: 32},
		{AmountInGrams: 64, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 32},

		{AmountInGrams: 225, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 33},
		{AmountInGrams: 68, AmountInPercentage: 15, NutritionGroupID: 2, RuleID: 33},
		{AmountInGrams: 70, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 33},

		{AmountInGrams: 244, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 34},
		{AmountInGrams: 73, AmountInPercentage: 15, NutritionGroupID: 2, RuleID: 34},
		{AmountInGrams: 76, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 34},

		{AmountInGrams: 188, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 35},
		{AmountInGrams: 68, AmountInPercentage: 18, NutritionGroupID: 2, RuleID: 35},
		{AmountInGrams: 53, AmountInPercentage: 32, NutritionGroupID: 3, RuleID: 35},

		{AmountInGrams: 206, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 36},
		{AmountInGrams: 74, AmountInPercentage: 18, NutritionGroupID: 2, RuleID: 36},
		{AmountInGrams: 59, AmountInPercentage: 32, NutritionGroupID: 3, RuleID: 36},

		{AmountInGrams: 225, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 37},
		{AmountInGrams: 81, AmountInPercentage: 18, NutritionGroupID: 2, RuleID: 37},
		{AmountInGrams: 64, AmountInPercentage: 32, NutritionGroupID: 3, RuleID: 37},

		{AmountInGrams: 244, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 38},
		{AmountInGrams: 88, AmountInPercentage: 18, NutritionGroupID: 2, RuleID: 38}, //ในข้อมูลเขียนว่า 288 เดาว่าtypo
		{AmountInGrams: 69, AmountInPercentage: 32, NutritionGroupID: 3, RuleID: 38},
	}

	for _, rec := range NutritionRecommendations {
		db.Where("rule_id = ? AND nutrition_group_id = ?", rec.RuleID, rec.NutritionGroupID).
			Assign(entity.NutritionRecommendation{
				AmountInGrams:      rec.AmountInGrams,
				AmountInPercentage: rec.AmountInPercentage,
				NutritionGroupID:   rec.NutritionGroupID,
				RuleID:             rec.RuleID,
			}).
			FirstOrCreate(&rec)
	}

	PortionRecommendations := []entity.PortionRecommendation{
		{Amount: 3, FoodGroupID: 1, MealTimeID: 1, RuleID: 1}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 1},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 1},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 1},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 1, RuleID: 1},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 1, RuleID: 1},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 1},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 1}, //กลางวัน
		{Amount: 3.5, FoodGroupID: 2, MealTimeID: 2, RuleID: 1},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 1},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 2, RuleID: 1},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 2, RuleID: 1},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 2, RuleID: 1},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 1},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 1}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 1},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 1},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 1},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 3, RuleID: 1},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 3, RuleID: 1},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 1},

		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 2}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 2},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 2},
		{Amount: 1.5, FoodGroupID: 4, MealTimeID: 1, RuleID: 2},
		{Amount: 3.5, FoodGroupID: 5, MealTimeID: 1, RuleID: 2},
		{Amount: 3.5, FoodGroupID: 6, MealTimeID: 1, RuleID: 2},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 2},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 2}, //กลางวัน
		{Amount: 3, FoodGroupID: 2, MealTimeID: 2, RuleID: 2},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 2},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 2, RuleID: 2},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 2, RuleID: 2},
		{Amount: 3.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 2},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 2},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 2}, //เย็น
		{Amount: 1, FoodGroupID: 2, MealTimeID: 3, RuleID: 2},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 2},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 2},
		{Amount: 3.5, FoodGroupID: 5, MealTimeID: 3, RuleID: 2},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 3, RuleID: 2},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 2},

		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 3}, //เช้า
		{Amount: 1, FoodGroupID: 2, MealTimeID: 1, RuleID: 3},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 3},
		{Amount: 1.5, FoodGroupID: 4, MealTimeID: 1, RuleID: 3},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 1, RuleID: 3},
		{Amount: 3.5, FoodGroupID: 6, MealTimeID: 1, RuleID: 3},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 3},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 3}, //กลางวัน
		{Amount: 3.5, FoodGroupID: 2, MealTimeID: 2, RuleID: 3},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 3},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 2, RuleID: 3},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 2, RuleID: 3},
		{Amount: 3.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 3},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 3},
		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 3}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 3},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 3},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 3},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 3, RuleID: 3},
		{Amount: 3.5, FoodGroupID: 6, MealTimeID: 3, RuleID: 3},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 3},

		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 4}, //เช้า
		{Amount: 1.5, FoodGroupID: 2, MealTimeID: 1, RuleID: 4},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 1, RuleID: 4},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 4},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 1, RuleID: 4},
		{Amount: 4, FoodGroupID: 6, MealTimeID: 1, RuleID: 4},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 4},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 4}, //กลางวัน
		{Amount: 3.5, FoodGroupID: 2, MealTimeID: 2, RuleID: 4},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 4},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 4},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 2, RuleID: 4},
		{Amount: 4, FoodGroupID: 6, MealTimeID: 2, RuleID: 4},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 4},
		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 4}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 4},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 3, RuleID: 4},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 4},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 3, RuleID: 4},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 3, RuleID: 4},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 4},

		{Amount: 3, FoodGroupID: 1, MealTimeID: 1, RuleID: 5}, //เช้า
		{Amount: 1, FoodGroupID: 2, MealTimeID: 1, RuleID: 5},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 5},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 5},
		{Amount: 2, FoodGroupID: 5, MealTimeID: 1, RuleID: 5},
		{Amount: 3.5, FoodGroupID: 6, MealTimeID: 1, RuleID: 5},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 5},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 5}, //กลางวัน
		{Amount: 3, FoodGroupID: 2, MealTimeID: 2, RuleID: 5},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 5},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 2, RuleID: 5},
		{Amount: 2, FoodGroupID: 5, MealTimeID: 2, RuleID: 5},
		{Amount: 3.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 5},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 5},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 5}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 5},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 5},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 5},
		{Amount: 2, FoodGroupID: 5, MealTimeID: 3, RuleID: 5},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 3, RuleID: 5},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 5},

		{Amount: 3, FoodGroupID: 1, MealTimeID: 1, RuleID: 6}, //เช้า
		{Amount: 1.5, FoodGroupID: 2, MealTimeID: 1, RuleID: 6},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 6},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 6},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 1, RuleID: 6},
		{Amount: 3.5, FoodGroupID: 6, MealTimeID: 1, RuleID: 6},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 6},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 6}, //กลางวัน
		{Amount: 3, FoodGroupID: 2, MealTimeID: 2, RuleID: 6},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 6},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 6},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 2, RuleID: 6},
		{Amount: 3.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 6},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 6},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 6}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 6},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 6},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 6},
		{Amount: 2, FoodGroupID: 5, MealTimeID: 3, RuleID: 6},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 3, RuleID: 6},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 6},

		{Amount: 3, FoodGroupID: 1, MealTimeID: 1, RuleID: 7}, //เช้า
		{Amount: 1.5, FoodGroupID: 2, MealTimeID: 1, RuleID: 7},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 7},
		{Amount: 3, FoodGroupID: 4, MealTimeID: 1, RuleID: 7},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 1, RuleID: 7},
		{Amount: 4, FoodGroupID: 6, MealTimeID: 1, RuleID: 7},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 7},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 7}, //กลางวัน
		{Amount: 4, FoodGroupID: 2, MealTimeID: 2, RuleID: 7},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 7},
		{Amount: 2, FoodGroupID: 4, MealTimeID: 2, RuleID: 7},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 2, RuleID: 7},
		{Amount: 4, FoodGroupID: 6, MealTimeID: 2, RuleID: 7},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 7},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 7}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 7},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 3, RuleID: 7},
		{Amount: 3, FoodGroupID: 4, MealTimeID: 3, RuleID: 7},
		{Amount: 2, FoodGroupID: 5, MealTimeID: 3, RuleID: 7},
		{Amount: 4, FoodGroupID: 6, MealTimeID: 3, RuleID: 7},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 7},

		{Amount: 3, FoodGroupID: 1, MealTimeID: 1, RuleID: 8}, //เช้า
		{Amount: 1.5, FoodGroupID: 2, MealTimeID: 1, RuleID: 8},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 1, RuleID: 8},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 8},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 1, RuleID: 8},
		{Amount: 5, FoodGroupID: 6, MealTimeID: 1, RuleID: 8},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 8},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 8}, //กลางวัน
		{Amount: 4, FoodGroupID: 2, MealTimeID: 2, RuleID: 8},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 8},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 8},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 2, RuleID: 8},
		{Amount: 4, FoodGroupID: 6, MealTimeID: 2, RuleID: 8},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 8},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 8}, //เย็น
		{Amount: 1, FoodGroupID: 2, MealTimeID: 3, RuleID: 8},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 3, RuleID: 8},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 8},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 3, RuleID: 8},
		{Amount: 4, FoodGroupID: 6, MealTimeID: 3, RuleID: 8},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 8},

		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 9}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 9},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 9},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 9},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 1, RuleID: 9},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 1, RuleID: 9},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 9},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 9}, //กลางวัน
		{Amount: 2, FoodGroupID: 2, MealTimeID: 2, RuleID: 9},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 9},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 2, RuleID: 9},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 2, RuleID: 9},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 2, RuleID: 9},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 9},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 9}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 9},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 9},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 9},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 3, RuleID: 9},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 3, RuleID: 9},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 9},

		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 10}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 10},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 10},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 10},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 1, RuleID: 10},
		{Amount: 2.5, FoodGroupID: 6, MealTimeID: 1, RuleID: 10},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 10},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 10}, //กลางวัน
		{Amount: 3, FoodGroupID: 2, MealTimeID: 2, RuleID: 10},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 10},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 2, RuleID: 10},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 2, RuleID: 10},
		{Amount: 2.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 10},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 10},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 10}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 10},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 10},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 10},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 3, RuleID: 10},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 3, RuleID: 10},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 10},

		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 11}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 11},
		{Amount: 2.5, FoodGroupID: 3, MealTimeID: 1, RuleID: 11},
		{Amount: 1.5, FoodGroupID: 4, MealTimeID: 1, RuleID: 11},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 1, RuleID: 11},
		{Amount: 2.5, FoodGroupID: 6, MealTimeID: 1, RuleID: 11},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 11},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 11}, //กลางวัน
		{Amount: 3, FoodGroupID: 2, MealTimeID: 2, RuleID: 11},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 11},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 2, RuleID: 11},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 2, RuleID: 11},
		{Amount: 2.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 11},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 11},
		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 11}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 11},
		{Amount: 2.5, FoodGroupID: 3, MealTimeID: 3, RuleID: 11},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 11},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 3, RuleID: 11},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 3, RuleID: 11},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 11},

		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 12}, //เช้า
		{Amount: 1, FoodGroupID: 2, MealTimeID: 1, RuleID: 12},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 1, RuleID: 12},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 12},
		{Amount: 6.5, FoodGroupID: 5, MealTimeID: 1, RuleID: 12},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 1, RuleID: 12},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 12},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 2, RuleID: 12}, //กลางวัน
		{Amount: 1, FoodGroupID: 2, MealTimeID: 2, RuleID: 12},
		{Amount: 2.5, FoodGroupID: 3, MealTimeID: 2, RuleID: 12},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 12},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 2, RuleID: 12},
		{Amount: 2.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 12},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 12},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 12}, //เย็น
		{Amount: 1, FoodGroupID: 2, MealTimeID: 3, RuleID: 12},
		{Amount: 2.5, FoodGroupID: 3, MealTimeID: 3, RuleID: 12},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 12},
		{Amount: 6.5, FoodGroupID: 5, MealTimeID: 3, RuleID: 12},
		{Amount: 2.5, FoodGroupID: 6, MealTimeID: 3, RuleID: 12},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 12},

		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 13}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 13},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 13},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 13},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 1, RuleID: 13},
		{Amount: 1.5, FoodGroupID: 6, MealTimeID: 1, RuleID: 13},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 13},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 13}, //กลางวัน
		{Amount: 2, FoodGroupID: 2, MealTimeID: 2, RuleID: 13},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 13},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 2, RuleID: 13},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 2, RuleID: 13},
		{Amount: 1.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 13},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 13},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 13}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 13},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 13},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 13},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 3, RuleID: 13},
		{Amount: 1.5, FoodGroupID: 6, MealTimeID: 3, RuleID: 13},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 13},

		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 14}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 14},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 14},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 14},
		{Amount: 7, FoodGroupID: 5, MealTimeID: 1, RuleID: 14},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 1, RuleID: 14},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 14},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 14}, //กลางวัน
		{Amount: 3, FoodGroupID: 2, MealTimeID: 2, RuleID: 14},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 14},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 2, RuleID: 14},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 2, RuleID: 14},
		{Amount: 1.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 14},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 14},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 14}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 14},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 14},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 14},
		{Amount: 7, FoodGroupID: 5, MealTimeID: 3, RuleID: 14},
		{Amount: 1.5, FoodGroupID: 6, MealTimeID: 3, RuleID: 14},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 14},

		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 15}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 15},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 15},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 15},
		{Amount: 7.5, FoodGroupID: 5, MealTimeID: 1, RuleID: 15},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 1, RuleID: 15},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 15},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 15}, //กลางวัน
		{Amount: 3, FoodGroupID: 2, MealTimeID: 2, RuleID: 15},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 15},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 15},
		{Amount: 7, FoodGroupID: 5, MealTimeID: 2, RuleID: 15},
		{Amount: 1.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 15},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 15},
		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 15}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 15},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 15},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 15},
		{Amount: 7.5, FoodGroupID: 5, MealTimeID: 3, RuleID: 15},
		{Amount: 1.5, FoodGroupID: 6, MealTimeID: 3, RuleID: 15},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 15},

		{Amount: 4, FoodGroupID: 1, MealTimeID: 1, RuleID: 16}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 16},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 1, RuleID: 16},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 16},
		{Amount: 8, FoodGroupID: 5, MealTimeID: 1, RuleID: 16},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 1, RuleID: 16},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 16},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 16}, //กลางวัน
		{Amount: 3, FoodGroupID: 2, MealTimeID: 2, RuleID: 16},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 16},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 16},
		{Amount: 8, FoodGroupID: 5, MealTimeID: 2, RuleID: 16},
		{Amount: 1.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 16},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 16},
		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 16}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 16},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 3, RuleID: 16},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 16},
		{Amount: 8, FoodGroupID: 5, MealTimeID: 3, RuleID: 16},
		{Amount: 1.5, FoodGroupID: 6, MealTimeID: 3, RuleID: 16},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 16},

		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 17}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 17},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 17},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 17},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 1, RuleID: 17},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 1, RuleID: 17},
		{Amount: 0, FoodGroupID: 8, MealTimeID: 1, RuleID: 17},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 2, RuleID: 17}, //กลางวัน
		{Amount: 0, FoodGroupID: 2, MealTimeID: 2, RuleID: 17},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 17},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 2, RuleID: 17},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 2, RuleID: 17},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 2, RuleID: 17},
		{Amount: 0, FoodGroupID: 8, MealTimeID: 2, RuleID: 17},
		{Amount: 2, FoodGroupID: 1, MealTimeID: 3, RuleID: 17}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 17},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 17},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 3, RuleID: 17},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 3, RuleID: 17},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 3, RuleID: 17},
		{Amount: 1, FoodGroupID: 8, MealTimeID: 3, RuleID: 17},

		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 18}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 18},
		{Amount: 2.5, FoodGroupID: 3, MealTimeID: 1, RuleID: 18},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 18},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 1, RuleID: 18},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 1, RuleID: 18},
		{Amount: 0, FoodGroupID: 8, MealTimeID: 1, RuleID: 18},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 2, RuleID: 18}, //กลางวัน
		{Amount: 0, FoodGroupID: 2, MealTimeID: 2, RuleID: 18},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 18},
		{Amount: 0.5, FoodGroupID: 4, MealTimeID: 2, RuleID: 18},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 2, RuleID: 18},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 2, RuleID: 18},
		{Amount: 0, FoodGroupID: 8, MealTimeID: 2, RuleID: 18},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 18}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 18},
		{Amount: 2.5, FoodGroupID: 3, MealTimeID: 3, RuleID: 18},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 18},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 3, RuleID: 18},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 3, RuleID: 18},
		{Amount: 1, FoodGroupID: 8, MealTimeID: 3, RuleID: 18},

		{Amount: 3, FoodGroupID: 1, MealTimeID: 1, RuleID: 19}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 19},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 1, RuleID: 19},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 19},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 1, RuleID: 19},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 1, RuleID: 19},
		{Amount: 0, FoodGroupID: 8, MealTimeID: 1, RuleID: 19},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 2, RuleID: 19}, //กลางวัน
		{Amount: 0, FoodGroupID: 2, MealTimeID: 2, RuleID: 19},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 19},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 19},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 2, RuleID: 19},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 2, RuleID: 19},
		{Amount: 0, FoodGroupID: 8, MealTimeID: 2, RuleID: 19},
		{Amount: 2, FoodGroupID: 1, MealTimeID: 3, RuleID: 19}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 19},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 3, RuleID: 19},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 19},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 3, RuleID: 19},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 3, RuleID: 19},
		{Amount: 1, FoodGroupID: 8, MealTimeID: 3, RuleID: 19},

		{Amount: 3, FoodGroupID: 1, MealTimeID: 1, RuleID: 20}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 20},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 1, RuleID: 20},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 20},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 1, RuleID: 20},
		{Amount: 1.5, FoodGroupID: 6, MealTimeID: 1, RuleID: 20},
		{Amount: 0, FoodGroupID: 8, MealTimeID: 1, RuleID: 20},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 2, RuleID: 20}, //กลางวัน
		{Amount: 0, FoodGroupID: 2, MealTimeID: 2, RuleID: 20},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 2, RuleID: 20},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 20},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 2, RuleID: 20},
		{Amount: 1.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 20},
		{Amount: 0, FoodGroupID: 8, MealTimeID: 2, RuleID: 20},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 20}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 20},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 3, RuleID: 20},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 3, RuleID: 20},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 3, RuleID: 20},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 3, RuleID: 20},
		{Amount: 1, FoodGroupID: 8, MealTimeID: 3, RuleID: 20},

		{Amount: 3, FoodGroupID: 1, MealTimeID: 1, RuleID: 21}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 21},
		{Amount: 3.5, FoodGroupID: 3, MealTimeID: 1, RuleID: 21},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 21},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 1, RuleID: 21},
		{Amount: 1.5, FoodGroupID: 6, MealTimeID: 1, RuleID: 21},
		{Amount: 0.5, FoodGroupID: 8, MealTimeID: 1, RuleID: 21},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 2, RuleID: 21}, //กลางวัน
		{Amount: 0, FoodGroupID: 2, MealTimeID: 2, RuleID: 21},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 2, RuleID: 21},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 21},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 2, RuleID: 21},
		{Amount: 1.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 21},
		{Amount: 0, FoodGroupID: 8, MealTimeID: 2, RuleID: 21},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 21}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 21},
		{Amount: 3.5, FoodGroupID: 3, MealTimeID: 3, RuleID: 21},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 3, RuleID: 21},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 3, RuleID: 21},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 3, RuleID: 21},
		{Amount: 1, FoodGroupID: 8, MealTimeID: 3, RuleID: 21},

		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 22}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 22},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 22},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 22},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 1, RuleID: 22},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 1, RuleID: 22},
		{Amount: 0, FoodGroupID: 8, MealTimeID: 1, RuleID: 22},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 2, RuleID: 22}, //กลางวัน
		{Amount: 0, FoodGroupID: 2, MealTimeID: 2, RuleID: 22},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 22},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 2, RuleID: 22},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 2, RuleID: 22},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 2, RuleID: 22},
		{Amount: 0, FoodGroupID: 8, MealTimeID: 2, RuleID: 22},
		{Amount: 2, FoodGroupID: 1, MealTimeID: 3, RuleID: 22}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 22},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 22},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 3, RuleID: 22},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 3, RuleID: 22},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 3, RuleID: 22},
		{Amount: 1, FoodGroupID: 8, MealTimeID: 3, RuleID: 22},

		{Amount: 2, FoodGroupID: 1, MealTimeID: 1, RuleID: 23}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 23},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 23},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 23},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 1, RuleID: 23},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 1, RuleID: 23},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 23},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 23}, //กลางวัน
		{Amount: 3, FoodGroupID: 2, MealTimeID: 2, RuleID: 23},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 23},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 23},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 2, RuleID: 23},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 2, RuleID: 23},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 23},
		{Amount: 2, FoodGroupID: 1, MealTimeID: 3, RuleID: 23}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 23},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 23},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 23},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 3, RuleID: 23},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 3, RuleID: 23},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 23},

		{Amount: 3, FoodGroupID: 1, MealTimeID: 1, RuleID: 24}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 24},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 24},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 24},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 1, RuleID: 24},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 1, RuleID: 24},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 24},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 24}, //กลางวัน
		{Amount: 2, FoodGroupID: 2, MealTimeID: 2, RuleID: 24},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 24},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 24},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 2, RuleID: 24},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 2, RuleID: 24},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 24},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 24}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 24},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 24},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 24},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 3, RuleID: 24},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 3, RuleID: 24},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 24},

		{Amount: 2, FoodGroupID: 1, MealTimeID: 1, RuleID: 25}, //เช้า
		{Amount: 1, FoodGroupID: 2, MealTimeID: 1, RuleID: 25},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 25},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 25},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 1, RuleID: 25},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 1, RuleID: 25},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 25},
		{Amount: 2, FoodGroupID: 1, MealTimeID: 2, RuleID: 25}, //กลางวัน
		{Amount: 1, FoodGroupID: 2, MealTimeID: 2, RuleID: 25},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 25},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 25},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 2, RuleID: 25},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 2, RuleID: 25},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 25},
		{Amount: 2, FoodGroupID: 1, MealTimeID: 3, RuleID: 25}, //เย็น
		{Amount: 1, FoodGroupID: 2, MealTimeID: 3, RuleID: 25},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 25},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 25},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 3, RuleID: 25},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 3, RuleID: 25},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 25},

		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 26}, //เช้า
		{Amount: 1, FoodGroupID: 2, MealTimeID: 1, RuleID: 26},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 26},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 26},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 1, RuleID: 26},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 1, RuleID: 26},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 26},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 2, RuleID: 26}, //กลางวัน
		{Amount: 1, FoodGroupID: 2, MealTimeID: 2, RuleID: 26},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 26},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 26},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 2, RuleID: 26},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 2, RuleID: 26},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 26},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 26}, //เย็น
		{Amount: 1, FoodGroupID: 2, MealTimeID: 3, RuleID: 26},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 26},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 26},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 3, RuleID: 26},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 3, RuleID: 26},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 26},

		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 27}, //เช้า
		{Amount: 1, FoodGroupID: 2, MealTimeID: 1, RuleID: 27},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 27},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 27},
		{Amount: 2, FoodGroupID: 5, MealTimeID: 1, RuleID: 27},
		{Amount: 2.5, FoodGroupID: 6, MealTimeID: 1, RuleID: 27},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 27},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 27}, //กลางวัน
		{Amount: 3, FoodGroupID: 2, MealTimeID: 2, RuleID: 27},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 27},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 27},
		{Amount: 2, FoodGroupID: 5, MealTimeID: 2, RuleID: 27},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 2, RuleID: 27},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 27},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 27}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 27},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 27},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 27},
		{Amount: 2, FoodGroupID: 5, MealTimeID: 3, RuleID: 27},
		{Amount: 2.5, FoodGroupID: 6, MealTimeID: 3, RuleID: 27},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 27},

		{Amount: 2, FoodGroupID: 1, MealTimeID: 1, RuleID: 28}, //เช้า
		{Amount: 1, FoodGroupID: 2, MealTimeID: 1, RuleID: 28},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 28},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 28},
		{Amount: 2, FoodGroupID: 5, MealTimeID: 1, RuleID: 28},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 1, RuleID: 28},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 28},
		{Amount: 2, FoodGroupID: 1, MealTimeID: 2, RuleID: 28}, //กลางวัน
		{Amount: 0, FoodGroupID: 2, MealTimeID: 2, RuleID: 28},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 28},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 28},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 2, RuleID: 28},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 2, RuleID: 28},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 28},
		{Amount: 2, FoodGroupID: 1, MealTimeID: 3, RuleID: 28}, //เย็น
		{Amount: 1, FoodGroupID: 2, MealTimeID: 3, RuleID: 28},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 28},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 28},
		{Amount: 2, FoodGroupID: 5, MealTimeID: 3, RuleID: 28},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 3, RuleID: 28},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 28},

		{Amount: 0, FoodGroupID: 1, MealTimeID: 1, RuleID: 29}, //เช้า
		{Amount: 3, FoodGroupID: 2, MealTimeID: 1, RuleID: 29},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 29},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 29},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 1, RuleID: 29},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 1, RuleID: 29},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 29},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 2, RuleID: 29}, //กลางวัน
		{Amount: 0, FoodGroupID: 2, MealTimeID: 2, RuleID: 29},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 29},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 29},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 2, RuleID: 29},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 2, RuleID: 29},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 29},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 29}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 29},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 29},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 29},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 3, RuleID: 29},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 3, RuleID: 29},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 29},

		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 30}, //เช้า
		{Amount: 1, FoodGroupID: 2, MealTimeID: 1, RuleID: 30},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 30},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 30},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 1, RuleID: 30},
		{Amount: 3.5, FoodGroupID: 6, MealTimeID: 1, RuleID: 30},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 30},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 2, RuleID: 30}, //กลางวัน
		{Amount: 1, FoodGroupID: 2, MealTimeID: 2, RuleID: 30},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 30},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 30},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 2, RuleID: 30},
		{Amount: 3.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 30},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 30},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 30}, //เย็น
		{Amount: 0.5, FoodGroupID: 2, MealTimeID: 3, RuleID: 30},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 3, RuleID: 30},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 30},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 3, RuleID: 30},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 3, RuleID: 30},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 30},

		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 31}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 31},
		{Amount: 1, FoodGroupID: 3, MealTimeID: 1, RuleID: 31},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 31},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 1, RuleID: 31},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 1, RuleID: 31},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 31},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 2, RuleID: 31}, //กลางวัน
		{Amount: 0, FoodGroupID: 2, MealTimeID: 2, RuleID: 31},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 31},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 31},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 2, RuleID: 31},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 2, RuleID: 31},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 31},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 31}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 31},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 31},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 31},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 3, RuleID: 31},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 3, RuleID: 31},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 31},

		{Amount: 3, FoodGroupID: 1, MealTimeID: 1, RuleID: 32}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 32},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 32},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 1, RuleID: 32},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 1, RuleID: 32},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 1, RuleID: 32},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 32},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 32}, //กลางวัน
		{Amount: 2, FoodGroupID: 2, MealTimeID: 2, RuleID: 32},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 32},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 32},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 2, RuleID: 32},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 2, RuleID: 32},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 32},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 32}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 32},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 32},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 32},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 3, RuleID: 32},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 3, RuleID: 32},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 32},

		{Amount: 3, FoodGroupID: 1, MealTimeID: 1, RuleID: 33}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 33},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 33},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 1, RuleID: 33},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 1, RuleID: 33},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 1, RuleID: 33},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 33},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 33}, //กลางวัน
		{Amount: 3, FoodGroupID: 2, MealTimeID: 2, RuleID: 33},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 33},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 33},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 2, RuleID: 33},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 2, RuleID: 33},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 33},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 33}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 33},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 33},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 33},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 3, RuleID: 33},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 3, RuleID: 33},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 33},

		{Amount: 3, FoodGroupID: 1, MealTimeID: 1, RuleID: 34}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 34},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 34},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 34},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 1, RuleID: 34},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 1, RuleID: 34},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 34},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 34}, //กลางวัน
		{Amount: 3, FoodGroupID: 2, MealTimeID: 2, RuleID: 34},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 34},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 34},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 2, RuleID: 34},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 2, RuleID: 34},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 34},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 34}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 34},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 34},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 34},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 3, RuleID: 34},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 3, RuleID: 34},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 34},

		{Amount: 2, FoodGroupID: 1, MealTimeID: 1, RuleID: 35}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 35},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 35},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 35},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 1, RuleID: 35},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 1, RuleID: 35},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 35},
		{Amount: 2, FoodGroupID: 1, MealTimeID: 2, RuleID: 35}, //กลางวัน
		{Amount: 0, FoodGroupID: 2, MealTimeID: 2, RuleID: 35},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 35},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 35},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 2, RuleID: 35},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 2, RuleID: 35},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 35},
		{Amount: 2, FoodGroupID: 1, MealTimeID: 3, RuleID: 35}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 35},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 35},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 35},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 3, RuleID: 35},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 3, RuleID: 35},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 35},

		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 36}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 36},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 36},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 36},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 1, RuleID: 36},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 1, RuleID: 36},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 36},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 2, RuleID: 36}, //กลางวัน
		{Amount: 0, FoodGroupID: 2, MealTimeID: 2, RuleID: 36},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 36},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 36},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 2, RuleID: 36},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 2, RuleID: 36},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 36},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 36}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 36},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 36},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 36},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 3, RuleID: 36},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 3, RuleID: 36},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 36},

		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 37}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 37},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 37},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 37},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 1, RuleID: 37},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 1, RuleID: 37},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 37},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 37}, //กลางวัน
		{Amount: 3.5, FoodGroupID: 2, MealTimeID: 2, RuleID: 37},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 37},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 2, RuleID: 37},
		{Amount: 7, FoodGroupID: 5, MealTimeID: 2, RuleID: 37},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 2, RuleID: 37},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 37},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 37}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 37},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 37},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 37},
		{Amount: 7, FoodGroupID: 5, MealTimeID: 3, RuleID: 37},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 3, RuleID: 37},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 37},

		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 38}, //เช้า
		{Amount: 1, FoodGroupID: 2, MealTimeID: 1, RuleID: 38},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 38},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 1, RuleID: 38},
		{Amount: 7, FoodGroupID: 5, MealTimeID: 1, RuleID: 38},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 1, RuleID: 38},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 38},
		{Amount: 2, FoodGroupID: 1, MealTimeID: 2, RuleID: 38}, //กลางวัน
		{Amount: 1, FoodGroupID: 2, MealTimeID: 2, RuleID: 38},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 38},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 38},
		{Amount: 8, FoodGroupID: 5, MealTimeID: 2, RuleID: 38},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 2, RuleID: 38},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 38},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 3, RuleID: 38}, //เย็น
		{Amount: 3, FoodGroupID: 2, MealTimeID: 3, RuleID: 38},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 38},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 38},
		{Amount: 7, FoodGroupID: 5, MealTimeID: 3, RuleID: 38},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 3, RuleID: 38},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 38},
	}

	for _, rec := range PortionRecommendations {
		db.Where("rule_id = ? AND food_group_id = ? AND meal_time_id = ?", rec.RuleID, rec.FoodGroupID, rec.MealTimeID).
			Assign(entity.PortionRecommendation{
				Amount:      rec.Amount,
				FoodGroupID: rec.FoodGroupID,
				MealTimeID:  rec.MealTimeID,
				RuleID:      rec.RuleID,
			}).
			FirstOrCreate(&rec)
	}

	hashedPassword, _ := HashPassword("123456")
	users := []entity.Admin{
		{FirstName: "Supaluck", LastName: "Tohthong", UserName: "Eveamare", Password: hashedPassword},
	}

	for _, user := range users {
		db.FirstOrCreate(&user, entity.Admin{FirstName: user.FirstName})
	}

	Tag := []entity.Tag{
		{Name: "ภาคใต้"},
		{Name: "ภาคกลาง"},
		{Name: "ภาคอีสาน"},
		{Name: "ภาคเหนือ"},
		{Name: "ต้ม"},
		{Name: "ยำ"},
		{Name: "น้ำพริก"},
		{Name: "แกง"},
		{Name: "ลาบ"},
		{Name: "เส้น"},
		{Name: "ผัด"},
		{Name: "ทอด"},
		{Name: "นึ่ง"},
		{Name: "ส้มตำ"},
		{Name: "อาหารหวาน"},
		{Name: "อาหารหวานสำหรับผู้ป่วยโรคเบาหวาน"},
		{Name: "โรคเบาหวาน"},
		{Name: "โรคไต"},
	}

	for _, Tag := range Tag {
		db.FirstOrCreate(&Tag, entity.Tag{
			Name: Tag.Name,
		})
	}

	MenuTag := []entity.MenuTag{
		{MenuID: 1, TagID: 4},
		{MenuID: 1, TagID: 6},
		{MenuID: 1, TagID: 18},
		{MenuID: 2, TagID: 4},
		{MenuID: 2, TagID: 7},
		{MenuID: 2, TagID: 18},
		{MenuID: 3, TagID: 4},
		{MenuID: 3, TagID: 8},
		{MenuID: 3, TagID: 18},
		{MenuID: 4, TagID: 4},
		{MenuID: 4, TagID: 8},
		{MenuID: 4, TagID: 18},
		{MenuID: 5, TagID: 4},
		{MenuID: 5, TagID: 5},
		{MenuID: 5, TagID: 18},
		{MenuID: 6, TagID: 4},
		{MenuID: 6, TagID: 9},
		{MenuID: 6, TagID: 18},
		{MenuID: 7, TagID: 4},
		{MenuID: 7, TagID: 10},
		{MenuID: 7, TagID: 18},
		{MenuID: 8, TagID: 4},
		{MenuID: 8, TagID: 6},
		{MenuID: 8, TagID: 18},
		{MenuID: 9, TagID: 4},
		{MenuID: 9, TagID: 7},
		{MenuID: 9, TagID: 18},
		{MenuID: 10, TagID: 4},
		{MenuID: 10, TagID: 7},
		{MenuID: 10, TagID: 18},

		{MenuID: 11, TagID: 2},
		{MenuID: 11, TagID: 5},
		{MenuID: 11, TagID: 18},
		{MenuID: 12, TagID: 2},
		{MenuID: 12, TagID: 8},
		{MenuID: 12, TagID: 18},
		{MenuID: 13, TagID: 2},
		{MenuID: 13, TagID: 11},
		{MenuID: 13, TagID: 18},
		{MenuID: 14, TagID: 2},
		{MenuID: 14, TagID: 7},
		{MenuID: 14, TagID: 18},
		{MenuID: 15, TagID: 2},
		{MenuID: 15, TagID: 11},
		{MenuID: 15, TagID: 18},
		{MenuID: 16, TagID: 2},
		{MenuID: 16, TagID: 12},
		{MenuID: 16, TagID: 18},
		{MenuID: 17, TagID: 2},
		{MenuID: 17, TagID: 6},
		{MenuID: 17, TagID: 18},
		{MenuID: 18, TagID: 2},
		{MenuID: 18, TagID: 5},
		{MenuID: 18, TagID: 18},
		{MenuID: 19, TagID: 2},
		{MenuID: 19, TagID: 11},
		{MenuID: 19, TagID: 18},
		{MenuID: 20, TagID: 2},
		{MenuID: 20, TagID: 11},
		{MenuID: 20, TagID: 18},

		{MenuID: 21, TagID: 1},
		{MenuID: 21, TagID: 10},
		{MenuID: 21, TagID: 18},
		{MenuID: 22, TagID: 1},
		{MenuID: 22, TagID: 7},
		{MenuID: 22, TagID: 18},
		{MenuID: 23, TagID: 1},
		{MenuID: 23, TagID: 11},
		{MenuID: 23, TagID: 18},
		{MenuID: 24, TagID: 1},
		{MenuID: 24, TagID: 5},
		{MenuID: 24, TagID: 18},
		{MenuID: 25, TagID: 1},
		{MenuID: 25, TagID: 11},
		{MenuID: 25, TagID: 18},
		{MenuID: 26, TagID: 1},
		{MenuID: 26, TagID: 8},
		{MenuID: 26, TagID: 18},
		{MenuID: 27, TagID: 1},
		{MenuID: 27, TagID: 7},
		{MenuID: 27, TagID: 18},
		{MenuID: 28, TagID: 1},
		{MenuID: 28, TagID: 7},
		{MenuID: 28, TagID: 18},
		{MenuID: 29, TagID: 1},
		{MenuID: 29, TagID: 8},
		{MenuID: 29, TagID: 18},
		{MenuID: 30, TagID: 1},
		{MenuID: 30, TagID: 10},
		{MenuID: 30, TagID: 11},
		{MenuID: 30, TagID: 18},
		{MenuID: 31, TagID: 1},
		{MenuID: 31, TagID: 6},
		{MenuID: 31, TagID: 18},

		{MenuID: 32, TagID: 3},
		{MenuID: 32, TagID: 8},
		{MenuID: 32, TagID: 18},
		{MenuID: 33, TagID: 3},
		{MenuID: 33, TagID: 10},
		{MenuID: 33, TagID: 18},
		{MenuID: 34, TagID: 3},
		{MenuID: 34, TagID: 8},
		{MenuID: 34, TagID: 18},
		{MenuID: 35, TagID: 3},
		{MenuID: 35, TagID: 13},
		{MenuID: 35, TagID: 18},
		{MenuID: 36, TagID: 3},
		{MenuID: 36, TagID: 14},
		{MenuID: 36, TagID: 18},
		{MenuID: 37, TagID: 3},
		{MenuID: 37, TagID: 8},
		{MenuID: 37, TagID: 18},
		{MenuID: 38, TagID: 3},
		{MenuID: 38, TagID: 7},
		{MenuID: 38, TagID: 18},
		{MenuID: 39, TagID: 3},
		{MenuID: 39, TagID: 9},
		{MenuID: 39, TagID: 18},
		{MenuID: 40, TagID: 3},
		{MenuID: 40, TagID: 11},
		{MenuID: 40, TagID: 18},
		{MenuID: 41, TagID: 3},
		{MenuID: 41, TagID: 7},
		{MenuID: 41, TagID: 18},
		{MenuID: 42, TagID: 3}, // ป่นปลา
		{MenuID: 42, TagID: 9}, // ป่นปลา
		{MenuID: 42, TagID: 18},
		{MenuID: 43, TagID: 15}, //ซาหริ่ม
		{MenuID: 43, TagID: 18},
		{MenuID: 44, TagID: 15}, //ซาหริ่ม
		{MenuID: 44, TagID: 16},
		{MenuID: 44, TagID: 17},
		{MenuID: 45, TagID: 10},
		{MenuID: 45, TagID: 17},
	}
	db.Create(&MenuTag)

	FoodFlag := []entity.FoodFlag{
		{
			Flag:        "ควรรับประทาน",
			FoodGroupID: 1,
		},
		{
			Flag:        "ควรรับประทาน",
			FoodGroupID: 3,
		},
		{
			Flag:        "ควรรับประทาน", //ผลไม้
			FoodGroupID: 4,
		},
		{
			Flag:        "ควรรับประทาน",
			FoodGroupID: 6,
		},
		{
			Flag:        "ควรหลีกเลี่ยง",
			FoodGroupID: 1,
		},
		{
			Flag:        "ควรหลีกเลี่ยง",
			FoodGroupID: 3,
		},
		{
			Flag:        "ควรหลีกเลี่ยง",
			FoodGroupID: 4,
		},
		{
			Flag:        "ควรหลีกเลี่ยง",
			FoodGroupID: 5,
		},
		{
			Flag:        "ควรหลีกเลี่ยง",
			FoodGroupID: 6,
		},
		{
			Flag:        "ควรรับประทาน", //เนื้อสัตว์
			FoodGroupID: 5,
		},
		{
			Flag:        "ควรรับประทาน", //แป้งปลอดโปรตีน //11
			FoodGroupID: 2,
		},
		{
			Flag:        "-",
			FoodGroupID: 1,
		},
		{
			Flag:        "-",
			FoodGroupID: 4,
		},
		{
			Flag:        "ไม่ควรรับประทาน", //เนื้อสัตว์
			FoodGroupID: 5,
		},
	}

	for _, flag := range FoodFlag {
		db.FirstOrCreate(&flag, entity.FoodFlag{
			Flag:        flag.Flag,
			FoodGroupID: flag.FoodGroupID})
	}

	FoodItem := []entity.FoodItem{
		{
			Name:        "ข้าวสวย",
			Image:       "https://fit-d.com/image_webp/f?src=./uploads/food/a860b2d3f85d9ed0fb25289795345ecf.jpg",
			Credit:      "https://fit-d.com/food/view/NDI2/%E0%B8%82%E0%B9%89%E0%B8%AD%E0%B8%A1%E0%B8%B9%E0%B8%A5%E0%B9%82%E0%B8%A0%E0%B8%8A%E0%B8%99%E0%B8%B2%E0%B8%81%E0%B8%B2%E0%B8%A3%20%E0%B9%81%E0%B8%84%E0%B8%A5%E0%B8%AD%E0%B8%A3%E0%B8%B5%E0%B9%88%20%E0%B8%82%E0%B9%89%E0%B8%B2%E0%B8%A7%E0%B8%AA%E0%B8%A7%E0%B8%A2--%E0%B8%82%E0%B9%89%E0%B8%B2%E0%B8%A7%E0%B9%80%E0%B8%9B%E0%B8%A5%E0%B9%88%E0%B8%B2-steamed-rice#nutrition_fact_part",
			Description: "ฟอสฟอรัสต่ำ,โพแทสเซียมต่ำ",
			FoodFlagID:  1,
		},
		{
			Name:        "ข้าวเหนียว",
			Image:       "https://1376delivery.com/productimages/7036_-.jpg",
			Credit:      "https://1376delivery.com/7/lao-yuan/product/2586/sticky-rice",
			Description: "ฟอสฟอรัสต่ำ,โพแทสเซียมต่ำ",
			FoodFlagID:  1,
		},
		{
			Name:        "ข้าวต้ม",
			Image:       "https://i.pinimg.com/originals/53/1d/c4/531dc48a9a143c97162f27b73b1b9c56.jpg",
			Credit:      "https://jp.pinterest.com/pin/746119863235427592/",
			Description: "ฟอสฟอรัสต่ำ,โพแทสเซียมต่ำ",
			FoodFlagID:  1,
		},
		{
			Name:        "วุ้นเส้น",
			Image:       "https://s.isanook.com/he/0/ud/4/23017/vermicelli.jpg?ip/crop/w1200h700/q80/webp",
			Credit:      "https://www.sanook.com/health/23017/",
			Description: "เกลือแร่ต่ำ,โซเดียมต่ำ,ฟอสฟอรัสต่ำ,โพแทสเซียมต่ำ",
			FoodFlagID:  11,
		},
		{
			Name:        "เส้นเซี่ยงไฮ้",
			Image:       "https://www.bloggang.com/data/m/mai-mee/picture/1244199848.jpg",
			Credit:      "https://www.bloggang.com/viewdiary.php?id=mai-mee&month=06-2009&date=05&group=1&gblog=238",
			Description: "เกลือแร่ต่ำ,โซเดียมต่ำ,ฟอสฟอรัสต่ำ,โพแทสเซียมต่ำ",
			FoodFlagID:  11,
		},
		{
			Name:        "แป้งมัน",
			Image:       "https://cm.lnwfile.com/_/cm/_raw/pv/ke/oq.png",
			Credit:      "https://www.cmbakermart.biz/product/1016/%E0%B9%81%E0%B8%9B%E0%B9%89%E0%B8%87%E0%B8%A1%E0%B8%B1%E0%B8%99%E0%B8%AA%E0%B8%B3%E0%B8%9B%E0%B8%B0%E0%B8%AB%E0%B8%A5%E0%B8%B1%E0%B8%87-%E0%B8%95%E0%B8%A3%E0%B8%B2%E0%B8%9B%E0%B8%A5%E0%B8%B2%E0%B9%84%E0%B8%97%E0%B8%A2-thai-fish-tapioca-starch-500-g-01-0100",
			Description: "เกลือแร่ต่ำ,โซเดียมต่ำ,ฟอสฟอรัสต่ำ,โพแทสเซียมต่ำ",
			FoodFlagID:  11,
		},
		{
			Name:        "แป้งเท้ายายม่อม",
			Image:       "https://missflour.com/wp-content/uploads/2020/03/%E0%B9%81%E0%B8%9B%E0%B9%89%E0%B8%87%E0%B8%97%E0%B9%89%E0%B8%B2%E0%B8%A7-%E0%B8%95%E0%B8%A3%E0%B8%B2%E0%B8%9B%E0%B8%A5%E0%B8%B2%E0%B9%81%E0%B8%9F%E0%B8%99%E0%B8%8B%E0%B8%B5%E0%B8%84%E0%B8%B2%E0%B8%A3%E0%B9%8C%E0%B8%9F-Coarse-Tapioca-Starch-missflour_front.png",
			Credit:      "https://missflour.com/product/coarse_tapioca_starch_th/",
			Description: "เกลือแร่ต่ำ,โซเดียมต่ำ,ฟอสฟอรัสต่ำ,โพแทสเซียมต่ำ",
			FoodFlagID:  11,
		},
		{
			Name:        "สาคู",
			Image:       "https://s359.kapook.com/pagebuilder/44eb9ad3-94e6-4134-a195-bd7a64f5e480.jpg",
			Credit:      "https://cooking.kapook.com/view263591.html",
			Description: "เกลือแร่ต่ำ,โซเดียมต่ำ,ฟอสฟอรัสต่ำ,โพแทสเซียมต่ำ",
			FoodFlagID:  11,
		},
		{
			Name:        "ถั่วแดงสุก",
			Image:       "https://thethaiger.com/th/wp-content/uploads/2024/09/%E0%B8%A0%E0%B8%B2%E0%B8%9E%E0%B8%96%E0%B9%88%E0%B8%B2%E0%B8%A2%E0%B8%AB%E0%B8%99%E0%B9%89%E0%B8%B2%E0%B8%88%E0%B8%AD-2567-09-10-%E0%B9%80%E0%B8%A7%E0%B8%A5%E0%B8%B2-11.22.46-AM-1480x768.png",
			Credit:      "https://thethaiger.com/th/news/1233146/",
			Description: "ฟอสฟอรัสสูง,โพแทสเซียมสูง",
			FoodFlagID:  5,
		},
		{
			Name:        "ขนมปัง",
			Image:       "https://janthai.com/wp-content/uploads/2012/07/%E0%B8%A7%E0%B8%B4%E0%B8%98%E0%B8%B5%E0%B9%80%E0%B8%A5%E0%B8%B7%E0%B8%AD%E0%B8%81%E0%B8%8B%E0%B8%B7%E0%B9%89%E0%B8%AD%E0%B8%82%E0%B8%99%E0%B8%A1%E0%B8%9B%E0%B8%B1%E0%B8%87.jpg",
			Credit:      "https://janthai.com/blog/%E0%B9%80%E0%B8%A3%E0%B8%B7%E0%B9%88%E0%B8%AD%E0%B8%87%E0%B8%99%E0%B9%88%E0%B8%B2%E0%B8%A3%E0%B8%B9%E0%B9%89%E0%B9%80%E0%B8%81%E0%B8%B5%E0%B9%88%E0%B8%A2%E0%B8%A7%E0%B8%81%E0%B8%B1%E0%B8%9A%E0%B8%82-2381.html",
			Description: "ฟอสฟอรัสสูง,โพแทสเซียมสูง",
			FoodFlagID:  5,
		},
		{
			Name:        "แครกเกอร์",
			Image:       "https://www.scimath.org/images/stories/flexicontent/item_12043_field_65/l_12043_image_01.jpg",
			Credit:      "https://www.scimath.org/image-science/item/12043-2020-12-02-06-32-39-11922",
			Description: "ฟอสฟอรัสสูง,โพแทสเซียมสูง",
			FoodFlagID:  5,
		},
		{
			Name:        "ลูกเดือยสุก",
			Image:       "https://tbcc-community.com/wp-content/uploads/2022/10/S__25124875.jpg",
			Credit:      "https://tbcc-community.com/articles/meabanchemo2022-10/",
			Description: "ฟอสฟอรัสสูง,โพแทสเซียมสูง",
			FoodFlagID:  5,
		},
		{
			Name:        "มันเทศต้มสุก",
			Image:       "https://res.cloudinary.com/dk0z4ums3/image/upload/v1510041070/attached_image_th/%E0%B8%A1%E0%B8%B1%E0%B8%99%E0%B9%80%E0%B8%97%E0%B8%A8-%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B9%82%E0%B8%A2%E0%B8%8A%E0%B8%99%E0%B9%8C%E0%B8%95%E0%B9%88%E0%B8%AD%E0%B8%AA%E0%B8%B8%E0%B8%82%E0%B8%A0%E0%B8%B2-pobpad.jpg",
			Credit:      "https://www.pobpad.com/%E0%B8%A1%E0%B8%B1%E0%B8%99%E0%B9%80%E0%B8%97%E0%B8%A8-%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B9%82%E0%B8%A2%E0%B8%8A%E0%B8%99%E0%B9%8C%E0%B8%95%E0%B9%88%E0%B8%AD%E0%B8%AA%E0%B8%B8%E0%B8%82%E0%B8%A0%E0%B8%B2",
			Description: "ฟอสฟอรัสสูง,โพแทสเซียมสูง",
			FoodFlagID:  5,
		},
		{
			Name:        "ฟักทองสุก",
			Image:       "https://img.thaicdn.net/u/2015/surauch/cook1/pumpklin-1.jpg",
			Credit:      "https://cooking.kapook.com/view130533.html",
			Description: "ฟอสฟอรัสสูง,โพแทสเซียมสูง",
			FoodFlagID:  5,
		},
		{
			Name:        "ขนมจีน",
			Image:       "https://d3h1lg3ksw6i6b.cloudfront.net/media/image/2022/06/14/103df643b8e84d6a87e38289c33b8a26_Get_To_Know_How_Khanom_Chin_Conquered_Thailand_%2810%29.jpg",
			Credit:      "https://guide.michelin.com/th/th/article/features/get-to-know-how-khanom-chin-conquered-thailand",
			Description: "ฟอสฟอรัสสูง,โพแทสเซียมสูง",
			FoodFlagID:  5,
		},
		{
			Name:        "แอปเปิล",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Apple-1.jpg",
			Credit:      "https://medthai.com/%E0%B9%81%E0%B8%AD%E0%B8%9B%E0%B9%80%E0%B8%9B%E0%B8%B4%E0%B9%89%E0%B8%A5/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  3,
		},
		{
			Name:        "พุทรา",
			Image:       "https://medthai.com/wp-content/uploads/2013/10/%E0%B8%9E%E0%B8%B8%E0%B8%97%E0%B8%A3%E0%B8%B2%E0%B8%88%E0%B8%B5%E0%B8%99.jpg",
			Credit:      "https://medthai.com/%E0%B8%9E%E0%B8%B8%E0%B8%97%E0%B8%A3%E0%B8%B2%E0%B8%88%E0%B8%B5%E0%B8%99/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  3,
		},
		{
			Name:        "ส้มโอ",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Pomelo-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%AA%E0%B9%89%E0%B8%A1%E0%B9%82%E0%B8%AD/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  3,
		},
		{
			Name:        "มังคุด",
			Image:       "https://www.healthtodaythailand.in.th/wp-content/uploads/2017/12/Mangosteen001-e1518415885868.jpg",
			Credit:      "https://www.healthtodaythailand.in.th/%E0%B8%A1%E0%B8%B1%E0%B8%87%E0%B8%84%E0%B8%B8%E0%B8%94-%E0%B8%9C%E0%B8%A5%E0%B9%84%E0%B8%A1%E0%B9%89%E0%B8%A3%E0%B8%B1%E0%B8%81%E0%B8%A9%E0%B8%B2%E0%B9%82%E0%B8%A3%E0%B8%84-2/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  3,
		},
		{
			Name:        "เงาะ",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Rambutan-1.jpg",
			Credit:      "https://medthai.com/%E0%B9%80%E0%B8%87%E0%B8%B2%E0%B8%B0/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  3,
		},
		{
			Name:        "ชมพู่",
			Image:       "https://spfresh.co.th/wp-content/uploads/2022/12/%E0%B8%8A%E0%B8%A1%E0%B8%9E%E0%B8%B9%E0%B9%88-2-1.jpg",
			Credit:      "https://spfresh.co.th/product/roseapple/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  3,
		},
		{
			Name:        "แตงโม",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/%E0%B8%A3%E0%B8%B9%E0%B8%9B%E0%B9%81%E0%B8%95%E0%B8%87%E0%B9%82%E0%B8%A1.jpg",
			Credit:      "https://medthai.com/%E0%B9%81%E0%B8%95%E0%B8%87%E0%B9%82%E0%B8%A1/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  3,
		},
		{
			Name:        "สัปปะรด",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Pineapple-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%AA%E0%B8%B1%E0%B8%9A%E0%B8%9B%E0%B8%B0%E0%B8%A3%E0%B8%94/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  3,
		},
		{
			Name:        "สาลี่",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Chinese-pear-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%AA%E0%B8%B2%E0%B8%A5%E0%B8%B5%E0%B9%88/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  3,
		},
		{
			Name:        "กล้วยหอม",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Banana-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%81%E0%B8%A5%E0%B9%89%E0%B8%A7%E0%B8%A2/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  7,
		},
		{
			Name:        "ฝรั่ง",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Guava-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%9D%E0%B8%A3%E0%B8%B1%E0%B9%88%E0%B8%87/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  7,
		},
		{
			Name:        "แก้วมังกร",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Dragon-fruit-1.jpg",
			Credit:      "https://medthai.com/%E0%B9%81%E0%B8%81%E0%B9%89%E0%B8%A7%E0%B8%A1%E0%B8%B1%E0%B8%87%E0%B8%81%E0%B8%A3/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  7,
		},
		{
			Name:        "มะม่วงสุก/ดิบ",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Mango-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%A1%E0%B8%B0%E0%B8%A1%E0%B9%88%E0%B8%A7%E0%B8%87/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  7,
		},
		{
			Name:        "ขนุน",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Jackfruit-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%82%E0%B8%99%E0%B8%B8%E0%B8%99/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  7,
		},
		{
			Name:        "มะขามหวาน",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Tamarind-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%A1%E0%B8%B0%E0%B8%82%E0%B8%B2%E0%B8%A1/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  7,
		},
		{
			Name:        "ลองกอง",
			Image:       "https://medthai.com/wp-content/uploads/2013/11/%E0%B8%A5%E0%B8%AD%E0%B8%87%E0%B8%81%E0%B8%AD%E0%B8%87.jpg",
			Credit:      "https://medthai.com/%E0%B8%A5%E0%B8%AD%E0%B8%87%E0%B8%81%E0%B8%AD%E0%B8%87/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  7,
		},
		{
			Name:        "ลำไย",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Longan-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%A5%E0%B8%B3%E0%B9%84%E0%B8%A2/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  7,
		},
		{
			Name:        "ส้ม",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Orange-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%AA%E0%B9%89%E0%B8%A1/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  7,
		},
		{
			Name:        "ทุเรียน",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Durian-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%97%E0%B8%B8%E0%B9%80%E0%B8%A3%E0%B8%B5%E0%B8%A2%E0%B8%99/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  7,
		},
		{
			Name:        "ลูกยอ",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Noni-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%A5%E0%B8%B9%E0%B8%81%E0%B8%A2%E0%B8%AD/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  7,
		},
		{
			Name:        "ผักกาดขาว",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Chinese-Cabbage-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%9C%E0%B8%B1%E0%B8%81%E0%B8%81%E0%B8%B2%E0%B8%94%E0%B8%82%E0%B8%B2%E0%B8%A7/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  2,
		},
		{
			Name:        "บวบ",
			Image:       "https://sudyod.co.th/wp-content/uploads/2021/10/%E0%B8%9A%E0%B8%A7%E0%B8%9A%E0%B9%80%E0%B8%AB%E0%B8%A5%E0%B8%B5%E0%B9%88%E0%B8%A2%E0%B8%A1-1.png",
			Credit:      "https://sudyod.co.th/product/%E0%B8%9A%E0%B8%A7%E0%B8%9A%E0%B9%80%E0%B8%AB%E0%B8%A5%E0%B8%B5%E0%B9%88%E0%B8%A2%E0%B8%A1-500-700-%E0%B8%81%E0%B8%A3%E0%B8%B1%E0%B8%A1/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  2,
		},
		{
			Name:        "ผักบุ้ง",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Swamp-cabbage-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%9C%E0%B8%B1%E0%B8%81%E0%B8%9A%E0%B8%B8%E0%B9%89%E0%B8%87/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  2,
		},
		{
			Name:        "หอมใหญ่",
			Image:       "https://medthai.com/wp-content/uploads/2013/10/%E0%B8%AB%E0%B8%AD%E0%B8%A1%E0%B8%AB%E0%B8%B1%E0%B8%A7%E0%B9%83%E0%B8%AB%E0%B8%8D%E0%B9%881.jpg",
			Credit:      "https://medthai.com/%E0%B8%AB%E0%B8%AD%E0%B8%A1%E0%B8%AB%E0%B8%B1%E0%B8%A7%E0%B9%83%E0%B8%AB%E0%B8%8D%E0%B9%88/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  2,
		},
		{
			Name:        "ฟักเขียว",
			Image:       "https://medthai.com/wp-content/uploads/2013/09/%E0%B8%9C%E0%B8%A5%E0%B8%9F%E0%B8%B1%E0%B8%81%E0%B9%80%E0%B8%82%E0%B8%B5%E0%B8%A2%E0%B8%A7.jpg",
			Credit:      "https://medthai.com/%E0%B8%9F%E0%B8%B1%E0%B8%81%E0%B9%80%E0%B8%82%E0%B8%B5%E0%B8%A2%E0%B8%A7/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  2,
		},
		{
			Name:        "ผักกาดหอม",
			Image:       "https://medthai.com/wp-content/uploads/2013/10/%E0%B8%9C%E0%B8%B1%E0%B8%81%E0%B8%81%E0%B8%B2%E0%B8%94%E0%B8%AB%E0%B8%AD%E0%B8%A1.jpg",
			Credit:      "https://medthai.com/%E0%B8%9C%E0%B8%B1%E0%B8%81%E0%B8%81%E0%B8%B2%E0%B8%94%E0%B8%AB%E0%B8%AD%E0%B8%A1/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  2,
		},
		{
			Name:        "น้ำเต้า",
			Image:       "https://medthai.com/wp-content/uploads/2014/03/%E0%B8%99%E0%B9%89%E0%B8%B3%E0%B9%80%E0%B8%95%E0%B9%89%E0%B8%B2.jpg",
			Credit:      "https://medthai.com/%E0%B8%99%E0%B9%89%E0%B8%B3%E0%B9%80%E0%B8%95%E0%B9%89%E0%B8%B2/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  2,
		},
		{
			Name:        "ถั่วงอก",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Bean-Sprouts-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%96%E0%B8%B1%E0%B9%88%E0%B8%A7%E0%B8%87%E0%B8%AD%E0%B8%81/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  2,
		},
		{
			Name:        "แตงกวา",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Cucumber-1.jpg",
			Credit:      "https://medthai.com/%E0%B9%81%E0%B8%95%E0%B8%87%E0%B8%81%E0%B8%A7%E0%B8%B2/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  2,
		},
		{
			Name:        "มะเขือยาว",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Eggplant-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%A1%E0%B8%B0%E0%B9%80%E0%B8%82%E0%B8%B7%E0%B8%AD%E0%B8%A2%E0%B8%B2%E0%B8%A7/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  2,
		},
		{
			Name:        "มะเขือเปราะ",
			Image:       "https://medthai.com/wp-content/uploads/2014/09/%E0%B8%A3%E0%B8%B9%E0%B8%9B%E0%B8%A1%E0%B8%B0%E0%B9%80%E0%B8%82%E0%B8%B7%E0%B8%AD%E0%B9%80%E0%B8%9B%E0%B8%A3%E0%B8%B2%E0%B8%B0.jpg",
			Credit:      "https://medthai.com/%E0%B8%A1%E0%B8%B0%E0%B9%80%E0%B8%82%E0%B8%B7%E0%B8%AD%E0%B9%80%E0%B8%9B%E0%B8%A3%E0%B8%B2%E0%B8%B0/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  2,
		},
		{
			Name:        "มะเขือเทศ",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Tomato-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%A1%E0%B8%B0%E0%B9%80%E0%B8%82%E0%B8%B7%E0%B8%AD%E0%B9%80%E0%B8%97%E0%B8%A8/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  6,
		},
		{
			Name:        "แคร์รอต",
			Image:       "https://www.gourmetandcuisine.com/Images/editor_upload/_editor20210909021323_original.jpg",
			Credit:      "https://www.gourmetandcuisine.com/stories/detail/1353",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  6,
		},
		{
			Name:        "สะเดา",
			Image:       "https://medthai.com/wp-content/uploads/2013/11/%E0%B8%AA%E0%B8%B0%E0%B9%80%E0%B8%94%E0%B8%B2.jpg",
			Credit:      "https://medthai.com/%E0%B8%AA%E0%B8%B0%E0%B9%80%E0%B8%94%E0%B8%B2/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  6,
		},
		{
			Name:        "มะตูมแขก",
			Image:       "https://v3i.rweb-images.com/www.disthai.com/images/editor/%e0%b8%a1%e0%b8%b0%e0%b8%95%e0%b8%b9%e0%b8%a1%e0%b9%81%e0%b8%82%e0%b8%811.jpg",
			Credit:      "https://www.disthai.com/17427463/%E0%B8%A1%E0%B8%B0%E0%B8%95%E0%B8%B9%E0%B8%A1%E0%B9%81%E0%B8%82%E0%B8%81",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  6,
		},
		{
			Name:        "หน่อไม้",
			Image:       "https://image.rakuten.co.jp/f063223-nishikawa/cabinet/fyn9-0200-0399/r_fyn9_365_5.jpg",
			Credit:      "https://item.rakuten.co.jp/f063223-nishikawa/fyn9-365/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  6,
		},
		{
			Name:        "คะน้า",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Kai-Lan-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%9C%E0%B8%B1%E0%B8%81%E0%B8%84%E0%B8%B0%E0%B8%99%E0%B9%89%E0%B8%B2/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  6,
		},
		{
			Name:        "ฟักทอง",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Pumpkin-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%9F%E0%B8%B1%E0%B8%81%E0%B8%97%E0%B8%AD%E0%B8%87/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  6,
		},
		{
			Name:        "ใบยอ",
			Image:       "https://1.bp.blogspot.com/-jph32-wPWwQ/UmCxRbhXzJI/AAAAAAAAAfk/hQdWiop13U8/s1600/recingradient207_0_normal.jpg",
			Credit:      "https://numonkato.blogspot.com/2013/10/blog-post_17.html",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  6,
		},
		{
			Name:        "ยอด/เม็ดกระถิน",
			Image:       "https://medthai.com/wp-content/uploads/2013/11/%E0%B8%81%E0%B8%A3%E0%B8%B0%E0%B8%96%E0%B8%B4%E0%B8%99.jpg",
			Credit:      "https://medthai.com/%E0%B8%81%E0%B8%A3%E0%B8%B0%E0%B8%96%E0%B8%B4%E0%B8%99%E0%B9%84%E0%B8%97%E0%B8%A2/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  6,
		},
		{
			Name:        "ผักติ้ว",
			Image:       "https://mykitchencook.com/wp-content/uploads/2022/10/%E0%B8%8B%E0%B8%B8%E0%B8%9B%E0%B8%94%E0%B8%AD%E0%B8%81%E0%B8%9C%E0%B8%B1%E0%B8%81%E0%B8%95%E0%B8%B4%E0%B9%89%E0%B8%A72.png",
			Credit:      "https://mykitchencook.com/2022/10/12/%E0%B8%8B%E0%B8%B8%E0%B8%9B%E0%B8%94%E0%B8%AD%E0%B8%81%E0%B8%9C%E0%B8%B1%E0%B8%81%E0%B8%95%E0%B8%B4%E0%B9%89%E0%B8%A7/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  6,
		},
		{
			Name:        "ใบชะพลู",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Wildbetal-Leafbush-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%8A%E0%B8%B0%E0%B8%9E%E0%B8%A5%E0%B8%B9/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  6,
		},
		{
			Name:        "บรอกโคลี",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/%E0%B8%9A%E0%B8%A3%E0%B9%87%E0%B8%AD%E0%B8%84%E0%B9%82%E0%B8%84%E0%B8%A5%E0%B8%B5%E0%B9%88.jpg",
			Credit:      "https://medthai.com/%E0%B8%9A%E0%B8%A3%E0%B9%87%E0%B8%AD%E0%B8%84%E0%B9%82%E0%B8%84%E0%B8%A5%E0%B8%B5%E0%B9%88/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  6,
		},
		{
			Name:        "เนื้อหมูไม่ติดมัน",
			Image:       "https://img.thaicdn.net/u/2017/wanchalerm/Health_01_60/pork.jpg",
			Credit:      "https://health.kapook.com/view166661.html",
			Description: "โปรตีนคุณภาพดี",
			FoodFlagID:  10, //เนื้อสัตว์ควรรับประทาน
		},
		{
			Name:        "เนื้อไก่ไม่มีหนัง/อกไก่/สันในไก่",
			Image:       "https://img.thaicdn.net/u/2017/wanchalerm/Health_01_60/chic.jpg",
			Credit:      "https://health.kapook.com/view166661.html",
			Description: "โปรตีนคุณภาพดี",
			FoodFlagID:  10, //เนื้อสัตว์ควรรับประทาน
		},
		{
			Name:        "เนื้อกุ้งสุก",
			Image:       "https://cheewajit.com/app/uploads/2018/07/588f7f8017000025002d93f4.jpeg",
			Credit:      "https://cheewajit.com/healthy-food/recipe/103077.html",
			Description: "โปรตีนคุณภาพดี",
			FoodFlagID:  10, //เนื้อสัตว์ควรรับประทาน
		},
		{
			Name:        "เนื้อปลาสุก",
			Image:       "https://api2.krua.co/wp-content/uploads/2023/02/BannerMobile_960x633-16.jpg",
			Credit:      "https://api2.krua.co/cooking_post/cooked-fish-tips/",
			Description: "โปรตีนคุณภาพดี",
			FoodFlagID:  10, //เนื้อสัตว์ควรรับประทาน
		},
		{
			Name:        "ไข่ขาวต้ม",
			Image:       "https://th-test-11.slatic.net/p/f43ff1cbdca2e92da80ed6377ad72bbb.jpg",
			Credit:      "https://www.lazada.co.th/products/100-500-i4835057710.html",
			Description: "ฟอสฟอรัสต่ำ,โพแทสเซียมต่ำ",
			FoodFlagID:  10, //เนื้อสัตว์ควรรับประทาน
		},
		{
			Name:        "เนื้อสัตว์แปรรูป",
			Image:       "https://www.matichon.co.th/wp-content/uploads/2020/11/01-209.jpg",
			Credit:      "https://www.matichon.co.th/publicize/news_2455470",
			Description: "โซเดียมสูง",
			FoodFlagID:  8,
		},
		{
			Name:        "ไข่แดงและ ผลิตภัณฑ์จากไข่แดง",
			Image:       "https://www.tcs-mart.com/web/wp-content/uploads/2022/11/yolk1.jpg",
			Credit:      "https://www.tcs-mart.com/product/%E0%B8%AA%E0%B8%B2%E0%B8%A3%E0%B9%81%E0%B8%95%E0%B9%88%E0%B8%87%E0%B8%81%E0%B8%A5%E0%B8%B4%E0%B9%88%E0%B8%99%E0%B9%84%E0%B8%82%E0%B9%88%E0%B9%81%E0%B8%94%E0%B8%87-egg-yolk-flavour-water-flavour/",
			Description: "ฟอสฟอรัสสูง",
			FoodFlagID:  14,
		},
		{
			Name:        "นมและ ผลิตภัณฑ์จากนม",
			Image:       "https://5.imimg.com/data5/HW/IA/MY-41175207/full-cream-pure-goat-milk-500x500.jpg",
			Credit:      "https://www.indiamart.com/proddetail/full-cream-pure-goat-milk-16132391897.html",
			Description: "ฟอสฟอรัสสูง,โพแทสเซียมสูง",
			FoodFlagID:  14,
		},
		{
			Name:        "ถั่วเมล็ดแห้ง",
			Image:       "https://s359.kapook.com/pagebuilder/403cf7d4-0659-4f84-9450-97174e198fbb.jpg",
			Credit:      "https://health.kapook.com/view279785.html",
			Description: "ฟอสฟอรัสสูง,โพแทสเซียมสูง",
			FoodFlagID:  14,
		},
		{
			Name:        "น้ำมันถั่วเหลือง",
			Image:       "https://images.genpi.co/uploads/arsip/normal/2023/03/19/minyak-kedelai-paling-baik-untuk-kesehatan-cegah-fvki.jpg",
			Credit:      "https://www.genpi.co/kesehatan/216595/minyak-kedelai-paling-baik-untuk-kesehatan-cegah-penyakit-kronis-dan-bikin-jantung-sehat",
			Description: "ไขมันไม่อิ่มตัว",
			FoodFlagID:  4,
		},
		{
			Name:        "น้ำมันรำข้าว",
			Image:       "https://www.pvmishra.com/wp-content/uploads/2016/03/Rice-Bran-Oil.jpg",
			Credit:      "https://www.bing.com/images/search?view=detailV2&ccid=Sk%2FqnuZF&id=101AEF9C99280B9DB45513EE6C1D12065A0947B5&thid=OIP.Sk_qnuZFam20T1tc0H1QRQHaEo&mediaurl=https%3A%2F%2Fwww.pvmishra.com%2Fwp-content%2Fuploads%2F2016%2F03%2FRice-Bran-Oil.jpg&cdnurl=https%3A%2F%2Fth.bing.com%2Fth%2Fid%2FR.4a4fea9ee6456a6db44f5b5cd07d5045%3Frik%3DtUcJWgYSHWzuEw%26pid%3DImgRaw%26r%3D0&exph=800&expw=1280&q=%E0%B8%99%E0%B9%89%E0%B8%B3%E0%B8%A1%E0%B8%B1%E0%B8%99%E0%B8%A3%E0%B8%B3%E0%B8%82%E0%B9%89%E0%B8%B2%E0%B8%A7&simid=608027049437592335&form=IRPRST&ck=1756EEB619D6C79779475A06E24A017C&selectedindex=4&itb=0&cw=1382&ch=684&ajaxhist=0&ajaxserp=0&pivotparams=insightsToken%3Dccid_qsD8z%252BU2*cp_BCF64EF7705DD287FDE4FC8329240D00*mid_0D5059C69507C1094DDAEEB78299CE2497A870A7*simid_608038087459547855*thid_OIP.qsD8z-U2kRIHjrlrLINf7AHaEK&vt=0&sim=11&iss=VSI&ajaxhist=0&ajaxserp=0",
			Description: "ไขมันไม่อิ่มตัว",
			FoodFlagID:  4,
		},
		{
			Name:        "น้ำมันคาโนลา",
			Image:       "https://mthai.com/app/uploads/2019/12/Canola-oil.jpg",
			Credit:      "https://mthai.com/lifestyle/health/44054.html",
			Description: "ไขมันไม่อิ่มตัว",
			FoodFlagID:  4,
		},
		{
			Name:        "น้ำมันดอกทานตะวัน",
			Image:       "https://ibio.co.th/products/image/catalog/ice/Sunflower-Oil1.jpg",
			Credit:      "https://www.ibioworld.com/Ingredients0000000375",
			Description: "ไขมันไม่อิ่มตัว",
			FoodFlagID:  4,
		},
		{
			Name:        "น้ำมันงา",
			Image:       "https://miro.medium.com/v2/resize:fit:500/0*R2QGRinPjt7zS26E.jpg",
			Credit:      "https://medium.com/@emilygardenar/is-sesame-oil-good-for-dogs-a-comprehensive-guide-to-canine-health-benefits-f2b88d7b3c9c",
			Description: "ไขมันไม่อิ่มตัว",
			FoodFlagID:  4,
		},
		{
			Name:        "น้ำมันหมู",
			Image:       "https://www.sirinfarm.com/wp-content/uploads/2021/07/o44a3c6ddbc4c9c1cf114aed10a31cebb_67475817_211128_0024.jpg",
			Credit:      "https://www.sirinfarm.com/th/product/pure-lard-250g/",
			Description: "ไขมันอิ่มตัว",
			FoodFlagID:  9,
		},
		{
			Name:        "น้ำมันไก่",
			Image:       "https://lzd-img-global.slatic.net/g/ff/kf/S9208531138184cfd87facb3082722733z.jpg_720x720q80.jpg",
			Credit:      "https://www.lazada.co.th/products/chickenoil600ml-i3700936268.html",
			Description: "ไขมันอิ่มตัว",
			FoodFlagID:  9,
		},
		{
			Name:        "น้ำมันปาล์ม",
			Image:       "https://www.cpi-th.com/public/upload/plamlife/plamlife_19022021-155806.png",
			Credit:      "https://www.cpi-th.com/th/productlistpalm?type=7&case=plam",
			Description: "ไขมันอิ่มตัว",
			FoodFlagID:  9,
		},
		{
			Name:        "น้ำมันมะพร้าว",
			Image:       "https://inwfile.com/s-gf/b27ykm.jpg",
			Credit:      "https://drtim.co/%E0%B8%99%E0%B9%89%E0%B8%B3%E0%B8%A1%E0%B8%B1%E0%B8%99%E0%B8%A1%E0%B8%B0%E0%B8%9E%E0%B8%A3%E0%B9%89%E0%B8%B2%E0%B8%A7/",
			Description: "ไขมันอิ่มตัว",
			FoodFlagID:  9,
		},
		{
			Name:        "กะทิ",
			Image:       "https://sveokosi.com/wp-content/uploads/2022/06/0g.jpg",
			Credit:      "https://sveokosi.com/mleko-za-kosu/",
			Description: "ไขมันอิ่มตัว",
			FoodFlagID:  9,
		},
		{
			Name:        "ครีมเทียม",
			Image:       "https://www.moac.go.th/data/news/l/661200006781.jpg",
			Credit:      "https://www.moac.go.th/news-preview-452991792546",
			Description: "ไขมันอิ่มตัว",
			FoodFlagID:  9,
		},
		{
			Name:        "เส้นใหญ่",
			Image:       "https://static.cdntap.com/tap-assets-prod/wp-content/uploads/sites/25/2021/12/twine3.jpg?width=700&quality=95",
			Credit:      "https://th.theasianparent.com/big-flat-noodles-menu",
			Description: "-",
			FoodFlagID:  12,
		},
		{
			Name:        "บะหมี่",
			Image:       "https://www.calforlife.com/image/food/Noodles.jpg",
			Credit:      "https://www.calforlife.com/th/calories/noodles",
			Description: "-",
			FoodFlagID:  12,
		},
		{
			Name:        "ข้าวโพด",
			Image:       "https://www.calforlife.com/image/food/Sweet-Corn-Boiled.jpg",
			Credit:      "https://www.calforlife.com/th/calories/Sweet-Corn-Boiled",
			Description: "-",
			FoodFlagID:  12,
		},
		{
			Name:        "มะละกอสุก",
			Image:       "https://www.simahealthcare.com/image/catalog/01-simaxray/ppp/aHR0cHM6Ly9zLmlzYW5vb2suY29tL3dvLzAvdWQvMTEvNTkwMzkvcGFwYXlhLmpwZw==.jpg",
			Credit:      "https://www.simahealthcare.com/content/list?article_id=81&article_type=1",
			Description: "-",
			FoodFlagID:  13,
		},
		{
			Name:        "กล้วยน้ำว้า",
			Image:       "https://v3i.rweb-images.com/www.disthai.com/images/content/original-1634715683568.jpg",
			Credit:      "https://www.disthai.com/16915273/%E0%B8%81%E0%B8%A5%E0%B9%89%E0%B8%A7%E0%B8%A2%E0%B8%99%E0%B9%89%E0%B8%B3%E0%B8%A7%E0%B9%89%E0%B8%B2",
			Description: "-",
			FoodFlagID:  13,
		},
	}

	for _, item := range FoodItem {
		db.FirstOrCreate(&item, entity.FoodItem{
			Name:        item.Name,
			Image:       item.Image,
			Credit:      item.Credit,
			Description: item.Description,
			FoodFlagID:  item.FoodFlagID})
	}

	EducationalGroup := []entity.EducationalGroup{
		{
			Name: "โรคไต",
		},
		{
			Name: "โรคเบาหวาน",
		},
		{
			Name: "ออกกำลังกาย",
		},
		{
			Name: "โภชนาการ",
		},
	}

	for _, group := range EducationalGroup {
		db.FirstOrCreate(&group, entity.EducationalGroup{
			Name: group.Name,
		})
	}

	ContentCategory := []entity.ContentCategory{
		{
			Category: "บทความ",
		},
		{
			Category: "คลิปวิดิโอ",
		},
		{
			Category: "อินโฟกราฟฟิก",
		},
	}

	for _, category := range ContentCategory {
		db.FirstOrCreate(&category, entity.ContentCategory{
			Category: category.Category,
		})
	}

	EducationalContent := []entity.EducationalContent{

		{
			Title:              "ผักผลไม้ที่ช่วยทดแทนน้ำในร่างกาย และทำให้ร่างกายสดชื่น",
			PictureIn:          "https://multimedia.anamai.moph.go.th/oawoocha/2024/05/heath_me_43_fruit_1_0-300x300.jpg",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2024/05/heath_me_43_fruit_1_0-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "🕺เติมชีวิตชีวาให้กับร่างกายหน้าร้อน แค่มีเธอ 🥒(ผัก-ผลไม้)🍉\n🔺ช่วงฤดูร้อน ที่อุณภูมิเพิ่มสูงขึ้น อาจทำให้ร่างกายรู้สึกอ่อนเพลีย และเกิดภาวะขาดน้ำได้\n🔶 นอกจากเช็คการดื่มน้ำที่เพียงพอต่อวันแล้ว (8-10 แก้วต่อวัน) ยังมีตัวเสริมตัวช่วยอย่าง ผัก ผลไม้บางชนิดที่รู้จักและกินเป็นประจำได้อีกทางหนึ่ง\n🔸 ผัก ผลไม้ประเภทนี้ จะอุดมไปด้วยน้ำสูงถึงร้อยละ 90 ช่วยลดความร้อนและทำให้ร่างกายสดชื่น\nช่วยทดแทนน้ำในร่างกายที่สูญเสียไปเรื่องจากอากาศร้อนได้ แถมยังมีสารต้านอนุมูลอิสระที่เกิดขึ้นตามธรรมชาติ ช่วยลดการอักเสบจากการเผาไหม้ของแสงแดดในหน้าร้อน ได้แก่ แตงกวา🥒 คะน้า มะเขือเทศ🍅 แตงโม🍉 มะละกอ และฝรั่ง",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  1,
		},
		{
			Title:              "ดับร้อน ด้วย ไอศกรีม รู้ก่อนเลือกกิน",
			PictureIn:          "https://multimedia.anamai.moph.go.th/oawoocha/2024/04/heath_me_32_sweet_1-300x300.jpg",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2024/04/heath_me_32_sweet_1-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "🔹“ไอศกรีม” เป็นของหวานที่ช่วยสร้างความสดชื่นในช่วงหน้าร้อนได้เป็นอย่างดี มีส่วนประกอบหลักคือ ครีม นมผง หางนม โยเกิร์ต นมเปรี้ยว และส่วนผสมของสารให้รสหวาน ซึ่งนอกจากน้ำตาลแล้วยังมีกลูโคสไซรัป ฟรุกโตส น้ำผึ้ง หรืออาจมีไขมันพืช ไข่ กะทิ เพิ่มด้วย ส่วนประกอบเหล่านี้ล้วนแต่เพิ่มน้ำหนักให้ผู้บริโภคทั้งสิ้น จึงควรเลือกชนิดของไอศกรีมที่เหมาะสมหรือหลีกเลี่ยงไอศกรีมชนิดไขมันสูง เพราะไอศกรีมบางประเภทโฆษณาว่ามีไขมัน 0% แต่กลับมีน้ำตาลสูง ถึง 3.5 – 6.5 ช้อนชา จึงควรกินในปริมาณที่พอเหมาะ โดยเฉพาะผู้ที่มีระดับคอเลสเตอรอลสูง ควรเลือกไอศกรีมที่มีส่วนผสมของไขมันน้อย หรือไอศกรีมที่ไม่มีไขมันเลย เช่น ไอศกรีมเชอร์เบท หรือไอศกรีมหวานเย็น สำหรับผู้ที่มีไขมันไตรกลีเซอไรด์ ควรกินไอศกรีมเป็นครั้งคราวและจำกัดปริมาณไอศกรีมทุกชนิด เนื่องจากส่วนผสมของไขมันและน้ำตาลที่มีอยู่ในปริมาณมาก มีผลทำให้ระดับไขมันไตรกลีเซอไรด์ในเลือดสูงขึ้นได้ ผู้ที่ต้องการควบคุมน้ำหนัก ควรหลีกเลี่ยงไอศกรีมที่มีไขมันสูง หรือไอศกรีมที่มีน้ำตาลสูง🔹",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  1,
		},
		{
			Title:              "หมั่นเติมรักให้หวานทุกวัน",
			PictureIn:          "https://multimedia.anamai.moph.go.th/oawoocha/2024/04/heath_me_20_valentine_2-300x300.jpg",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2024/04/heath_me_20_valentine_2-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "ของหวานที่นิยมมอบเป็นของขวัญ คือ ช็อกโกแลต 🍫 ซึ่งมีมากมายหลากหลายแบบ กรมอนามัยขอยกตัวอย่างช็อกโกแลต 3 แบบ ที่นิยมมอบให้กัน\n\n📌1. ช็อกโกแลต รสนมชิ้นเล็ก 28 กรัม = 145 กิโลแคลรอรี\nหากชวนกันปั่นจักรยาน 🚴‍♂️ ในความเร็ว 16 กม. / ชั่วโมง ต้องใช้เวลา 35 นาที\n📌2. เค้กช๊อกโกแลต 60 กรัม = 225 กิโลแคลรอรี\nหากชวนกัน วิ่ง/เดินเร็ว 🏃‍♀️ ต้องใช้เวลา 70 นาที\n📌3. ช็อกโกแลตสอดไส้ถั่วแมคคาเดเมีย 30 กรัม = 170 กิโลแคลลอรี\nหากชวนกันไปว่ายน้ำ 🏊 ต้องใช้เวลาถึง 40 นาที",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  1,
		},
		{
			Title:              "ช็อกโกแลต อีกหนึ่งดาวเด่นในเดือนแห่งความรัก",
			PictureIn:          "https://multimedia.anamai.moph.go.th/oawoocha/2024/04/heath_me_18_valentine_1-300x300.jpg",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2024/04/heath_me_18_valentine_1-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "💖 วาเลนไทน์ กับ ช็อกโกแลต 🍫 มักเป็นดาวเด่นในช่วงนี้ สาว ๆ หลายคน อาจจะมองว่า อ้วนบ้าง หวานบ้าง วันนี้ เลยจะมาเสนออีกมุมของ ช็อกโกแลต ต้อนรับเดือนแห่งความรัก ให้รู้จักประเภทของ chocolate และประโยชน์ โดยทั่วไปจะแบ่งออกเป็น 3 ประเภทหลัก ๆ คือ\n\n1. ดาร์กช็อกโกแลต (Dark Chocolate) 🖤 มีปริมาณของเนื้อช็อกโกแลตอยู่ที่ 50-90% ยิ่งมีเปอร์เซ็นต์ความเข้มข้นสูงยิ่งมีรสขม\n2. มิลค์ ช็อกโกแลต (Milk Chocolate) 🤎 มีปริมาณของเนื้อช็อกโกแลต 10-50% และมีปริมาณนมที่มากกว่า\n3. ไวท์ ช็อกโกแลต (White Chocolate) 🤍 เป็นช็อกโกแลตประเภทหนึ่ง มักประกอบด้วยเนยโกโก้, น้ำตาล, และมิลค์ซอลิด (milk solid)",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  1,
		},
		{
			Title:              "กินอาหารให้ตรงเวลาครบทุกมื้อ โดยเฉพาะมื้อเช้า",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2024/04/heath_me_6_eat_2-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "เลี่ยงการกินจุบจิบระหว่างการทำงานหรือเลือกกินผลไม้หวานน้อย",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  1,
		},
		{
			Title:              "เลี่ยงการกินจุบจิบระหว่างการทำงานหรือเลือกกินผลไม้หวานน้อย",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2024/04/heath_me_5_eat_1-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "เลี่ยงการกินจุบจิบระหว่างการทำงานหรือเลือกกินผลไม้หวานน้อย",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  1,
		},
		{
			Title:              "เขียงจ๋า (รา)…ลาก่อน",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/10/Butcher-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "เขียง …อุปกรณ์คู่ครัวที่ทุกบ้านขาดไม่ได้ ไม่ว่าจะหั่น สับ ซอย กับเนื้อหรือผัก ก็ต้อง ใช้เขียงเพื่อรองรับมีดทั้งนั้น ดังนั้น การเลือกใช้เขียงจึงต้องใส่ใจกันสักนิด โดยเขียงที่นิยมใช้ในปัจจุบันมี 2 ชนิด คือ เขียงไม้ และเขียงพลาสติก ผู้ใช้ควรเลือกเขียงที่มี พื้นผิวเรียบ ไม่มีรอยขูด หรือร่องเฉือนลึกลง จนไม่สามารถล้างทำความสะอาดได้ ส่วนการทำความสะอาดเขียงต้องทำทุกครั้งก่อนและหลังการใช้งาน โดยเฉพาะเขียงที่ใช้หั่น เนื้อสัตว์ ต้องล้างคราบไขมันออกให้สะอาดหมดจด\n\nสำหรับร้านค้าที่ไม่ได้ใช้เขียงตลอดเวลา ต้องใช้ฝาชีครอบเขียงเพื่อป้องกันแมลงวันตอมการใช้เขียงที่ถูกวิธีต้องแยกเขียงสำหรับ หั่นอาหารสุก ดิบ หรือผัก เพื่อเป็นการป้องกัน เชื้อโรคระหว่างอาหารสุกกับอาหารดิบ และ การเก็บรักษานั้น ต้องเก็บเขียงไว้ให้สูงกว่าพื้นถ้าเป็นเขียงไม้ต้องหมั่นนำออกผึ่งแดดเพื่อป้องกันเชื้อราที่มักเกิดขึ้นได้ง่ายหากมีความชื้น มากเกินไป",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  1,
		},
		{
			Title:              "เห็ดป่า…เห็ดพิษคิดก่อนเก็บ",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/09/mushroom-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "“เห็ด” อาหารประเภทผักที่มีโปรตีนให้พลังงานใยอาหารและโพแทสเซียมสามารถนำมาทำอาหารได้หลากหลาย  เช่น ยำเห็ดสามอย่าง  แกงเลียงเห็ด  แกงจืดเห็ดแกงส้มเห็ด แกงลาวเห็ด ต้มยำเห็ด เป็นต้นเห็ดที่ผู้คนนิยมกินนั้นมีทั้งที่เพาะขึ้นมาและเห็ดป่าทีี่เกิดขึ้นเองตามธรรมชาติ  ซึ่งต้องเลือกอย่างดี  เพราะหากเลือกไม่ดีอาจเจอเห็ดพิษ กินเข้าไปอันตรายถึงชีวิตได้\n\nการเก็บเห็ดป่าจะต้องเลือกเห็ดที่มีรูปร่างสมบูรณ์  เก็บให้ครบทุกส่วนโดยขุดให้ลึกเห็ดบางชนิดอาจถูกฝนชะล้างให้จางลงได้  ไม่เก็บเห็ดที่ขึ้นใกล้โรงงานสารเคมี  สนามกอล์ฟหรือข้างถนน เนื่องจากเห็ดสามารถดูดซับสารพิษและโลหะหนักไว้ในตัวได้มาก  เห็ดที่ไม่เคยกินมาก่อนควรกินเพียงเล็กน้อยเพราะอาจมีอาการแพ้ได้ และห้ามกินเห็ดดิบๆ โดยเด็ดขาด",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  1,
		},
		{
			Title:              "น้ำมะนาวจี๊ดจ๊าด สูงวัยสุขภาพดี",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/09/lemon-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "“น้ำมะนาว” พืชผักสวนครัวของไทยที่นิยมใช้น้ำเพื่อเพิ่มรสเปรี้ยวให้กับอาหารจนกลายเป็นเอกลักษณ์ของอาหารไทยไปแล้ว ด้านโภชนาการเท่านั้น  แต่ยังมีสรรพคุณเป็นยาช่วยในการรักษาโรคและอาการต่างๆ  เช่น  บรรเทาอาการวิงเวียนศีรษะ  ช่วยแก้อาเจียนอันเนื่องมาจากความผิดปกติของธาตุในร่างกายรักษาอาการลมเงียบรักษาอาการตาแดง ช่วยบรรเทาอาการไข้น้ำมะนาว … ใช่ว่าจะมีประโยชน์เฉพาะ\n\nนอกจากนี้ยังมีวิตามินซีสูง  ช่วยในการรักษาอาการเลือดออกตามไรฟันหรือโรคลักปิดลักเปิดช่วยบรรเทาอาการไอและขับเสมหะ  บรรเทาอาการต่อมทอนซิลอักเสบลดอาการเหงือกบวมช่วยขับพยาธิ รักษาอาการท้องผูก ท้องอืด ปวดท้องท้องแน่น ท้องเฟ้อ รักษาอาการโรคกระเพาะ ท้องร่วงแก้อาการบิด  รักษาอาการปัสสาวะกะปริบกะปรอยหรือขัดเบา   ช่วยฟอกและบำรุงโลหิต รักษาอาการโลหิตจาง  แก้โรคเหน็บชา  และยังช่วยรักษาอาการปวดข้อได้ โดยเฉพาะกลุ่มผู้สูงอายุ ถือเป็นตัวช่วยต่างๆ  ที่ทำให้มีสุขภาพดีขึ้น",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  1,
		},
		{
			Title:              "กินอาหารถุง ต้องอุ่นร้อน",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/09/food-bag-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "อาหารถุง…ความสะดวกของแม่บ้านในยุคนี้ เป็นอาหารที่ปรุงสำเร็จพร้อมนำกลับไปบริโภคได้ ทันที มีให้เลือกหลากหลายทั้งต้ม นึ่ง ผัด ทอด ยำ และหาซื้อได้ง่ายตามตลาดทั่วไป  \n\nการเลือกซื้อ จึงควรเลือกอาหารปรุงสุกใหม่ๆ บรรจุใส่ถุงไว้ ไม่นาน และยังมีความร้อนอยู่ หรือสังเกตว่า อาหารถุงนั้นไม่มีสีดำคล้ำหรือสีเข้มผิดปกติ ไม่มีฟอง กลิ่นเหม็นเปรี้ยว เน่าเสีย\n\nเมื่อซื้อมาแล้ว ควรกินทันที และหากเก็บไว้ในตู้เย็น ก่อนกินควร อุ่นให้ร้อนอีกครั้ง\n\nส่วนร้านที่ซื้อก็สำคัญ ให้เลือกร้านที่ได้ มาตรฐาน เก็บอาหารไว้ในตู้หรือมีภาชนะปิดมิดชิด เพื่อป้องกันแมลงวัน หนู แมลงสาบ ฝุ่นละออง และอาหารที่จำหน่ายควรวางสูงจากพื้น 60 ซม.\n\nรวมถึงผู้ขายต้องแต่งกายสะอาด เรียบร้อย สวม ผ้ากันเปื้อน สวมหมวกคลุมผม และใช้ทัพพีหรือ อุปกรณ์หยิบจับอาหาร พร้อมทั้งอุ่นอาหารให้ ร้อนเสมอ\n\nการอุ่นร้อนเป็นการป้องกันเบื้องต้นให้ ปลอดภัยจากเชื้อโรค ที่ปนเปื้อนมากับอาหาร",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  1,
		},
		{
			Title:              "ความเชื่อผิดๆ เกี่ยวกับการกินไข่",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2023/10/video_egg_1-400x210.jpg",
			Link:               "https://www.youtube.com/embed/b6s-jiRlw-s?si=OK-zI3OUVL4kMv39",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  2,
		},
		{
			Title:              "รู้จักกับแพลตฟอร์มสุขภาพ “สาสุข อุ่นใจ”",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2023/09/video_appication_2-400x210.jpg",
			Link:               "https://www.youtube.com/embed/omAY_EPNGIU?si=BnJ40PJ9-uiBQz9C",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  2,
		},
		{
			Title:              "เพราะเราไม่ได้คู่กัน อาหารที่ไม่ควรกินคู่กัน",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2023/09/video_food_1-400x210.jpg",
			Link:               "https://www.youtube.com/embed/9QmtWk8v4I4?si=N2Bl5YD7SQg1f3h_",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "อาหารที่ไม่ควรกินคู่กัน\n\n     – น้ำผึ้ง ไม่ควรกินคู่กับ น้ำร้อน\n     – ทุเรียน ไม่ควรกินคู่กับ แอลกอฮอล์\n     – ทุเรียน ไม่ควรกินคู่กับ ลำไย\n     – ผัก หรืออาหารที่มีเส้นใยสูง ไม่ควรกินคู่กับ นม\n     – ชา ไม่ควรกินคู่กับ ชา\nแนะนำ : อาหารบางชนิดไม่เหมาะที่จะรับประทานด้วยกัน เนื่องจากมีส่วนประกอบและคุณสมบัติที่แตกต่าง ซึ่งเมื่อรวมกันแล้วอาจกลายเป็นอุปสรรคต่อระบบการย่อย และดูดซึม หรือส่งผลกระทบต่อร่างกายได้",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  2,
		},
		{
			Title:              "ไอโอดีน ตอนสำนึกผิด (หญิงตั้งครรภ์ที่ขาดสารไอโอดีน ส่งผลต่อทารกในครรภ์)",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2023/07/video_iodine_3-400x210.jpg",
			Link:               "https://www.youtube.com/embed/DUn7EH_Y7E0?si=Rhprf86aWnJ1njVF",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "ไอโอดีน ตอนสำนึกผิด\n     หญิงตั้งครรภ์ที่ขาดสารไอโอดีน ส่งผลต่อทารกในครรภ์ ทำให้ทารกที่เกิดมามีโอกาสเป็น โรคเอ๋อ หรือภาวะปัญญาอ่อน สติปัญญาต่ำ ซึ่งเป็นหานี้ไม่ได้เกิดขึ้นแค่วัยเด็กเท่านั้น แต่ยังสามารถเกิดขึ้นได้กับทุกเพศ ทุกวัย โรคที่อาจเกิดจากการขาดสารไอโอดีนในผู้ใหญ่ เช่น ไทรอนด์ฮอร์โมนต่ำ มีภาวะแทรกซ้อนต่าง ๆ เกียจคร้าน อ่อนเพลีย ง่วงซึม ไม่กระฉับกระเฉง ศักยภาพในการทำงานต่ำลง เปลี่ยนมาปรุงรสอาหารด้วยเกลือไอโอดีน เพื่อลดโอกาสเป็นโรคจากการขาดสารไอโอดีน",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  2,
		},
		{
			Title:              "ไอโอดีน ตอนขาดไม่ได้",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2023/08/video_iodine_1-400x210.jpg",
			Link:               "https://www.youtube.com/embed/7q0She_GekY?si=xTxmMGHTK3DBmh9p",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "ความสำคัญของไอโอดีน\n    ถ้าร่างกายขาดสารไอโอดีน จะทำให้ เกียจคร้าน อ่อนเพลีย ง่วงซึม ไม่กระฉับกระเฉง ศักยภาพในการทำงานต่ำลง ควรใช้เกลือเพิ่มไอโอดีนในการปรุงรสอาหารด้วยปริมาณที่พอดี ใช้ปรุงอาหาร 1 ช้อนชา / วัน ทุกวัน ทุกวัย ต้องได้ไอโอดีน",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  2,
		},
		{
			Title:              "เห็ดพิษ อันตรายถึงชีวิต",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2020/10/vdo-Poisonous-mushroom-400x210.png",
			Link:               "https://www.youtube.com/embed/ND-GG9zQ8OU?si=Y2qkZdZcwPvghuH-",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  2,
		},
		{
			Title:              "ผัก ผลไม้ วิตามินซีสูงเพิ่มภูมิต้านทานไข้หวัดได้",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2020/10/vdo-Hight-vitC-400x210.png",
			Link:               "https://www.youtube.com/embed/ThqcnWZv3hA?si=GDlM4JW88ucIZTov",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "หน้าฝนหรือช่วงอากาศเปลี่ยนแปลง หันมาใส่ใจสุขภาพของตนเองให้มากขึ้นโดยเลือกกินผักสมุนไพรและผลไม้รสเปรี้ยว",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  2,
		},
		{
			Title:              "เนื้อวัวแท้ ดูอย่างไร?",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2020/10/vdo-Real-beef-check-400x210.png",
			Link:               "https://www.youtube.com/embed/GTyI6g2SJgk?si=RSQ9sMc8wMHIaju0",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  2,
		},
		{
			Title:              "หวานน้อยสั่งได้",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2020/10/vdo-lowsugar-400x210.png",
			Link:               "https://www.youtube.com/embed/4KZPjxUze6g?si=fE541q2eDQ8z0BX6",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  2,
		},
		{
			Title:              "เมนูเด็ดหลังไหว้เจ้า",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2020/03/Menuwaijao-400x210.png",
			Link:               "https://www.youtube.com/embed/U3jrlr7w0CY?si=-3h8SZcfAuzGvrB4",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "คำแนะนำ และ คำเตือน แนวทางสำหรับการทำอาหาร หลังเทศกาลตรุษจีน",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  2,
		},
		{
			Title:              "ไก่ต้ม 1 ตัว มีแคล มีคาร์บ เท่าไหร่ หากกินหมดใน 1 มื้อ",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2025/08/info1007_NCDs_12-724x1024.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "🔸 ไก่ต้ม 1 ตัวหนักประมาณ 1,500 กรัม หรือ 1.5 กิโลกรัม\n▪️ แคลอรี่ 2,475 กิโลแคลอรี่\n▪️ โปรตีน 293 กรัม\n▪️ ไขมัน 146 กรัม\n▪️ คาโบไฮเดรต 0 กรัม\n❗ หากปรุงเป็นไก่ต้มน้ำปลา 1 ช้อนโต๊ะ (15 กรัม) จะได้โซเดียม 2,000 มิลลิกรัม\n📍 ไก่ต้มธรรมดาไม่ปรุงรสเพิ่มเติม = 0 คาร์บ เหมาะสำหรับเมนูโลว์คาร์บ\n💡 แบ่งกินหลายคนลดแคลอรี่ได้ เช่น เนื้อไก่ 1 ช้อนโต๊ะ (20 กรัม) = 33 กิโลแคลอรี่\nสำคัญ: เพิ่มผักสีเขียวสดในมื้ออาหารด้วย",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  3,
		},
		{
			Title:              "ลิ้มรสหวาน…จบที่ขมปลาย",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2025/08/info1002_food_31.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "📑 หลังเทศกาลหวานในเดือนแห่งความรัก หากเกิดเหตุการณ์ไม่คาดคิด เช่น ❝ท้องไม่พร้อม❞ ควรตั้งสติและทำตาม 5 วิธี:\n1️⃣ ตั้งสติ ควบคุมอารมณ์\n2️⃣ ปรึกษาพ่อแม่ เพื่อน หรือแฟน\n3️⃣ ฝากครรภ์เพื่อดูแลจากคุณหมอ\n4️⃣ วางแผนอนาคต เช่น เรียน งาน การเงิน\n5️⃣ ดูแลสุขภาพ กินอาหารมีประโยชน์\n🎙️ หากพร้อม เราก็พร้อมไปด้วยกัน",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  3,
		},
		{
			Title:              "สารตั้งต้น 5 ผลไม้ มุ่งเบาหวาน",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2025/08/info999_fruit_6.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "💃 5 ผลไม้เสี่ยงเบาหวาน เนื่องจากน้ำตาลสูงและให้พลังงานมาก:\n1️⃣ ทุเรียน 100 กรัม: น้ำตาล 21 กรัม, 162 kcal\n2️⃣ กล้วยสุก 100 กรัม: น้ำตาล 22 กรัม, 148 kcal\n3️⃣ ลำไย 100 กรัม: น้ำตาล 18 กรัม, 78 kcal\n4️⃣ ลิ้นจี่ 100 กรัม: น้ำตาล 18 กรัม, 71 kcal\n5️⃣ มะม่วง 100 กรัม: น้ำตาล 18 กรัม, 79 kcal\n🍀 ควบคุมน้ำตาลร่วมกับผักและออกกำลังกาย เพื่อลดเสี่ยงเบาหวานและ NCDs",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  3,
		},
		{
			Title:              "ตรุษจีนคลีนๆ เลี่ยง NCDs",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2025/08/info995_NCDs_11.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "🧧 ตรุษจีนคลีน ๆ ลดหวาน มัน เค็ม เพื่อเลี่ยง NCDs ด้วย 4 วิธี:\n1️⃣ ก่อนทำอาหาร: ล้างไก่ให้สะอาด ต้มไฟอ่อน\n2️⃣ เน้นปรุง ลดหวาน มัน เค็ม: ต้ม ยำ นึ่ง อบ กินกับข้าวไม่ขัดสี เพิ่มผัก\n3️⃣ การเก็บรักษา: แบ่งเนื้อสัตว์เก็บช่องแช่แข็ง\n4️⃣ ของหวาน: จำกัดขนมไหว้ กินไม่เกิน 1 ชิ้น หรือเปลี่ยนเป็นผลไม้",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  3,
		},
		{
			Title:              "ดูแลสุขภาพกันต่อ กับ ❝ไขมันดี HDL-C สูตรลับหัวใจแข็งแรง❞",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2025/08/info989_NCDs_10-724x1024.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "👩‍⚕️ HDL-C ❝ไขมันดี❞ ช่วยขนส่งคอเลสเตอรอล ลดความเสี่ยงโรคหัวใจ:\n🟢 แนะนำ: ปลาทะเล, อะโวคาโด, ถั่ว, น้ำมันมะกอก\n🟡 จำกัด: เนย, ชีส, มันสัตว์, กะทิ\n🔴 หลีกเลี่ยง: ไขมันทรานส์ เช่น มาการีน, อาหารทอด\n👌 ปรับพฤติกรรมกินไขมันดีมากขึ้น ลดไขมันอิ่มตัวและทรานส์ เพื่อสุขภาพดี",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  3,
		},
		{
			Title:              "โซเดียมน่ารู้ กับ 5 เมนูฮิต โซเดียมเกิน",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2025/08/info988_food_30.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "🧂 5 เมนูโซเดียมเกินต่อวัน:\n1️⃣ ก๋วยเตี๋ยวน้ำใส 1 ชาม 500 กรัม: 1,406–2,397 mg\n2️⃣ ก๋วยเตี๋ยวหมู/ไก่ตุ๋น 500 กรัม: 1,782–2,072 mg\n3️⃣ ก๋วยเตี๋ยวน้ำตก 500 กรัม: 2,104–2,316 mg\n4️⃣ ก๋วยเตี๋ยวต้มยำ 500 กรัม: 1,304–2,862 mg\n5️⃣ ก๋วยเตี๋ยวเย็นตาโฟ 500 กรัม: 2,233–2,723 mg\n‼️ หลีกเลี่ยงปรุงเพิ่ม ลดซดน้ำซุป",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  3,
		},
		{
			Title:              "เลี่ยง ❝ขนมหวาน❞ ลอง ❝เรดฟรุ๊ต❞",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2025/08/info971_fruit_5.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "🍎 🍓 🍒 🍉 เลือกผลไม้สีแดงแทนขนมหวาน:\n1️⃣ แอปเปิ้ลแดง 100 กรัม: พลังงาน 35 kcal, โพแทสเซียม 61 mg, เบต้าแคโรทีน 18 µg\n2️⃣ องุ่นแดง 100 กรัม: พลังงาน 37 kcal, โพแทสเซียม 138 mg, เบต้าแคโรทีน 55 µg\n3️⃣ สตรอเบอร์รี่ 100 กรัม: พลังงาน 29 kcal, โพแทสเซียม 156 mg, วิตามินซี 65 mg\n4️⃣ เชอร์รี่ 100 กรัม: พลังงาน 49 kcal, โพแทสเซียม 486 mg, วิตามินซี 20 mg\n5️⃣ ชมพู่ 100 กรัม: พลังงาน 40 kcal, โพแทสเซียม 111 mg, เบต้าแคโรทีน 11 µg, วิตามินซี 10 mg",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  3,
		},
		{
			Title:              "การจัดการด้านอาหารในภาวะวิกฤติ ด้วย ชุดอาหารอิ่มท้อง",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2025/08/info950_food_29.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "📻 จัดการอาหารในภาวะวิกฤติ ชุดอาหารอิ่มท้อง:\n🍚 ข้าว – 🍞 แป้ง: ข้าวสวยสำเร็จรูป ขนมปังกรอบ คุกกี้ แครกเกอร์ ข้าวแต๋น ซีเรียล\n🥜 ถั่วและธัญพืช: ถั่วลิสงคั่ว ถั่วทอด กระยาสารท ถั่วตัด งาตัด\n🍌 ผลไม้แห้ง: กล้วยตาก กล้วยอบ มะม่วงกวน มะละกออบ\n🌶 น้ำพริก: น้ำพริกเผา น้ำพริกปลาป่น น้ำพริกปลาย่าง\n🐟 ปลาและเนื้อสัตว์: ปลาเดียวทอด 🥚 ไข่เค็ม หมูแผ่น หมูยอ กุนเชียง\n🥫 อาหารสำเร็จรูป: ข้าวสวยกระป๋อง ปลากระป๋อง ผักกาดดองกระป๋อง\n🥛 อื่น ๆ: น้ำดื่ม นมถั่วเหลือง นมสดยูเอชที น้ำผลไม้\n📑 คำนึงถึงวันหมดอายุ, บรรจุปิดสนิท, ไม่เน่าเสีย",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  3,
		},
		{
			Title:              "ยูเนสโก ขึ้นทะเบียน “ต้มยำกุ้ง” มรดกวัฒนธรรมที่จับต้องไม่ได้ของมนุษยชาติ",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2025/08/info939_food_28.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "องค์การยูเนสโกขึ้นทะเบียน “ต้มยำกุ้ง” เป็นมรดกวัฒนธรรมที่จับต้องไม่ได้\nคุณค่าทางโภชนาการ:\nกุ้ง: โปรตีนสูง แคลเซียมสูง\nเห็ดฟาง เห็ดนางฟ้า: โปรตีนสูง, พลังงานต่ำ, ใยอาหารสูง\nพริกขี้หนู: ป้องกันหวัด ลดก๊าซย่อยอาหาร\nมะนาว: วิตามินซีสูง\nข้อแนะนำ: เลือกต้มยำน้ำใส กินอาหารสะอาด ปรุงสุกใหม่ หลีกเลี่ยงไขมันสูง หวานจัด เค็มจัด",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  3,
		},
		{
			Title:              "ไข่.. คุณประโยชน์ที่หาง่าย กินง่าย ใคร ๆ ก็รัก",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2025/05/info871_food_25.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "🥚 🌏 วันไข่โลก 2024 ตรงกับวันที่ 11 ตุลาคม\nคุณประโยชน์ของไข่:\n🔸 ไข่ไก่: พลังงาน 143 kcal, โปรตีน 12.77 g, ไขมัน 9.65 g, แคลเซียม 70 mg, วิตามินเอ 182 µg, ไอโอดีน 49 µg, คอเลสเตอรอล 427 mg\n🔸 ไข่เป็ด: พลังงาน 178 kcal, โปรตีน 13.03 g, ไขมัน 13.35 g, แคลเซียม 98 mg, วิตามินเอ 269 µg, ไอโอดีน 52 µg, คอเลสเตอรอล 543 mg\n❗ ปริมาณแนะนำ: ผู้ใหญ่ วันละ 1 ฟอง, ผู้สูงอายุ วันละ 1 ฟอง, ผู้ป่วยบางโรคไม่เกิน 3 ฟอง/สัปดาห์\n💡 กินไข่ควบคู่อาหารครบ 5 หมู่",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  3,
		},
		{
			Title:              "ฟิตเตรียมพร้อม ก่อนก้าวเดิน",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/09/walk-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "หลายๆ คนเข้าใจตรงกันว่า “การเดิน” เป็นการออกกำลังกาย ที่ไม่ต้องลงทุนอะไรมากมาย แถมยังเหมาะสำหรับทุกเพศ ทุกวัย ... พร้อมที่จะนับ 1…2..3..แล้วเริ่มเดินอย่างถูกวิธีกันตั้งเเต่วันนี้หรือยังคะ",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  1,
		},
		{
			Title:              "SAVE YOUR HEALTH",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/09/fitness-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "“Fitness” หรือสถานประกอบกิจการเพื่อสุขภาพ ในปัจจุบันมีผู้ใช้บริการเป็นจำนวนมาก ... อย่าลืมยืดเหยียดกล้ามเนื้อก่อนการออกกำลังกายทุกครั้งและไม่ควรหักโหมมากเกินไปเพราะจะทำให้เป็นอันตรายต่อสุขภาพ",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  1,
		},
		{
			Title:              "เตรียมพร้อม… ก่อนออกไป“ปั่น”",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/09/bike5-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "จักรยาน พาหนะที่ผู้คนในปัจจุบันนิยม ใช้กันมาก ... ติดไฟท้าย จักรยานและสวมหมวกนิรภัย เสมอเพื่อความปลอดภัยในทุกเส้นทาง",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  1,
		},
		{
			Title:              "Bike for Health",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/09/bike-1-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "การออกกำลังกายที่กำลังมาแรงแซงทางโค้งขณะนี้คงหนีไม่พ้น “การปั่นจักรยาน” ... ใจพร้อม อุปกรณ์พร้อมเริ่มต้นวันนี้ สุขภาพดีใครๆ ก็มีได้",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  1,
		},
		{
			Title:              "ป่วยเบาหวาน…ก็ออกกำลังกายได้",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/09/1-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "การออกกำลังกาย เป็นสิ่งที่มีประโยชน์และทำได้ง่าย แม้ในผู้ป่วยที่เป็นโรคเบาหวาน ... การออกกำลังกายเป็นประจำ นอกจากจะดีต่อผู้ป่วยเบาหวานแล้ว สิ่งสำคัญที่ต้องควบคุมคือพฤติกรรมการกินอาหารและต้องพักผ่อนให้เพียงพอก็จะดีต่อสุขภาพ",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  1,
		},
		{
			Title:              "ปั่น ปั่น สร้างสุขภาพ",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/09/bike-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "การออกกำลังกายมีให้เลือกมากมายหลายประเภท ... สำรวจตัวเอง…ถ้าร่างกายพร้อม อุปกรณ์ พร้อม ก็เริ่มปั่นจักรยานเพื่อสุขภาพกันได้เลย",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  1,
		},
		{
			Title:              "หุ่นดี สุขภาพดี“ฮูลาฮูป”",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/09/hola-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "เดี๋ยวนี้ มองไปทางไหนเริ่มเห็นสาวๆ (แทบ)ทุกวันหันมาพกห่วงกันว่าเล่น … แต่ก่อนจะลงมือเล่น กรมอนามัยมีข้อแนะนำดีๆ มาฝาก ... ทางที่ดีควรเลือกห่วงที่มีขนาดไม่หนักหรือใหญ่เกินไป",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  1,
		},
		{
			Title:              "ออกกำลังกายในน้ำคลายร้อน",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/09/swim-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "การออกกำลังกายในน้ำแบ่งได้ 2 รูปแบบ คือ การออกกำลังกายในน้ำลึก “Deep Water Exercise” ... เมื่อเตรียมตัวพร้อมแล้ว… ก็เริ่มออกกำลังกายในน้ำกันได้เลย",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  1,
		},
		{
			Title:              "ต่างวัย ออกกำลังกายต่างกัน",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/09/exercise-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "การออกกำลังกายเพื่อสุขภาพเปรียบเสมือนการให้ ‘อาหารเสริมที่ดี’ กับชีวิตทุกคน ... การเลือกออกกำลังกายที่เหมาะสมกับวัย เพื่อให้เกิดผลดีต่อสุขภาพ ต้องปฏิบัติเป็นประจำ รับรองได้ว่า ดีทั้งสุขภาพกายและสุขภาพจิตแน่นอน",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  1,
		},
		{
			Title:              "5ท่า คลายเมื่อยหลังพวงมาลัย",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/09/control-wheel-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "เมื่อต้องขับรถทางไกลนานๆ ความเมื่อยล้าเป็นอีกหนึ่งปัญหาที่ต้องพบ ... เมื่อร่างกาย สติ และสภาพรถยนต์พร้อม ก็ออกเดินทางด้วยความปลอดภัยกันต่อได้เลย",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  1,
		},

		{
			Title:              "นอนน้อยแต่ต้องนอนนะ",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2023/02/sleep-390x210.png",
			Link:               "https://www.youtube.com/embed/VJ29SDWPHoc?si=13CGkBPByN2lpxEW",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  2,
		},
		{
			Title:              "World Cup ดูบอลแล้วดูแลตัวเองด้วยนะ",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2022/12/World-Cup-400x210.png",
			Link:               "https://www.youtube.com/embed/FIx4TGbkV8A?si=h8qD0yL8yHxCkg7B",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  2,
		},
		{
			Title:              "ออกกำลังกายหน้าร้อน",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2021/10/vdo44-Safety-Exercise-in-Summer-Season-400x210.png",
			Link:               "https://www.youtube.com/embed/JQDl-tJJjDU?si=2T7gcyzS0CEz5-QB",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  2,
		},
		{
			Title:              "การฝึกปอดเพื่อสร้างความแข็งแรงในช่วงโควิด-19",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2021/07/vdo02-Diaphragmatic-breathing-400x210.png",
			Link:               "https://www.youtube.com/embed/jeaihYSSynU?si=LpOQvV2hJVyvt9FZ",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  2,
		},
		{
			Title:              "7 สัปดาห์รอบรู้สู่สุขภาพดี : 7 Weeks สัปดาห์ที่ 6 ทบทวน มีวินัย สร้างแรงจูงใจ ควบคุม",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2020/03/7Weeks-6-400x210.png",
			Link:               "https://www.youtube.com/embed/ZYx1zF2JZLM?si=6lreoQCwT6Sw0dmL",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  2,
		},
		{
			Title:              "ออกกำลังกายให้พอดี FITT ช่วยได้",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/11/FITT-400x210.png",
			Link:               "https://www.youtube.com/embed/9svf8CoNfyc?si=dlggic9DjQJc3dUg",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "สำหรับผู้ที่ชอบออกกำลังกายควรประเมินร่างกายตนเองและคอยสังเกตอาการผิดปกติที่อาจเกิดขึ้นระหว่างออกกำลังกายอยู่เสมอ\n\nและควรออกกำลังกายอย่างเหมาะสม ด้วยหลัก FITT เพื่อสร้างสุขภาพที่ดี",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  2,
		},
		{
			Title:              "คลิปออกกำลังกาย Tooth Your Brush",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/08/PA-break-with-tooth-brush-song-400x210.png",
			Link:               "https://www.youtube.com/embed/AH5Lb-6Gqu8?si=ym3q4rRPc-pIRuRj",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "กิจกรรมทางกายที่เป็นการสอดแทรกท่าทางในการแปรงฟัน และใช้เพลงแปรงฟันในการออกกำลังกาย โดยใช้เวลาสั้นๆ สามารถทำได้ทุกเพศ ทุกวัย โดยใน 1 คลิปวิดีโอจะสามารถเผาผลาญพลังงานได้ 7 กิโลแคลอรี่ และสามารถสะสมก้าวเดินได้ถึง 317 ก้าว",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  2,
		},
		{
			Title:              "มาออกกำลังกาย สุขภาพดี ด้วย #คีตะมวยไทย",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/08/keta-400x210.jpg",
			Link:               "https://www.youtube.com/embed/1rL_fHb1iks?si=95a8FyJ7SYA9fRzf",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "#คีตะมวยไทย คือ การออกกำลังกายสไตล์ไทยประยุกต์ ที่นำศิลปะแม่ไม้มวยไทยมาผสมผสานกับการเต้นแอโรบิค โดยใช้ร่างกายเป็นอาวุธ ทั้งหมัด เท้า เข่า ศอก และเคลื่อนไหวร่างกายตามจังหวะเพลง วันนี้ ท่าน นายแพทย์ อุดม อัศวุฒมางกุร ผู้อำนวยการกองกิจกรรมทางกายเพื่อสุขภาพ กรมอนามัย มาแนะนำท่าคีตะมวยไทยทั้งหมด 5 ท่า จะมีท่าอะไรบ้าง ตามไปดูกันเลยค่ะ",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  2,
		},
		{
			Title:              "3 ท่าออกกำลังกายคลายเมื่อยในออฟฟิศ",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/07/three-400x210.jpg",
			Link:               "https://www.youtube.com/embed/9ExP8lKYOKI?si=fb10a7RMqrP2BFQK",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "พักหน้าจอสักครู่ แล้วมาบริหารร่างกายกันดีกว่าค่ะ ไม่ต้องมีอุปกรณ์อะไร ก็ทำท่าบริหารร่างกายในออฟฟิศได้แล้ว คลายเมื่อยแถมแก้ออฟฟิศซินโดรมได้ด้วย ถ้าพร้อมแล้วไปดูกันเลยค่าา",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  2,
		},
		{
			Title:              "moving forward ขยับกายไปด้วยกัน",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/07/exercise-1-768x406.jpg",
			Link:               "https://www.youtube.com/embed/igOUEWpw3ag?si=ZKBBWb1VD2zrmDGT",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "กรมอนามัยชวนขยับร่างกายในวันที่ฝุ่นสูงPM2.5 สูงกว่า 90 ไมโครกรัมต่อลูกบาศก์เมตร หันมาออกกำลังกายภายในอาคาร เช่น เข้าฟิตเนส เล่นโยคะ หรือ การออกกำลังกายในสวนสาธารณะก็เป็นทางเลือกที่ดี เนื่องจากบริเวณที่อยู่ห่างจากถนนจะมีฝุ่นน้อยกว่า และต้นไม้จะช่วยกรองฝุ่นได้ ลดระยะเวลา หลีกเลี่ยงการออกกำลังกายในช่วงเช้า ควรงดการออกกำลังกายกลางแจ้งและไม่ควรใส่หน้ากาก N95 ขณะออกกำลังกายโดยเด็ดขาด",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  2,
		},
		{
			Title:              "ออกกำลังกันหน่อย คุมหวานคุมดันกันสักนิด",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2025/09/info1054_exercise_11.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "มาค่ะ วันนี้หนูรู้จะมาชวนออกกำลังกาย สำหรับผู้ป่วยเบาหวาน ความดัน จะได้คุมมันให้อยู่หมัด ด้วยวิธีการออกกำลังกายที่ถูกต้องเหมาะสมกับแต่ละบุคคลและโรคประจำตัวที่เป็นอยู่ เพราะการออกกำลังกายจะทำให้สุขภาพเราแข็งแรงขึ้นได้\n📑 การออกกำลังกายสำหรับผู้โรคป่วยเบาหวาน และ โรคความดันโลหิตสูง สามารถทำได้ 2 แบบ คือ\n1️⃣ การออกกำลังกายแบบแอโรบิก เป็นการออกกำลังที่เน้นเคลื่อนไหว กล้ามเนื้อกลุ่มใหญ่ อย่างต่อเนื่อง เช่น การเดิน การวิ่ง ปั่นจักรยาน ว่ายน้ำ เป็นต้น\n🔸 ควรออกกำลังให้รู้สึกเหนื่อยเล็กน้อย สามารถพูดได้จบประโยค ทำอย่างสม่ำเสมอ อย่างน้อย 3-5 วันต่อสัปดาห์ หรือรวม 150 นาทีต่อสัปดาห์ ควรทำเวลาเดิม และจดชนิดที่เล่น ระดับน้ำตาลในเลือด ร่วมถึงค่าความดันก่อนและหลัง เพื่อให้แพทย์วินิจฉัยและรักษาได้ดีขึ้น\n🔸 สำหรับเบาหวาน เริ่มด้วย 10-15 นาทีต่อวัน และเพิ่มเวลาขึ้นเรื่อย ๆ จนทำติดต่อกันได้ครั้งละ 20–60 นาทีต่อวัน\n🔸 สำหรับความดันโลหิต เริ่มด้วย 10-20 นาทีต่อวัน และเพิ่มเวลาขึ้นเรื่อย ๆ จนทำติดต่อกันได้ครั้งละ 30–60 นาทีต่อวัน\n2️⃣ การออกกำลังกายแบบเวทเทรนนิ่ง เป็นการใช้น้ำหนักอุปกรณ์ หรือ น้ำหนักของร่างกายเป็นแรงต้าน เพื่อสร้างกล้ามเนื้อให้แข็งแรง และช่วยให้มีการเผาผลาญพลังงานเพิ่มขึ้น\n🔸 แนะนำให้ใช้กล้ามเนื้อทุกส่วน 2-3 วันต่อสัปดาห์ โดยไม่ควรใช้กล้ามชุดเดิมติดกัน เพื่อให้กล้ามเนื้อได้มีเวลาฟื้นและไม่กลั้นหายใจขณะออกแรง\n🔸 สำหรับเบาหวาน ในช่วงแรกให้เพิ่มความแข็งแรงของกล้ามเนื้อด้วยท่า ลันจ์ ท่าสควอช ท่าวิดพื้น ครั้งละ 10-15 นาที และเมื่อรู้สึกแข็งแรงขึ้นสามารถเพิ่มอุปกรณ์ช่วยอย่าง ยางยืด ดัมเบล หรือ เครื่องเล่น 20-60 นาทีต่อวัน อย่างน้อย 3 วันต่อสัปดาห์\n🔸 สำหรับความดันโลหิต เริ่มที่อุกปรณ์อย่าง ดัมเบล ยางยืด อุปกรณ์เวทเทรนนิ่งในยิมหรือบอดี้เวทโดยใช้น้ำร่างกายตัวเองเป็นแรงต้านได้เลย และไม่ควรกลั้นหายใจออกแรง\n📌 สุดท้ายอย่าลืมสิ่งสำคัญ ควรตรวจร่างกายทั้งระดับน้ำตาลที่ไม่ควรเกิน 250 มก. และความดันโลหิตไม่เกิน 180/100 มิลลิเมตรปรอท ก่อนเสมอ เตรียมอุปกรณ์ อาหารว่าง และยาประจำตัวให้พร้อม อย่าลืมก่อนออกกำลังกายควรปรึกษาแพทย์ที่รักษาโรคประจำตัวของเราทุกครั้งถึงข้อควรระวังเฉพาะบุคคลในการออกกำลังกาย",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  3,
		},
		{
			Title:              "กลับบ้านไกล เหนื่อย…เมื่อย พัก…เหยียด",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2025/09/info1021_exercise_10.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "🚗 กลับบ้านไกล 🚶 เหนื่อย…เมื่อย พัก…เหยียด🧘‍♀️\n💦 เทศกาลสงกรานต์ หยุดยาววันศุกร์นี้ ใครหลายที่กำลังเดินทางกลับบ้าน หรือลาพักร้อนรีบกลับตั้งแต่เช้า ต้องระวัง❗ ความเหนื่อย เมื่อยล้า จากการเดินทางไกล\n🔔 การเดินทางกลับหลังเลิกงานที่เหนื่อยล้ามาทั้งวัน การขับรถนาน ๆ อาจจะไม่ปลอดภัยได้ กรมอนามัย จึงมี 10 ท่ายืดเหยียดร่างกาย คลายเมื่อยสำหรับผู้ที่ขับรถนาน ๆ มาฝากกัน\n🔸ท่าที่ 1 ยืนตรง มือท้าวเอว ยื่นคางไปด้านหน้าจนใต้คางตึง ทำค้างไว้ 15 วินาที กลับสู่ท่าเริ่มต้นศีรษะตรง แล้วก้มศีรษะจนตึงบนบริเวณคอด้านหลังค้างไว้ 15 วินาที กลับสู่ท่าเดิม (ห้ามกลั้นหายใจขณะบริหารกาย)\n🔸ท่าที่ 2 ยืนตัวตรง วางมือซ้ายบนศีรษะ แล้วเอียงคอมาด้านขวา จนรู้สึกด้านซ้ายตึง ค้างไว้ 15 วินาที ทำซ้ำใหม่ด้านตรงข้ามเหมือนเดิม\n🔸ท่าที่ 3 ยืนตรงแยกเท้าเท่าหัวไหล่มือวางที่ขอบรถ และก้มตัวลงจนรู้สึกตึงที่ไหล่และหลังส่วนบน แขนตึงค้างไว้ 15 วินาที\n🔸ท่าที่ 4 ยืนตรง ยกแขนขวาพับลงๆไว้กลางหลัง มือซ้ายจับศอกขวาดึงมาทางด้านซ้ายจนตึงต้นแขนด้านหลัง ค้างไว้ 15 วินาที ทำซ้ำใหม่ด้านตรงข้ามเหมือนเดิม\n🔸ท่าที่ 5 ยืนตรง ยกแขนขวาไปด้านหน้าระดับไหล่ ปลายนิ้วตั้งขึ้น ใช้มือซ้ายวางที่ฝ่ามือขวา แล้วดันเข้าหาตัวจนรู้สึกตึงปลายแขนด้านใน ค้างไว้ 15 วินาที ทำซ้ำใหม่ด้านตรงข้ามเหมือนเดิม\n🔸ท่าที่ 6 ยืนตรงยกแขนขวาไปด้านหน้าระดับไหล่ คว่ำมือลง ใช้มือซ้ายวางที่หลังมือขวา แล้วดันเข้าหาตัวจนรู้สึกตึงปลายแขนด้านใน ค้างไว้ 15 วินาที ทำซ้ำใหม่ด้านตรงข้ามเหมือนเดิม\n🔸ท่าที่ 7 ยืนตรงประสานมือขึ้นเหนือศีรษะ แขนตรงแล้วเอียงตัวไปด้านซ้ายจนรู้สึกลำตัวด้านขวาตึงค้างไว้ 15 วินาที ทำซ้ำใหม่ด้านตรงข้ามเหมือนเดิม\n🔸ท่าที่ 8 ยืนตรงเท้าห่างกันเท่าหัวไหล่ ค่อยๆก้มตัวลง จนรู้สึกตึงที่หลัง หรือใช้มือแตะที่ปลายเท้าค้างไว้ 15 วินาที\n🔸ท่าที่ 9 ยืนตรง มือซ้ายจับขอบประตูรถยนต์พับขาขวาขึ้น มือขวาจับปลายเท้าขวาแล้วดึงขึ้นจนตึงต้นขาด้านหน้า ค้างไว้ 15 วินาที ทำซ้ำใหม่ด้านตรงข้ามเหมือนเดิม\n🔸ท่าที่ 10 ยืนตรง มือจับท้ายรถยนต์ ก้าวเท้าซ้ายไปด้านหน้า แล้วย่อเข่าซ้ายไปข้างหน้า จนน่องที่ขาขวาตึง ค้างไว้ 15 วินาที ทำซ้ำใหม่ด้านตรงข้ามเหมือนเดิม\n✅ เพียง 10 ท่าง่าย ๆ ทำตามได้ คลายเมื่อยด้วย คล้ายง่วงหรือไม่ไหวจริง ๆ ควรจอดรถที่ ๆ ปลอดภัย มีแสงไฟสว่างเพียงพอ ไม่จอดกลางถนน หรือ ให้ดี จอดตามจุดพักรถจะดีที่สุดค่ะ เพื่อความปลอดภัยต่อตัวเราเอง และผู้ใช้ถนนร่วมกันด้วยนะคะ",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  3,
		},
		{
			Title:              "เช็กน้ำหนักเกิ๊นน..เลือกเบิร์นไงดี",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2025/08/info994_exercise_9.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "เช็กน้ำหนักเกิ๊นน..เลือกเบิร์นไงดี 🔥🏃‍♀️\n👨‍⚕️สำหรับหลาย ๆ คนที่มีปัญหาน้ำหนักเกิน❗จะลดน้ำหนักยังไงดี❓หากไม่ลดก็กลัวเสี่ยงโรค NCDs ต่างๆ ได้ ควบคุมอาหารก็ดูจะไม่เพียงพอ หรือ บางทีก็ยังต้องการกินในสิ่งที่ชอบเพื่อรักษาความสุขของใจไว้\n🏢 วันนี้กรมอนามัย จึงมีเทคนิคในการควบคุมน้ำหนักฉบับ ❝คนน้ำหนักเกิน หรือ อยู่ในภาวะโรคอ้วน❞ มาให้ลองน้ำไปปรับใช้กันดูคะ โดยจะแบ่งออกเป็น 2 ส่วน ดังนี้\n☑️1️⃣. เช็ก\nเพื่อให้เกิดความปลอดภัยในการออกกำลังกายในแบบที่เราเลือก เราควรตรวจเช็กสุขภาพหรือโรคประจำตัวที่เรามีหรือไม่ เช่น โรคความดันโลหิตสูง โรคเบาหวาน โรคไต โรคหัวใจ โรคทางเดินหายใจ โรคเกี่ยวกับกระดูก กล้ามเนื้อ ควรปรึกษาแพทย์ นักวิทยาศาสตร์การกีฬา หรือ ผู้ที่ดูแลโปรแกรมออกกำลังกาย เพื่อให้รู้ขอบเขตของร่างกายตัวเองว่าเหมาะสมกับกิจกรรมชนิดไหน\n✅2️⃣. เลือก\nควรเลือกที่เราชอบที่สุดและเหมาะสมกับตัวเอง (หลังจากผ่านการตรวจเช็กสุขภาพและปรึกษาแพทย์ หรือ นักวิทยาศาสตร์การกีฬาแล้ว) เพื่อให้มี ❝กำลังใจ และ ไม่รู้สึกฝืนที่จะทำ❞ แต่ต้องไม่ใช่แบบที่มีแรงกระแทกสูง กระโดด หรือ เคลื่อนไหวเร็วเกินไป แนะนำให้ออกกำลังกายทั้งแบบ ❝เผาผลาญไขมัน❞ และ ❝เสริมความแข็งแรงกล้ามเนื้อ❞\n🔸 การเผาผลาญไขมัน เช่น การเดินเร็ว ปั่นจักรยาน ว่ายน้ำ ที่ไม่เหนื่อยมาก แต่ต้องทำมากกว่า 20 นาทีขึ้นไป\n🔹 เสริมสร้างความแข็งแรงกล้ามเนื้อ ในคนตัวใหญ่ หรือ ต้องการลดไขมัน การสร้างกล้ามเนื้อถือเป็นจุดสำคัญในการเผาผลาญไขมัน เพราะ ยิ่งมีกล้ามเนื้อมาก ก็เผาผลาญไขมันได้เยอะขึ้น\n✔️ การออกกำลังกายที่ดี ควรทำอย่างต่อเนื้อง ให้ได้อย่างน้อย 5 วัน ต่อสัปดาห์ วันละ 30 นาที หรือสะสมให้ได้ 150 นาที ต่อสัปดาห์\n❗เสริมด้วยการกินอาหารที่ประโยชน์ ลด หวาน มัน เค็ม นับคาร์บนับแคลในแต่ละมื้อ กำหนดสัดส่วนต่อจาน ตามหลัก 2:1:1 คือ 2 (ผัก) 1 (เนื้อสัตว์ไม่ติดมัน) 1 (ข้าวขาวหรือข้าวกล้อง) จะช่วยให้เรากำหนดการเผาผลาญในแต่ละวันได้ง่ายขึ้น\nอย่าลืมวอร์มอัพ หรือ อบอุ่นร่างกาย ยืดเหยียดกล้ามเนื้อ ก่อนออกกำลังกายทุกครั้ง เพื่อลดอาการบาดเจ็บของกล้ามเนื้อด้วยนะคะ",
			AdminID:            3,
			EducationalGroupID: 3,
			ContentCategoryID:  3,
		},
		{
			Title:              "เสริมใจใกล้ชิด…ชวน จอย ทู เดอะ เฮลท์",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2025/08/info944_exercise_8.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "🗓️ เดือนธันวาคม ถือเป็นช่วงปิดท้ายปี เป็นเดือนแห่งการมอบของขวัญ และเทศกาลรื่นเริง รวมไปถึงมีหลายครอบครัวได้กลับมารวมตัวกัน มีกิจกรรม มีการฉลองด้วยมื้ออาหารที่หลากหลาย หลายวัน หลายคืนติดต่อกัน\n❗แต่อีกหนึ่งกิจกรรมที่อยากให้ลองทำร่วมกัน ก็คือ กิจกรรมทางกาย ไหน ๆ เราก็จอยด้วยอาหารการกินมาหลายคืน ลองชวนกันจอยเพื่อสุขภาพดูบ้าง แถมยังเป็นการใช้เวลาร่วมกันในครอบครัวได้ด้วย กับ กิจกรรมทางกายเพื่อสุขภาพ กับ 3 กิจกรรมที่กรมอนามัย แนะนำทำได้สะดวก ดังนี้\n🔸 กิจกรรม บริหารกล้ามเนื้อ\nเป็นการบริหารกล้ามเนื้อส่วนต่าง ๆ ให้แข็งแรง ควบคู่กับการยืดเหยียดกล้ามเนื้อ อย่างน้อย 2 วัน/สัปดาห์ เช่น ย่อเข่า ดึงยางยืด เป็นต้น\n🔸 กิจกรรมทางกาย แบบผสมผสาน\nคือ การผสมผสานการเคลื่อนไหวรูปแบบต่าง ๆ อย่างน้อย 3 วันต่อสัปดาห์ เช่น เต้นบาสโลบ ฟ้อนรำ รำวง รำไท่จี้ซี่กง ซึ่งจะช่วยพัฒนาการเคลื่อนไหวของผู้สูงอายุให้มีประสิทธิภาพ และฝึกการทรงตัว เพื่อป้องกันการหกล้มชะลอการเสื่อมของกระดูกและกล้ามเนื้อต่าง ๆ ได้อีกด้วย\n🔸 การเคลื่อนไหวในชีวิตประจำวัน โดยปกติแล้วผู้สูงอายุสามารถเคลื่อนไหวร่างกายในชีวิตประจำวันอยู่แล้ว ผ่านการทำงานบ้าน การเดิน และออกกำลังกาย โดยสะสมให้ได้อย่างน้อย 150-300 นาที/สัปดาห์ หรือโดยเฉลี่ย อย่างน้อยวันละ 30 นาที\n📑 หากเราวางแผนกิจกรรมดี ๆ เราจะได้ใช้เวลาอยู่ร่วมกัน เริ่มตั้งแต่การวอร์มร่างกายด้วยการบริหารกล้ามเนื้อ ต่อด้วยการออกกำลังกาย ไปจนถึงการทำงานบ้านด้วยกัน เปิดเพลง🎼 joy to the world 🎶 เพื่อที่จะได้จอย ทู เดอะ เฮลท์ ไปพร้อมกันทั้งครอบครัว ได้ทั้งความแข็งแรงทางร่างกาย ความสุขในความสัมพันธ์ และยังได้บ้านที่สะอาดสดชื่นอีกด้วย",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  3,
		},
		{
			Title:              "เดินไปนับไป เสริมสุขภาพด้วย Smartwatch",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2025/05/info916_Health_Literacy_9.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "⌚️⚡️ เดินไปนับไป เสริมสุขภาพด้วย Smartwatch 🚶🏻‍♀️⭐️✨\nในยุคสมัยที่เทคโนโลยีเข้ามามีบทบาทในชีวิตประจำวันมากขึ้น การดูแลสุขภาพก็กลายเป็นเรื่องที่ง่ายและสะดวกสบายมากยิ่งขึ้น หนึ่งในอุปกรณ์ยอดนิยมที่ช่วยให้เราติดตามสุขภาพได้อย่างใกล้ชิดก็คือ Smartwatch หรือ นาฬิกาอัจฉริยะ นอกจากการบอกเวลาและแจ้งเตือนต่าง ๆ Smartwatch ยังโดดเด่นในเรื่องของฟังก์ชั่นการติดตามสุขภาพ โดยเฉพาะฟังก์ชั่น การนับก้าว การเดินเป็นการออกกำลังกายเป็นพื้นฐาน ที่ทำได้ง่ายและไม่สิ้นเปลือง แต่จะรู้ได้อย่างไรว่า จำนวนก้าวที่เราเดินในแต่ละวันจะช่วยเสริมสุขภาพเราอย่างไรเราลองมาหาคำตอบไปพร้อม ๆ กัน\n🔸 น้อยกว่า 5,000 ก้าว เริ่มมีพฤติกรรมเนือยนิ่ง\n🔸 5,000 – 7,499 ก้าว เท่ากับออกกำลังกายระดับเบา\n🔸 7,500 ก้าว เท่ากับออกกำลังกายระดับปานกลาง\n🔸 10,000 ก้าว ป้องกันโรคเบาหวานและความดันโลหิตสูง\n🔴 ประโยชน์ของการเดินยังมีอื่น ๆ อีก เช่น เพิ่มความแข็งแรงของกล้ามเนื้อ ทำให้ร่างกายยืดหยุ่นคล่องตัว ทำให้ข้อเข่ามีความยืดหยุ่นแข็งแรง ทำให้ปอดและการหายใจมีประสิทธิภาพ อารมณ์ผ่อนคลายและหลับง่าย\nการนับก้าวผ่านสมาร์ทวอชเป็นวิธีง่าย ๆ และสะดวกสบายในการติดตามสุขภาพและปรับเปลี่ยนพฤติกรรมเพื่อให้มีสุขภาพที่ดีขึ้น ด้วยเทคโนโลยีที่ทันสมัย ทำให้การดูแลสุขภาพเป็นเรื่องง่าย สนุกสนาน และมีประสิทธิภาพมากขึ้น อย่ารอช้า มาเริ่มต้นนับก้าวเพื่อสุขภาพที่ดีกันเถอะ!",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  3,
		},
		{
			Title:              "𝟕 Days สร้างร่าง เตรียมภูมิสู้เบาหวาน",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2025/05/info907_exercise_7.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "🗓️ 7 Days สร้างร่าง เตรียมภูมิสู้เบาหวาน\n📑 จากสถิติการเพิ่มขึ้นของผู้ป่วยเบาหวานปี 67 ถึง 2.5 แสนคนเลยทีเดียว กรมอนามัย ขอแนะนำ กิจกรรมทางกายที่ดีทั้ง 7 วัน เพื่อเสริมภูมิคุ้มกันและปรับชีวิตสู้เบาหวาน ได้ลองนำไปเป็นแนวทางปรับใช้ในชีวิตประจำวันดูค่ะ\n‼️ สำคัญก่อนออกกำลังกาย อย่าลืมเช็คค่าระดับน้ำตาลในเลือด ควรอยู่ระหว่าง 100-250 มก./ดล. หรือ หากเกิน 250 มก./ดล. ไม่ควรออกกำลังกายค่ะ\n🔖 มาเริ่มกันจาก เตรียมอุ่นร่างกาย ด้วยการเดินเบา ๆ 5-10 นาที และยืดเหยียดกล้ามเนื้อแบบเคลื่อนไหว เน้นต้นขา หลัง สะโพก น่อง ไหล่ และหน้าอก\n💛 วันจันทร์ หรือ วันที่ 1 ออกกำลังกาย แบบแอโรบิก 30 นาที\n🩷 วันอังคาร หรือ วันที่ 2 ฝึกความแข็งแรงและฝึกการทรงตัว 30 นาที\n💚 วันพุธ หรือ วันที่ 3 ออกกำลังกาย แบบแอโรบิก 30 นาที\n🧡 วันพฤหัส หรือ วันที่ 4 ฝึกความยืดหยุ่น เพิ่มการคงพิสัยของข้อ (กระดูกนิ้ว, ข้อเท้า, บิดฝ่าเท้า) 30 นาที\n🩵 วันศุกร์ หรือ วันที่ 5 ออกกำลังกาย แบบแอโรบิก 30 นาที\n💜 วันเสาร์ หรือ วันที่ 6 ฝึกความแข็งแรงของกล้ามเนื้อ 30 นาที\n❤️ วันอาทิตย์ หรือ วันที่ 7 พักได้ 1 วัน\n👨‍⚕️❗ก่อนสิ้นสุดการออกกำลังกายในทุกวัน ควรยืดเหยียดกล้ามเนื้อแบบอยู่กับที่ 5-10 นาที\nเน้นฝึกความแข็งแรง เพิ่มมวลกล้ามเนื้อ เพื่อเพิ่มการเผาผลาญพลังงาน ทำให้ระดับน้ำตาลในเลือดลดลงได้\n🚶 ค่อย ๆ หมั่นทำทุกวัน แต่ต้องคำนึงถึงความปลอดภัย ไม่หักโหมจนเกินไปด้วยนะคะ กรมอนามัย เป็นกำลังใจให้กับผู้ป่วยโรคเบาหวาน เริ่มดูแลสุขภาพให้ร่างกายแข็งแรงไปด้วยกัน ผ่านการขยับกายดี กินเป็น ไม่ป่วย ค่ะ",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  3,
		},
		{
			Title:              "การบริหารกาย (Style) พระสงฆ์ (ฉบับหัวใจและหลอดเลือด)",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2024/10/info760_monk_10-724x1024.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "การบริหารกาย 💪 (Style) พระสงฆ์ (ฉบับหัวใจและหลอดเลือด) 🫀\n🔸 การบริหารกายของพระสงฆ์ เพื่อให้ร่างกายมีความแข็งแรงใน 3 ด้าน คือ\n1️⃣ เสริมสร้างความทนทานของระบบหัวใจและหลอดเลือด\n2️⃣ สร้างความแข็งแรงและทนทานของกล้ามเนื้อ\n3️⃣ สร้างความอ่อนตัวของกล้ามเนื้อและข้อต่อ\n🔸 ก่อนที่จะเริ่มบริหารกาย มาทำความเข้าใจถึงองค์ประกอบความแข็งแรงทั้ง 3 ด้านกันดีกว่าครับ โดยในวันนี้กรมอนามัยนำเสนอในหัวข้อแรกว่าด้วย ❝ การเสริมสร้างความทนทานของระบบหัวใจและหลอดเลือด ❞\n📑 ประโยชน์ที่ได้จากการบริหารกายประเภทนี้ คือ\n✨ กล้ามเนื้อหัวใจแข็งแรงขึ้น\n✨ อัตราการเต้นของชีพจรในขณะพักลดลง รวมทั้งอัตราการเต้นของชีพจรขณะบริหารกายช้าลง\n✨ การเพิ่มปริมาณเม็ดเลือดแดงและฮีโมโกลบิน\n✨ ช่วยลดไขมันในเส้นเลือด\n✨ เพิ่มประสิทธิภาพในการทำงานหัวใจขณะพัก\n✨ ควบคุมภาวะโรคเรื้อรังต่าง ๆ ไม่ให้รุนแรงขึ้น เช่น โรคความดันโลหิตสูง โรคเบาหวาน โรคหลอดเลือดหัวใจ ภาวะไขมันในเลือดสูง เป็นต้น\n✨ ช่วยให้ระบบของร่างกายต่าง ๆ ทำงานได้เป็นปกติ เช่น ระบบขับถ่าย ระบบหายใจ เป็นต้น\nถ้าในกิจวัตรประจำวันมีการใช้แรงในการทำงานน้อย ⁉️ สามารถบริหารกายเพื่อสร้างความทนทานของระบบหัวใจและหลอดเลือด โดยทำในช่วงเวลาว่าง ๆ ได้ดังนี้\n🔸 ท่าเริ่มต้น : ยืนหันหน้าเข้าบันได ถ้าเป็นพระสงฆ์สูงอายุควรจับราวบันไดไว้ หรือ เก้าอี้ตัวเล็ก หรือ กล่องไม้ที่แข็งแรง\n🔸 ท่าปฏิบัติ : จากนั้นให้ก้าวเท้าขวาขึ้นบันได หรือ กล่องไม้ แล้วตามด้วยก้าวเท้าซ้าย หลังจากนั้นถอยลงด้วยเท้าซ้ายแล้วตามด้วยเท้าขวา ทำไปเรื่อย ๆ ประมาณ 10-20 นาที ทำเพิ่มเวลาไปเรื่อย ๆ เท่าที่ทำได้จนรู้สึกเหนื่อย",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  3,
		},
		{
			Title:              "พรีลิมร่างกายแข็งแรงไปกับโอลิมปิก",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2024/09/info754_sport_2-640x900.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "พรีลิมร่างกาย 🚶‍♀️ แข็งแรงไปกับโอลิมปิก\n🔸 ในช่วงนี้ถือเป็นช่วงกลางซีซั่นของการแข่งขันกีฬาโอลิมปิก 2024 แล้ว บางคนที่ติดตามดูการแข่งขันกีฬาต่าง ๆ จนทำให้เกิดแรงบันดาลใจในกีฬานั้น ๆ กรมอนามัย เลยขอนำเสนอ ก้าวแรกของการออกกำลังกาย ว่า เตรียมตัวอย่างไร แบบไหนถึงปลอดภัย ให้แข็งแรงสมวัย ทำยังไงบ้างไปดูกัน\n❗ ก่อนอื่นเรามาดูข้อดีของการออกกำลังกายกันก่อน\n🔸 แน่นอนอยู่แล้วว่าได้ รูปร่างดูดี 🕺 กล้ามเนื้อแข็งแรง 💪 และช่วยลดน้ำหนัก 💃\n🔸 หัวใจแข็งแรงขึ้น 🫀 ลดโอกาสเกิดโรคเส้นเลือดหัวใจตีบ และกล้ามเนื้อหัวใจตาย\n🔸 เพิ่มภูมิต้านทาน และป้องกันโรคภัยต่าง ๆ เช่น โรคอ้วน โรคเบาหวาน โรคภูมิแพ้ 🤧 ฯลฯ\n🔸 ลดไขมันในเลือด เพิ่มไขมันดี ทำให้ลดคอเลสเตอรอล ไตรกลีเซอไรด์ LDL ลดลง\n🔸 ร่างกายสดชื่น ลดความเครียด ด้วยสารเอนดอร์ฟิน และ เมอร์ฟิน อีกทั้งยังช่วยให้นอนหลับสบายหลับสนิท\n❗ ต่อด้วยแนวทางการออกกำลังกายเพื่อสุขภาพ\n🔸 1. ผ่อนคลายตัวเอง ไม่เคร่งเครียด สนุกสนานเพลิดเพลินไปกับมัน\n🔸 2. ต้องใช้วิธีค่อยทำค่อยไป อย่าไปเร่งหรือรีบร้อน\n🔸 3. ต้องให้ทุกส่วนของร่างกายได้ออกกำลังกาย หรือ ขยับ\n🔸 4. การออกกำลังกายควรทำโดยสม่ำเสมอ อย่างน้อย 150 นาทีต่อสัปดาห์ หรือ วันละประมาณ 20-30 นาที 5 วันต่อสัปดาห์\n📑 ระยะการออกกำลังกายแบ่งเป็น 3 ระยะ คือ\n🔹 ระยะที่ 1 เรียกว่า ช่วงยืดเหยียดและอบอุ่นร่างกาย 5 – 10 นาที\n🔹 ระยะที่ 2 เรียกว่า ช่วงแอโรบิค 20 – 30 นาที (การออกกำลังกายที่ไม่รุนแรงอย่างต่อเนื่อง และ หนักพอ เช่น เดิน วิ่ง ว่ายน้ำ)\n🔹 ระยะที่ 3 ช่วงผ่อนคลาย 5 – 10 นาที\n📑 ได้รู้ถึงข้อดีของการออกำลังกาย การเตรียมตัวเอง และแนวทางระยะการออกกำลังกายกันไปแล้ว เหลือก็แค่เลือกเล่นกีฬาที่ตัวเอง หรือ เลือกจาก✨แรงบันดาลใจจากประเภทกีฬาโอลิมปิกที่เราดูก็ได้ ขอแค่มั่นทำเป็นประจำทุกวันจนเป็นนิสัย 👨‍🏫 ศึกษาข้อมูลการเล่นของกีฬาที่เราเลือกเพื่อความปลอดภัย เราก็จะได้ใช้เวลาว่างไปกับการออกกำลังกายพร้อมกับได้ทำสิ่งที่เราชอบควบคู่กันไป win win เลยใช่ไหมละคะ\n💝 สุดท้ายนี้ กรมอนามัย ขอเป็นกำลังใจให้กับทีมนักกีฬาตัวแทนประเทศไทย ที่เดินทางไปแข่งขันโอลิมปิกฤดูร้อน 2024 นี้ด้วยนะคะ",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  3,
		},
		{
			Title:              "การบริหารกาย (Style) พระสงฆ์ (ฉบับกล้ามเนื้อแข็งแรงทนทาน)",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2024/09/info731_monk_9_0-768x768.png",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "🔸 วันนี้เรายังอยู่กับการบริหารกายของพระสงฆ์ แต่ฉบับสุดท้ายแล้วนะครับ สำหรับองค์ประกอบการบริหารกายของพระสงฆ์ที่ว่าด้วย\n📑 “สร้างความอ่อนตัวของกล้ามเนื้อและข้อต่อ”\n📑 ประโยชน์ที่ได้จากการบริหารกายประเภทนี้ คือ\n✨ การเคลื่อนไหวของร่างกายในแต่ละอิริยาบถ มีความสะดวก คล่องตัว ใช้แรงน้อย\n✨ ช่วยกระตุ้นให้กล้ามเนื้อพร้อมที่จะออกกำลังกายหนัก ๆ ได้อย่างมีประสิทธิภาพมากขึ้น\n✨ ป้องกันและบรรเทา อาการปวดหลัง ปวดเข่า ปวดตามข้อ ข้อติด รวมทั้ง อาการยึดเกร็งของกล้ามเนื้อและอาการปวดเมื่อยตามส่วนต่าง ๆ ของร่างกาย\n✨ ช่วยให้การไหลเวียนเลือดไปเลี้ยงกล้ามเนื้อส่วนต่าง ๆ ของร่างกายดีขึ้น\n✨ ช่วยป้องกันการล้มในผู้สูงอายุ ซึ่งกล้ามเนื้อมักจะยืดและขาดความอ่อนตัว\n✨ ทำให้ร่างกายรู้สึกผ่อนคลาย ทั้งทางด้านร่างกาย และจิตใจมากยิ่งขึ้น\n📑 สามารถบริหารกายเพื่อสร้างความแข็งแรงและทนทานของกล้ามเนื้อ 4 ส่วน โดยทำในช่วงเวลาว่าง ๆ ได้ดังนี้\n🔶 บริหารกล้ามเนื้อคอ\n   🔸 การบริหารกล้ามเนื้อคอด้านหลัง\n   🔸 การบริหารกล้ามเนื้อคอด้านข้าง 1\n   🔸 การบริหารกล้ามเนื้อคอด้านข้าง 2\n🔶 บริหารกล้ามเนื้อไหล่\n   🔸 บริหารข้อไหล่และหลังแขน\n🔶 บริหารหัวไหล่\n🔶 บริหารกล้ามเนื้อลำตัว\n🔶 บริหารกล้ามเนื้อขา",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  3,
		},
		{
			Title:              "การดูแลสุขภาพตนเองของพระสงฆ์",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2024/05/info694_monk_6.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th",
			Description:        "พฤติกรรม ❝การดูแลสุขภาพตนเองของพระสงฆ์❞ 💪\n🔸 เนื่องในวันวิสาขบูชา เป็นวันคล้ายวันประสูติ ตรัสรู้ และปรินิพพาน ของ สมเด็จพระอรหันตสัมมาสัมพุทธเจ้า หรือ เจ้าชายสิทธัตถะ กรมอนามัยจึงขอถวาย ❝พฤติกรรมการดูแลสุขภาพตนเองของพระสงฆ์❞ ทุกรูป เพื่อเป็นแนวทางการดูแลร่างกายให้มีสุขอนามัยที่ดี\n🔶 พฤติกรรมการดูแลสุขภาพตนเองของพระสงฆ์ แบ่งออกเป็น 6 ดังนี้\n🔸 1. ควรแปรงฟัน 🪥 อย่างน้อยวันละ 2 ครั้ง เช้าและก่อนนอน หรือ ทุกครั้งหลังฉันอาหาร\n🔸 2. มีการจำวัด(นอนหลับ) 🛌 อย่างเพียงพอ 6-8 ชั่วโมง ต่อวัน เป็นประจำ 6-7 วันต่อสัปดาห์\n🔸 3. มีกิจกรรมทางกาย 🏃 (เช่น การเดิน/ บิณฑบาต/กวาดลานวัด/ ทำสวน ฯลฯ) อย่างน้อยวันละ 30 นาที ตั้งแต่ 5 วันต่อสัปดาห์\n🔸 4. ฉันน้ำเปล่า💧อย่างน้อยวันละ 8 แก้ว\n🔸 5. ควร ❝ลด/หลีกเลี่ยง❞ เครื่องดื่มชูกำลัง ชา กาแฟ ☕ น้ำอัดลม 🥤\n🔸 6. การฉันผัก 🥦 และผลไม้ 🍎 ได้วันละ 400 กรัม หรือ 5 กำมือเป็นประจำ (6-7 วันต่อสัปดาห์) หมายถึง ใน 1 วัน ฉันผัก 3 กำมือ และผลไม้ 2 กำมือ หรือ ฉันผัก 4 กำมือ และผลไม้ 1 กำมือ",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  3,
		},
		{
			Title:              "อาการของโรคไตที่พบบ่อย",
			PictureIn:          "",
			PictureOut:         "https://ckd.kku.ac.th/wp-content/uploads/2017/03/%E0%B9%81%E0%B8%9C%E0%B9%88%E0%B8%99%E0%B8%9E%E0%B8%B1%E0%B8%9AJAN19_%E0%B9%91%E0%B9%99%E0%B9%90%E0%B9%91%E0%B9%92%E0%B9%91_0020-724x1024.jpg",
			Link:               "https://ckd.kku.ac.th/?page_id=1023",
			Credit:             "https://ckd.kku.ac.th",
			Description:        "เนื่องจากภาพที่โชว์มีขนาดเล็กหากต้องการนำไปปริ้น กรุณาติดต่อเจ้าหน้าที่คุณพัลลภา ที่เบอร์ 094-5524563 เพื่อส่งไฟล์ต้นฉบับให้ท่านค่ะ",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  3,
		},
		{
			Title:              "ไตคืออะไร?",
			PictureIn:          "",
			PictureOut:         "https://ckd.kku.ac.th/wp-content/uploads/2017/03/%E0%B9%82%E0%B8%9B%E0%B8%AA%E0%B9%80%E0%B8%95%E0%B8%AD%E0%B8%A3%E0%B9%8CJAN19_%E0%B9%91%E0%B9%99%E0%B9%90%E0%B9%91%E0%B9%92%E0%B9%91_0017-724x1024.jpg",
			Link:               "https://ckd.kku.ac.th/?page_id=1024",
			Credit:             "https://ckd.kku.ac.th",
			Description:        "ความรู้ทั่วไปเกี่ยวกับไต_โปสเตอร์ *เนื่องจากภาพที่โชว์มีขนาดเล็กหากต้องการนำไปปริ้น กรุณาติดต่อเจ้าหน้าที่คุณพัลลภา ที่เบอร์ 094-5524563 เพื่อส่งไฟล์ต้นฉบับให้ท่านค่ะ",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  3,
		},
		{
			Title:              "สาเหตุโรคไตเรื้อรัง",
			PictureIn:          "",
			PictureOut:         "https://ckd.kku.ac.th/wp-content/uploads/2017/03/%E0%B9%82%E0%B8%9B%E0%B8%AA%E0%B9%80%E0%B8%95%E0%B8%AD%E0%B8%A3%E0%B9%8CJAN19_%E0%B9%91%E0%B9%99%E0%B9%90%E0%B9%91%E0%B9%92%E0%B9%91_0016_0-724x1024.jpg",
			Link:               "https://ckd.kku.ac.th/?page_id=1025",
			Credit:             "https://ckd.kku.ac.th",
			Description:        "ความรู้ทั่วไปเกี่ยวกับไต_โปสเตอร์ *เนื่องจากภาพที่โชว์มีขนาดเล็กหากต้องการนำไปปริ้น กรุณาติดต่อเจ้าหน้าที่คุณพัลลภา ที่เบอร์ 094-5524563 เพื่อส่งไฟล์ต้นฉบับให้ท่านค่ะ",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  3,
		},
		{
			Title:              "การป้องกันไม่ให้เป็นโรคไตเรื้อรัง",
			PictureIn:          "",
			PictureOut:         "https://ckd.kku.ac.th/wp-content/uploads/2017/03/%E0%B9%82%E0%B8%9B%E0%B8%AA%E0%B9%80%E0%B8%95%E0%B8%AD%E0%B8%A3%E0%B9%8CJAN19_%E0%B9%91%E0%B9%99%E0%B9%90%E0%B9%91%E0%B9%92%E0%B9%91_0014-724x1024.jpg",
			Link:               "https://ckd.kku.ac.th/?page_id=1026",
			Credit:             "https://ckd.kku.ac.th",
			Description:        "ความรู้ทั่วไปเกี่ยวกับไต_โปสเตอร์ *เนื่องจากภาพที่โชว์มีขนาดเล็กหากต้องการนำไปปริ้น กรุณาติดต่อเจ้าหน้าที่คุณพัลลภา ที่เบอร์ 094-5524563 เพื่อส่งไฟล์ต้นฉบับให้ท่านค่ะ",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  3,
		},
		{
			Title:              "การแบ่งระยะของโรคไตเรื้อรัง",
			PictureIn:          "",
			PictureOut:         "https://ckd.kku.ac.th/wp-content/uploads/2017/03/%E0%B9%82%E0%B8%9B%E0%B8%AA%E0%B9%80%E0%B8%95%E0%B8%AD%E0%B8%A3%E0%B9%8CJAN19_%E0%B9%91%E0%B9%99%E0%B9%90%E0%B9%91%E0%B9%92%E0%B9%91_0013-724x1024.jpg",
			Link:               "https://ckd.kku.ac.th/?page_id=1027",
			Credit:             "https://ckd.kku.ac.th",
			Description:        "ความรู้ทั่วไปเกี่ยวกับไต_โปสเตอร์ *เนื่องจากภาพที่โชว์มีขนาดเล็กหากต้องการนำไปปริ้น กรุณาติดต่อเจ้าหน้าที่คุณพัลลภา ที่เบอร์ 094-5524563 เพื่อส่งไฟล์ต้นฉบับให้ท่านค่ะ",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  3,
		},
		{
			Title:              "โรคไตเรื้อรัง ควรปฏิบัติ",
			PictureIn:          "",
			PictureOut:         "https://ckd.kku.ac.th/wp-content/uploads/2017/03/%E0%B9%82%E0%B8%9B%E0%B8%AA%E0%B9%80%E0%B8%95%E0%B8%AD%E0%B8%A3%E0%B9%8CJAN19_%E0%B9%91%E0%B9%99%E0%B9%90%E0%B9%91%E0%B9%92%E0%B9%91_0012-724x1024.jpg",
			Link:               "https://ckd.kku.ac.th/?page_id=1028",
			Credit:             "https://ckd.kku.ac.th",
			Description:        "ความรู้ทั่วไปเกี่ยวกับไต_โปสเตอร์ *เนื่องจากภาพที่โชว์มีขนาดเล็กหากต้องการนำไปปริ้น กรุณาติดต่อเจ้าหน้าที่คุณพัลลภา ที่เบอร์ 094-5524563 เพื่อส่งไฟล์ต้นฉบับให้ท่านค่ะ",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  3,
		},
		{
			Title:              "อาหารที่ควรหลีกเลี่ยงในผู้ป่วยโรคไตเรื้อรัง",
			PictureIn:          "",
			PictureOut:         "https://ckd.kku.ac.th/wp-content/uploads/2017/03/%E0%B9%82%E0%B8%9B%E0%B8%AA%E0%B9%80%E0%B8%95%E0%B8%AD%E0%B8%A3%E0%B9%8CJAN19_%E0%B9%91%E0%B9%99%E0%B9%90%E0%B9%91%E0%B9%92%E0%B9%91_0011-724x1024.jpg",
			Link:               "https://ckd.kku.ac.th/?page_id=1029",
			Credit:             "https://ckd.kku.ac.th",
			Description:        "ความรู้ทั่วไปเกี่ยวกับไต_โปสเตอร์ *เนื่องจากภาพที่โชว์มีขนาดเล็กหากต้องการนำไปปริ้น กรุณาติดต่อเจ้าหน้าที่คุณพัลลภา ที่เบอร์ 094-5524563 เพื่อส่งไฟล์ต้นฉบับให้ท่านค่ะ",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  3,
		},
		{
			Title:              "ความสำคัญของโซเดียม",
			PictureIn:          "",
			PictureOut:         "https://ckd.kku.ac.th/wp-content/uploads/2017/03/%E0%B9%82%E0%B8%9B%E0%B8%AA%E0%B9%80%E0%B8%95%E0%B8%AD%E0%B8%A3%E0%B9%8CJAN19_%E0%B9%91%E0%B9%99%E0%B9%90%E0%B9%91%E0%B9%92%E0%B9%91_0010-724x1024.jpg",
			Link:               "https://ckd.kku.ac.th/?page_id=1030",
			Credit:             "https://ckd.kku.ac.th",
			Description:        "ความรู้ทั่วไปเกี่ยวกับไต_โปสเตอร์ *เนื่องจากภาพที่โชว์มีขนาดเล็กหากต้องการนำไปปริ้น กรุณาติดต่อเจ้าหน้าที่คุณพัลลภา ที่เบอร์ 094-5524563 เพื่อส่งไฟล์ต้นฉบับให้ท่านค่ะ",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  3,
		},
		{
			Title:              "ถนอมรักษาไตด้วยอาหารโซเดียมน้อย",
			PictureIn:          "",
			PictureOut:         "https://ckd.kku.ac.th/wp-content/uploads/2017/03/%E0%B9%82%E0%B8%9B%E0%B8%AA%E0%B9%80%E0%B8%95%E0%B8%AD%E0%B8%A3%E0%B9%8CJAN19_%E0%B9%91%E0%B9%99%E0%B9%90%E0%B9%91%E0%B9%92%E0%B9%91_0009-724x1024.jpg",
			Link:               "https://ckd.kku.ac.th/?page_id=1031",
			Credit:             "https://ckd.kku.ac.th",
			Description:        "ความรู้ทั่วไปเกี่ยวกับไต_โปสเตอร์ *เนื่องจากภาพที่โชว์มีขนาดเล็กหากต้องการนำไปปริ้น กรุณาติดต่อเจ้าหน้าที่คุณพัลลภา ที่เบอร์ 094-5524563 เพื่อส่งไฟล์ต้นฉบับให้ท่านค่ะ",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  3,
		},
		{
			Title:              "ปริมาณโซเดียมในเมนูอาหาร",
			PictureIn:          "",
			PictureOut:         "https://ckd.kku.ac.th/wp-content/uploads/2017/03/%E0%B9%82%E0%B8%9B%E0%B8%AA%E0%B9%80%E0%B8%95%E0%B8%AD%E0%B8%A3%E0%B9%8CJAN19_%E0%B9%91%E0%B9%99%E0%B9%90%E0%B9%91%E0%B9%92%E0%B9%91_0008-724x1024.jpg",
			Link:               "https://ckd.kku.ac.th/?page_id=1032",
			Credit:             "https://ckd.kku.ac.th",
			Description:        "ความรู้ทั่วไปเกี่ยวกับไต_โปสเตอร์ *เนื่องจากภาพที่โชว์มีขนาดเล็กหากต้องการนำไปปริ้น กรุณาติดต่อเจ้าหน้าที่คุณพัลลภา ที่เบอร์ 094-5524563 เพื่อส่งไฟล์ต้นฉบับให้ท่านค่ะ",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  3,
		},
		{
			Title:              "ลดเค็มลดโรค",
			PictureIn:          "",
			PictureOut:         "https://ckd.kku.ac.th/wp-content/uploads/2017/03/%E0%B9%82%E0%B8%9B%E0%B8%AA%E0%B9%80%E0%B8%95%E0%B8%AD%E0%B8%A3%E0%B9%8CJAN19_%E0%B9%91%E0%B9%99%E0%B9%90%E0%B9%91%E0%B9%92%E0%B9%91_0007-724x1024.jpg",
			Link:               "https://ckd.kku.ac.th/?page_id=1033",
			Credit:             "https://ckd.kku.ac.th",
			Description:        "ความรู้ทั่วไปเกี่ยวกับไต_โปสเตอร์ *เนื่องจากภาพที่โชว์มีขนาดเล็กหากต้องการนำไปปริ้น กรุณาติดต่อเจ้าหน้าที่คุณพัลลภา ที่เบอร์ 094-5524563 เพื่อส่งไฟล์ต้นฉบับให้ท่านค่ะ",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  3,
		},
		{
			Title:              "การออกกำลังกายเพื่อสร้างเสริมสุขภาพ",
			PictureIn:          "",
			PictureOut:         "https://ckd.kku.ac.th/wp-content/uploads/2017/03/%E0%B9%82%E0%B8%9B%E0%B8%AA%E0%B9%80%E0%B8%95%E0%B8%AD%E0%B8%A3%E0%B9%8CJAN19_%E0%B9%91%E0%B9%99%E0%B9%90%E0%B9%91%E0%B9%92%E0%B9%91_0006-724x1024.jpg",
			Link:               "https://ckd.kku.ac.th/?page_id=1034",
			Credit:             "https://ckd.kku.ac.th",
			Description:        "ความรู้ทั่วไปเกี่ยวกับไต_โปสเตอร์ *เนื่องจากภาพที่โชว์มีขนาดเล็กหากต้องการนำไปปริ้น กรุณาติดต่อเจ้าหน้าที่คุณพัลลภา ที่เบอร์ 094-5524563 เพื่อส่งไฟล์ต้นฉบับให้ท่านค่ะ",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  3,
		},
		{
			Title:              "กินหวานอย่างไร ?",
			PictureIn:          "",
			PictureOut:         "https://ckd.kku.ac.th/wp-content/uploads/2017/03/%E0%B9%82%E0%B8%9B%E0%B8%AA%E0%B9%80%E0%B8%95%E0%B8%AD%E0%B8%A3%E0%B9%8CJAN19_%E0%B9%91%E0%B9%99%E0%B9%90%E0%B9%91%E0%B9%92%E0%B9%91_0004-724x1024.jpg",
			Link:               "https://ckd.kku.ac.th/?page_id=1035",
			Credit:             "https://ckd.kku.ac.th",
			Description:        "ความรู้ทั่วไปเกี่ยวกับไต_โปสเตอร์ *เนื่องจากภาพที่โชว์มีขนาดเล็กหากต้องการนำไปปริ้น กรุณาติดต่อเจ้าหน้าที่คุณพัลลภา ที่เบอร์ 094-5524563 เพื่อส่งไฟล์ต้นฉบับให้ท่านค่ะ",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  3,
		},
		{
			Title:              "6 วิธีที่ไตช่วยให้คุณมีสุขภาพดี",
			PictureIn:          "",
			PictureOut:         "https://ckd.kku.ac.th/wp-content/uploads/2017/03/%E0%B9%82%E0%B8%9B%E0%B8%AA%E0%B9%80%E0%B8%95%E0%B8%AD%E0%B8%A3%E0%B9%8CJAN19_%E0%B9%91%E0%B9%99%E0%B9%90%E0%B9%91%E0%B9%92%E0%B9%91_0001-724x1024.jpg",
			Link:               "https://ckd.kku.ac.th/?page_id=1036",
			Credit:             "https://ckd.kku.ac.th",
			Description:        "ความรู้ทั่วไปเกี่ยวกับไต_โปสเตอร์ *เนื่องจากภาพที่โชว์มีขนาดเล็กหากต้องการนำไปปริ้น กรุณาติดต่อเจ้าหน้าที่คุณพัลลภา ที่เบอร์ 094-5524563 เพื่อส่งไฟล์ต้นฉบับให้ท่านค่ะ",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  3,
		},
		{
			Title:              "ลัดคิวหมอ - #โรคไต สูงวัย ใส่ใจลดเสี่ยง 02/12/67 | by RAMA Channel",
			PictureIn:          "",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/elementor/thumbs/%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B9%84%E0%B8%95-%E0%B8%AA%E0%B8%B9%E0%B8%87%E0%B8%A7%E0%B8%B1%E0%B8%A2-%E0%B9%83%E0%B8%AA%E0%B9%88%E0%B9%83%E0%B8%88%E0%B8%A5%E0%B8%94%E0%B9%80%E0%B8%AA%E0%B8%B5%E0%B9%88%E0%B8%A2%E0%B8%87-r3bapdza911rr8mrwelmlauarz4dbj9eo35lspubxc.jpg",
			Link:               "https://www.youtube.com/embed/Hz9zKppmXpY?si=r5K72n-JzSdIgbWB",
			Credit:             "https://www.rama.mahidol.ac.th/ramachannel",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  2,
		},
		{
			Title:              "ลัดคิวหมอ - ข้อควรรู้ของยากับผู้ป่วยโรคไต 18/01/67 | by RAMA Channel",
			PictureIn:          "",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/elementor/thumbs/0online_%E0%B8%A5%E0%B8%B1%E0%B8%94%E0%B8%84%E0%B8%B4%E0%B8%A7%E0%B8%AB%E0%B8%A1%E0%B8%AD%E0%B8%A3%E0%B8%B2%E0%B8%A1%E0%B8%B2%E0%B8%AF672-r3baoe9f1bovi22noz5syjus7c0f71blv6d5k7bahs.jpg",
			Link:               "https://www.youtube.com/embed/6677H8Xqd-8?si=4W4LIaBtQzJmqYAT",
			Credit:             "https://www.rama.mahidol.ac.th/ramachannel",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  2,
		},
		{
			Title:              "อาการแบบนี้ เสี่ยง ! เป็นโรคไต",
			PictureIn:          "",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/elementor/thumbs/235_%E0%B8%AD%E0%B8%B2%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B9%81%E0%B8%9A%E0%B8%9A%E0%B8%99%E0%B8%B5%E0%B9%89%E0%B9%80%E0%B8%AA%E0%B8%B5%E0%B9%88%E0%B8%A2%E0%B8%87%E0%B9%80%E0%B8%9B%E0%B9%87%E0%B8%99%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B9%84%E0%B8%95_1920x1080_2-r3banl4f5gkzi58zf4kdb97hse01kf3xf653omihuo.jpg",
			Link:               "https://www.youtube.com/embed/1-SdL65QFXw?si=yTExF2HMBHFP4xWj",
			Credit:             "https://www.rama.mahidol.ac.th/ramachannel",
			Description:        "“โรคไต” โรคที่น่ากังวล แล้วอาการแบบไหนเป็นสัญญาณเตือนให้ร่างกายรู้ว่า โรคไตกำลังจะมาเยือนบ้าง ?\n👉 ไต มีความสำคัญต่อร่างกายอย่างไร ?\n👉 อาการแบบไหนที่บ่งบอกว่าไตเริ่มมีปัญหา\n👉 พฤติกรรมที่ส่งผลเสียต่อไต\n👉 วิธีการป้องกัน",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  2,
		},
		{
			Title:              "โรคไตเรื้อรังลดเค็มให้ไว ก่อนโรคไตจะมาเยือน 15/09/66 พบหมอรามาฯ | by RAMA Channel",
			PictureIn:          "",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/elementor/thumbs/cover_%E0%B8%9E%E0%B8%9A%E0%B8%AB%E0%B8%A1%E0%B8%AD_1920x1080-new-1-r3bakl0zbih0ezlzybu9uihhh2stz86sob49hsyrq8.jpg",
			Link:               "https://www.youtube.com/embed/FK6ublluwak?si=DDLgtFqrJdtTrvXD",
			Credit:             "https://www.rama.mahidol.ac.th/ramachannel",
			Description:        "โรคไตเรื้อรัง ลดเค็มให้ไว ก่อนโรคไตจะมาเยือน",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  2,
		},
		{
			Title:              "EP.10 ภารกิจพิชิตโรคไตเรื้อรัง - Eat To Goal",
			PictureIn:          "",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/elementor/thumbs/%E0%B8%9B%E0%B8%81_EP10_%E0%B8%A0%E0%B8%B2%E0%B8%A3%E0%B8%81%E0%B8%B4%E0%B8%88%E0%B8%9E%E0%B8%B4%E0%B8%8A%E0%B8%B4%E0%B8%95%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B9%84%E0%B8%95%E0%B9%80%E0%B8%A3%E0%B8%B7%E0%B9%89%E0%B8%AD%E0%B8%A3%E0%B8%B1%E0%B8%87-B3-r3balyufdqd7iblmvfdi0nwwyhzab6okj5ozxgwwkg.jpg",
			Link:               "https://www.youtube.com/embed/Q30Q-B13clM?si=0rXUIjNWOXQSUIeH",
			Credit:             "https://www.rama.mahidol.ac.th/ramachannel",
			Description:        "สัปดาห์นี้พาไปทำเมนูพิชิตโรคไตเรื้อรัง มาดูกันว่าจะเป็นเมนูอะไรพร้อมกับคำแนะนำดีจากทางแพทย์ ติดตามได้ในรายการ Eat to goal กินถูกลดโรค",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  2,
		},
		{
			Title:              "Health Hack EP27 โรคไต โรคหัวใจ กินกล้วย อันตรายถึงชีวิตจริงไหม",
			PictureIn:          "",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/elementor/thumbs/EP27_Thumbnail-r3bauy6woqnug6jyfb55uebhb1pjv2c8fm410nlh40.png",
			Link:               "https://www.youtube.com/embed/1Y9-Cf73GaI?si=8uCgOQCpfDz49ZcN",
			Credit:             "https://www.rama.mahidol.ac.th/ramachannel",
			Description:        "โรคไต โรคหัวใจ กินกล้วย อันตรายถึงชีวิตจริงไหม ?\n✅ กล้วย ห้ามป้อนเด็กอายุต่ำกว่า 6 เดือน\n✅ กล้วย กินแทนข้าว กินเท่าไรก็ได้\n✅ กล้วย ผู้ป่วยโรคไต โรคหัวใจ ห้ามกิน",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  2,
		},
		{
			Title:              "RAMA Square - โภชนาการอาหารโรคไต 7/01/63 l RAMA CHANNEL",
			PictureIn:          "",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/elementor/thumbs/1-1-1-r3batupopp5swk5atu2txoa4cv44vrzia6pmv180dc.jpg",
			Link:               "https://www.youtube.com/embed/fPGPw7vv5tg?si=TV0GexvozK0U49QN",
			Credit:             "https://www.rama.mahidol.ac.th/ramachannel",
			Description:        "You are what you eat : โภชนาการอาหารโรคไต",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  2,
		},
		{
			Title:              "โรคไต : Three Minutes Talk",
			PictureIn:          "",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/elementor/thumbs/06-r3bb47vm2xcmxr39atdpxk446u0urm4y1hpedvupr4.png",
			Link:               "https://www.youtube.com/embed/QolUExC1H1E?si=hmsBH8mSYR8Yy_56",
			Credit:             "https://www.rama.mahidol.ac.th/ramachannel",
			Description:        "โรคไต : รายการ Three Minutes Talk ep. 6 – ผศ. นพ.สุรศักดิ์ กันตชูเวสศิริ สาขาวิชาโรคไต ภาควิชาอายุรศาสตร์ คณะแพทยศาสตร์โรงพยาบาลรามาธิบดี มหาวิทยาลัยมหิดล",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  2,
		},
		{
			Title:              "“โรคไตในผู้หญิง” ปัญหาสุขภาพที่ต้องให้ความสำคัญ : Rama Square ช่วง Better To Know 21 มี.ค.61 (2/3)",
			PictureIn:          "",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/elementor/thumbs/Screenshot_500-r3bas5m6dgu5xwm1qlo2xlp5qth9zg8ydsb2o1qlls.png",
			Link:               "https://www.youtube.com/embed/o2r61B6ijEw?si=chbtNtGE-l2edjj5",
			Credit:             "https://www.rama.mahidol.ac.th/ramachannel",
			Description:        "Better To Know “โรคไตในผู้หญิง” อีกหนึ่งปัญหาสุขภาพของผู้หญิงที่ต้องให้ความสำคัญ\nออกอากาศวันที่ 21 มีนาคม พ.ศ. 2561",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  2,
		},
		{
			Title:              "Meet The Expert ปัญหาโรคไตในเด็ก 14 ส.ค.60 (4/6)",
			PictureIn:          "",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/elementor/thumbs/%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B9%84%E0%B8%95%E0%B9%83%E0%B8%99%E0%B9%80%E0%B8%94%E0%B9%87%E0%B8%81-r3bb86r2xqs7yhbq4j50gk26hegn9lw594v7bxyvhc.png",
			Link:               "https://www.youtube.com/embed/j2uWxVrr09E?si=lVAD0XiwamOQRM64",
			Credit:             "https://www.rama.mahidol.ac.th/ramachannel",
			Description:        "พบหมอรามา ช่วง Meet The Expert ปัญหาโรคไตในเด็ก โดย รศ.พญ.กาญจนา ตั้งนรารัชชกิจ สาขาวิชาโรคไต ภาควิชากุมารเวชศาสตร์",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  2,
		},
		{
			Title:              "พฤติกรรมการทานอาหารที่ส่งผลต่อโรคไต",
			PictureIn:          "",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/2018/01/%E0%B8%9A%E0%B8%97%E0%B8%84%E0%B8%A7%E0%B8%B2%E0%B8%A1-%E0%B8%81.%E0%B8%9E._%E0%B9%91%E0%B9%98%E0%B9%90%E0%B9%91%E0%B9%92%E0%B9%95_0003.jpg",
			Link:               "",
			Credit:             "https://www.rama.mahidol.ac.th/ramachannel",
			Description:        "โรคไตเป็นโรคที่มีสาเหตุหลักมาจากการทานอาหาร โดยเฉพาะอาหารที่มีรสเค็ม ดังนั้นถ้าหากต้องการป้องกันโรคไตควรเริ่มต้นจากการปรับพฤติกรรมการทานอาหารก่อนเป็นอันดับแรก คนไทยนิยมทานรสเค็มมากกว่าความต้องการของร่างกาย 2-3 เท่า ซึ่งนำไปสู่โรคความดัน โรคหัวใจ และโรคไต",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  1,
		},
		{
			Title:              "โรคไตในเด็ก รุนแรงแค่ไหนกัน",
			PictureIn:          "",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/2018/01/%E0%B8%9A%E0%B8%97%E0%B8%84%E0%B8%A7%E0%B8%B2%E0%B8%A1%E0%B8%A3%E0%B8%B2%E0%B8%A1%E0%B8%B2-%E0%B8%A1.%E0%B8%84._%E0%B9%91%E0%B9%98%E0%B9%90%E0%B9%91%E0%B9%91%E0%B9%95_0005.jpg",
			Link:               "",
			Credit:             "https://www.rama.mahidol.ac.th/ramachannel",
			Description:        "โรคไตในเด็กมีความสำคัญไม่น้อยไปกว่าโรคไตในวัยอื่น ๆ ซึ่งผู้ปกครองควรเฝ้าสังเกตอาการ เพราะโรคไตสามารถรักษาให้หายขาดได้ในกรณีที่ยังไม่รุนแรง แต่หากถึงขั้นเรื้อรังจะรักษาได้ยากและอาจไม่หายขาด",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  1,
		},
		{
			Title:              "ลดหวาน มัน เค็ม เลี่ยงโรคไตในเด็ก",
			PictureIn:          "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/2016/08/%E0%B8%A5%E0%B8%94%E0%B8%AB%E0%B8%A7%E0%B8%B2%E0%B8%99-%E0%B8%A1%E0%B8%B1%E0%B8%99-%E0%B9%80%E0%B8%84%E0%B9%87%E0%B8%A1%E0%B9%80%E0%B8%A5%E0%B8%B5%E0%B9%88%E0%B8%A2%E0%B8%87%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B9%84%E0%B8%95%E0%B9%83%E0%B8%99%E0%B9%80%E0%B8%94%E0%B9%87%E0%B8%81.jpg",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/2016/08/%E0%B8%A5%E0%B8%94%E0%B8%AB%E0%B8%A7%E0%B8%B2%E0%B8%99-%E0%B8%A1%E0%B8%B1%E0%B8%99-%E0%B9%80%E0%B8%84%E0%B9%87%E0%B8%A1%E0%B9%80%E0%B8%A5%E0%B8%B5%E0%B9%88%E0%B8%A2%E0%B8%87%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B9%84%E0%B8%95%E0%B9%83%E0%B8%99%E0%B9%80%E0%B8%94%E0%B9%87%E0%B8%81-1024x1024.jpg",
			Link:               "",
			Credit:             "https://www.rama.mahidol.ac.th/ramachannel",
			Description:        "เด็กก็มีความเสี่ยงต่อโรคไตจากการกินหวาน มัน เค็ม และอาหารฟาสต์ฟู้ด ผศ.นพ.ขวัญชัย ไพโรจน์สกุล ระบุว่า โรคไตในเด็กอาจเกิดจากไตผิดปกติตั้งแต่กำเนิด การอุดกั้นทางเดินปัสสาวะ หรือไตอักเสบจากภูมิคุ้มกัน",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  1,
		},
		{
			Title:              "มวลกล้ามเนื้อน้อย ร่างกายกำลังขาดโปรตีน",
			PictureIn:          "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/2025/01/%E0%B8%9A%E0%B8%97%E0%B8%84%E0%B8%A7%E0%B8%B2%E0%B8%A1-%E0%B8%A1%E0%B8%A7%E0%B8%A5%E0%B8%81%E0%B8%A5%E0%B9%89%E0%B8%B2%E0%B8%A1%E0%B9%80%E0%B8%99%E0%B8%B7%E0%B9%89%E0%B8%AD%E0%B8%99%E0%B9%89%E0%B8%AD%E0%B8%A2%E0%B9%83%E0%B8%99%E0%B8%9C%E0%B8%B9%E0%B9%89%E0%B8%AA%E0%B8%B9%E0%B8%87%E0%B8%AD%E0%B8%B2%E0%B8%A2%E0%B8%B8-1536x960.jpg",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/2025/01/%E0%B8%9A%E0%B8%97%E0%B8%84%E0%B8%A7%E0%B8%B2%E0%B8%A1-%E0%B8%A1%E0%B8%A7%E0%B8%A5%E0%B8%81%E0%B8%A5%E0%B9%89%E0%B8%B2%E0%B8%A1%E0%B9%80%E0%B8%99%E0%B8%B7%E0%B9%89%E0%B8%AD%E0%B8%99%E0%B9%89%E0%B8%AD%E0%B8%A2%E0%B9%83%E0%B8%99%E0%B8%9C%E0%B8%B9%E0%B9%89%E0%B8%AA%E0%B8%B9%E0%B8%87%E0%B8%AD%E0%B8%B2%E0%B8%A2%E0%B8%B8-1024x640.jpg",
			Link:               "",
			Credit:             "https://www.rama.mahidol.ac.th/ramachannel",
			Description:        "ภาวะมวลกล้ามเนื้อน้อย พบได้ในผู้สูงอายุ กล้ามเนื้อจะสูญเสียเมื่ออายุมากขึ้น ผู้ที่มีภาวะนี้ต้องการโปรตีนเพิ่มขึ้น 20% จากปกติ เพื่อคงสมดุลของมวลกล้ามเนื้อและความแข็งแรง",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  1,
		},
		{
			Title:              "เช็กด่วน! อาการไตวายเรื้อรังระยะสุดท้าย",
			PictureIn:          "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/2025/02/%E0%B9%80%E0%B8%8A%E0%B9%87%E0%B8%81%E0%B8%94%E0%B9%88%E0%B8%A7%E0%B8%99-%E0%B8%AD%E0%B8%B2%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B9%84%E0%B8%95%E0%B8%A7%E0%B8%B2%E0%B8%A2%E0%B9%80%E0%B8%A3%E0%B8%B7%E0%B9%89%E0%B8%AD%E0%B8%A3%E0%B8%B1%E0%B8%87-%E0%B8%A3%E0%B8%B0%E0%B8%A2%E0%B8%B0%E0%B8%AA%E0%B8%B8%E0%B8%94%E0%B8%97%E0%B9%89%E0%B8%B2%E0%B8%A2.jpg.webp",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/2025/02/%E0%B9%80%E0%B8%8A%E0%B9%87%E0%B8%81%E0%B8%94%E0%B9%88%E0%B8%A7%E0%B8%99-%E0%B8%AD%E0%B8%B2%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B9%84%E0%B8%95%E0%B8%A7%E0%B8%B2%E0%B8%A2%E0%B9%80%E0%B8%A3%E0%B8%B7%E0%B9%89%E0%B8%AD%E0%B8%A3%E0%B8%B1%E0%B8%87-%E0%B8%A3%E0%B8%B0%E0%B8%A2%E0%B8%B0%E0%B8%AA%E0%B8%B8%E0%B8%94%E0%B8%97%E0%B9%89%E0%B8%B2%E0%B8%A2-1024x597.jpg",
			Link:               "",
			Credit:             "https://www.rama.mahidol.ac.th/ramachannel",
			Description:        "ภาวะไตวายเรื้อรังระยะสุดท้ายเกิดจากการเสื่อมของไตสะสม ผู้ป่วยจำเป็นต้องได้รับการรักษา เช่น ฟอกเลือด ล้างไต หรือปลูกถ่ายไต เพื่อประคองชีวิตและบรรเทาอาการ",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  1,
		},
		{
			Title:              "ปวดหลัง สัญญาณโรคที่ไม่ควรมองข้าม",
			PictureIn:          "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/2024/10/%E0%B8%9B%E0%B8%A7%E0%B8%94%E0%B8%AB%E0%B8%A5%E0%B8%B1%E0%B8%87-%E0%B8%AA%E0%B8%B1%E0%B8%8D%E0%B8%8D%E0%B8%B2%E0%B8%93%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B9%84%E0%B8%A1%E0%B9%88%E0%B8%84%E0%B8%A7%E0%B8%A3%E0%B8%A1%E0%B8%AD%E0%B8%87%E0%B8%82%E0%B9%89%E0%B8%B2%E0%B8%A1.jpg",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/2024/10/%E0%B8%9B%E0%B8%A7%E0%B8%94%E0%B8%AB%E0%B8%A5%E0%B8%B1%E0%B8%87-%E0%B8%AA%E0%B8%B1%E0%B8%8D%E0%B8%8D%E0%B8%B2%E0%B8%93%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B9%84%E0%B8%A1%E0%B9%88%E0%B8%84%E0%B8%A7%E0%B8%A3%E0%B8%A1%E0%B8%AD%E0%B8%87%E0%B8%82%E0%B9%89%E0%B8%B2%E0%B8%A1.jpg",
			Link:               "",
			Credit:             "https://www.rama.mahidol.ac.th/ramachannel",
			Description:        "อาการปวดหลังพบได้ในทุกวัย บางรายหายเองได้ แต่หากปวดรุนแรงต่อเนื่องควรปรึกษาแพทย์เพื่อหาสาเหตุและรับการรักษาที่ถูกต้อง",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  1,
		},
		{
			Title:              "แขนขาชาโดยไม่มีสาเหตุ สัญญาณเตือน... #โรคเบาหวาน",
			PictureIn:          "",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/elementor/thumbs/202412-03thumbnail_-r3bbaqv9jiabk9lx6myg8wtcp5um7y1u9sssd26ajk.png",
			Link:               "https://www.youtube.com/embed/_liemHN-V7g?si=Fua9ssXwUNmIVvWa",
			Credit:             "https://www.rama.mahidol.ac.th/ramachannel",
			Description:        "😨 อย่ามองข้าม! #อาการชาปลายมือปลายเท้า อาจเสี่ยงเส้นประสาทเสื่อมจากเบาหวานได้! 🚨 📌 ดูแล้วรีบเช็กตัวเองก่อนอาการลุกลาม!",
			AdminID:            2,
			EducationalGroupID: 2,
			ContentCategoryID:  2,
		},
		{
			Title:              "ลัดคิวหมอ - #ผู้ป่วยโรคเบาหวานเรื้อรัง กับ โภชนาการที่สมดุล 02/01/68 | by RAMA Channel",
			PictureIn:          "",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/elementor/thumbs/%E0%B8%9C%E0%B8%B9%E0%B9%89%E0%B8%9B%E0%B9%88%E0%B8%A7%E0%B8%A2%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B9%80%E0%B8%9A%E0%B8%B2%E0%B8%AB%E0%B8%A7%E0%B8%B2%E0%B8%99%E0%B9%80%E0%B8%A3%E0%B8%B7%E0%B9%89%E0%B8%AD%E0%B8%A3%E0%B8%B1%E0%B8%87-%E0%B8%81%E0%B8%B1%E0%B8%9A%E0%B9%82%E0%B8%A0%E0%B8%8A%E0%B8%99%E0%B8%B2%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%AA%E0%B8%A1%E0%B8%94%E0%B8%B8%E0%B8%A5-r3bbajck0u00zdwuejpfoypny2void7zkrkwiuhfxc.jpg",
			Link:               "https://www.youtube.com/embed/cjkefJVcoEM?si=fyZlUn_EZGPlNcYX",
			Credit:             "https://www.rama.mahidol.ac.th/ramachannel",
			Description:        "#ผู้ป่วยโรคเบาหวานเรื้อรัง กับ โภชนาการที่สมดุล (Q/A พฤหัสบดี 2 ม.ค. 68)\n1. ผศ. พญ.จิราภรณ์ อรุณากูร สาขาวิชาเวชศาสตร์ผู้ป่วยนอกเด็กและวัยรุ่น ภาควิชากุมารเวชศาสตร์\n2. รศ. นพ.กุลพงษ์ ชัยนาม โภชนาวิทยาคลินิก สถาบันการแพทย์จักรีนฤบดินทร์",
			AdminID:            2,
			EducationalGroupID: 2,
			ContentCategoryID:  2,
		},
		{
			Title:              "ลัดคิวหมอ - เรียนรู้วิธีดูแลเท้าผู้ป่วยโรคเบาหวานอย่างถูกวิธี 16/01/67 | by RAMA Channel",
			PictureIn:          "",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/elementor/thumbs/0online_%E0%B8%A5%E0%B8%B1%E0%B8%94%E0%B8%84%E0%B8%B4%E0%B8%A7%E0%B8%AB%E0%B8%A1%E0%B8%AD%E0%B8%A3%E0%B8%B2%E0%B8%A1%E0%B8%B2%E0%B8%AF67-5-r3baoe9f1bovi22noz5syjus7c0f71blv6d5k7bahs.jpg",
			Link:               "https://www.youtube.com/embed/SBWEkrrUmP4?si=j2oxEPeckp0bzX-r",
			Credit:             "https://www.rama.mahidol.ac.th/ramachannel",
			Description:        "เรียนรู้วิธีดูแลเท้าผู้ป่วยโรคเบาหวานอย่างถูกวิธี (O/A อังคาร 16 ม.ค. 67)\n1. อ. พญ.อัญญพร สุทัศน์วรวุฒิ ภาควิชาเวชศาสตร์ครอบครัว\n2. อ. พญ.ทรงสุดา รุ่งใสวัฒนา ภาควิชาเวชศาสตร์ฟื้นฟู",
			AdminID:            2,
			EducationalGroupID: 2,
			ContentCategoryID:  2,
		},
		{
			Title:              "EP.15 ภารกิจพิชิตโรคเบาหวาน - Eat To Goal",
			PictureIn:          "",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/elementor/thumbs/%E0%B8%9B%E0%B8%81_EP15_%E0%B8%A0%E0%B8%B2%E0%B8%A3%E0%B8%81%E0%B8%B4%E0%B8%88%E0%B8%9E%E0%B8%B4%E0%B8%8A%E0%B8%B4%E0%B8%95%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B9%80%E0%B8%9A%E0%B8%B2%E0%B8%AB%E0%B8%A7%E0%B8%B2%E0%B8%99-B3-r3ballooq1v6zs4r09oq1r8gn3s5bf8btck77lgezk.jpg",
			Link:               "https://www.youtube.com/embed/96895Fckpjk?si=pjJ1_zraA3IB1I9E",
			Credit:             "https://www.rama.mahidol.ac.th/ramachannel",
			Description:        "สัปดาห์นี้พาไปทำเมนูรับมือกับคนที่เป็นโรคเบาหวาน โรคยอดฮิตของคนไทย มาดูกันว่าจะเป็นเมนูอะไรพร้อมกับคำแนะนำดีจากทางแพทย์ติดตามได้ในรายการ Eat to goal กินถูกลดโรค",
			AdminID:            2,
			EducationalGroupID: 2,
			ContentCategoryID:  2,
		},
		{
			Title:              "ลัดคิวหมอ - ฟื้นฟูเท้าผู้ป่วยโรคเบาหวาน 19/06/66 | by RAMA Channel",
			PictureIn:          "",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/elementor/thumbs/online_%E0%B8%A5%E0%B8%B1%E0%B8%94%E0%B8%84%E0%B8%B4%E0%B8%A7%E0%B8%AB%E0%B8%A1%E0%B8%AD%E0%B8%A3%E0%B8%B2%E0%B8%A1%E0%B8%B2%E0%B8%AF_V4-01-r3bakvd7eov5yp6z9yb63xvk0bdvbwbudqalrujfts.jpg",
			Link:               "https://www.youtube.com/embed/Mo44hIe73WA?si=DImkD8nh9xAMJvKL",
			Credit:             "https://www.rama.mahidol.ac.th/ramachannel",
			Description:        "",
			AdminID:            2,
			EducationalGroupID: 2,
			ContentCategoryID:  2,
		},
		{
			Title:              "ใครบ้าง ? เสี่ยงเป็นโรคเบาหวาน",
			PictureIn:          "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/2024/10/%E0%B8%9A%E0%B8%97%E0%B8%84%E0%B8%A7%E0%B8%B2%E0%B8%A1-EP5-%E0%B9%83%E0%B8%84%E0%B8%A3%E0%B9%80%E0%B8%AA%E0%B8%B5%E0%B9%88%E0%B8%A2%E0%B8%87%E0%B9%80%E0%B8%9B%E0%B9%87%E0%B8%99%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B9%80%E0%B8%9A%E0%B8%B2%E0%B8%AB%E0%B8%A7%E0%B8%B2%E0%B8%99%E0%B8%9A%E0%B9%89%E0%B8%B2%E0%B8%87.jpg",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/2024/10/%E0%B8%9A%E0%B8%97%E0%B8%84%E0%B8%A7%E0%B8%B2%E0%B8%A1-EP5-%E0%B9%83%E0%B8%84%E0%B8%A3%E0%B9%80%E0%B8%AA%E0%B8%B5%E0%B9%88%E0%B8%A2%E0%B8%87%E0%B9%80%E0%B8%9B%E0%B9%87%E0%B8%99%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B9%80%E0%B8%9A%E0%B8%B2%E0%B8%AB%E0%B8%A7%E0%B8%B2%E0%B8%99%E0%B8%9A%E0%B9%89%E0%B8%B2%E0%B8%87-1024x640.jpg",
			Link:               "",
			Credit:             "https://www.rama.mahidol.ac.th/ramachannel",
			Description:        "บาหวาน คืออะไร\nเบาหวาน คือ โรคที่เกิดจากตับอ่อนสร้างฮอร์โมนอินซูลินไม่เพียงพอ การขาดอินซูลินหรืออินซูลินทำงานไม่ปกติจะทำให้การควบคุมระดับน้ำตาลในเลือดได้ไม่ดี ส่งผลให้ระดับน้ำตาลในเลือดสูงขึ้น\n\nอาการของโรคเบาหวานมีลักษณะอย่างไร\nหิวน้ำบ่อยมากขึ้น ปัสสาวะบ่อยขึ้น โดยเฉพาะปัสสาวะเวลากลางคืน น้ำหนักตัวลดลง โดยไม่ทราบสาเหตุ มีอาการมือ เท้าชา อ่อนเพลียง่าย สายตาพร่ามัว เวลามีแผล แผลมักหายช้า",
			AdminID:            2,
			EducationalGroupID: 2,
			ContentCategoryID:  1,
		},
		{
			Title:              "รู้จักกับภาวะไตเสื่อมในโรคเบาหวาน",
			PictureIn:          "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/2024/11/%E0%B8%9A%E0%B8%97%E0%B8%84%E0%B8%A7%E0%B8%B2%E0%B8%A1-EP4-%E0%B8%A0%E0%B8%B2%E0%B8%A7%E0%B8%B0%E0%B9%84%E0%B8%95%E0%B9%80%E0%B8%AA%E0%B8%B7%E0%B9%88%E0%B8%AD%E0%B8%A1%E0%B9%83%E0%B8%99%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B9%80%E0%B8%9A%E0%B8%B2%E0%B8%AB%E0%B8%A7%E0%B8%B2%E0%B8%99.jpg",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/2024/11/%E0%B8%9A%E0%B8%97%E0%B8%84%E0%B8%A7%E0%B8%B2%E0%B8%A1-EP4-%E0%B8%A0%E0%B8%B2%E0%B8%A7%E0%B8%B0%E0%B9%84%E0%B8%95%E0%B9%80%E0%B8%AA%E0%B8%B7%E0%B9%88%E0%B8%AD%E0%B8%A1%E0%B9%83%E0%B8%99%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B9%80%E0%B8%9A%E0%B8%B2%E0%B8%AB%E0%B8%A7%E0%B8%B2%E0%B8%99.jpg",
			Link:               "",
			Credit:             "https://www.rama.mahidol.ac.th/ramachannel",
			Description:        "เบาหวานทำให้ไตเสื่อมจริงหรือไม่\nผู้ที่เป็นเบาหวานจะมีโอกาสเกิดไตเสื่อมมากกว่าผู้ที่ไม่เป็นเบาหวาน เพราะเมื่อเป็นโรคเบาหวานจะมีน้ำตาลในเลือดสูง ส่งผลให้ระบบอวัยวะในร่างกายถูกทำลาย รวมถึงทำให้เส้นเลือดต่าง ๆ ในร่างกายถูกทำลายไปด้วย เช่น เส้นเลือดที่ไปเลี้ยงไต หากเกิดความเสื่อมหรือถูกทำลาย ก็จะทำให้เกิดไตเสื่อมได้\n\nอาการ ภาวะไตเสื่อม ในโรคเบาหวานเป็นอย่างไร\nภาวะไตเสื่อมในโรคเบาหวานช่วงแรก จะไม่แสดงอาการ ต้องตรวจเลือดเพื่อประเมินการทำงานของไต และตรวจปัสสาวะ หากในปัสสาวะพบโปรตีนรั่ว ปัสสาวะเป็นฟอง หรือปัสสาวะน้อยลง แสดงถึงความสามารถในการกรองเอาของเสียออกจากร่างกายลดลง เข้าสู่ภาวะไตถูกทำลาย\nในบางรายอาจมีอาการบวมที่ขา และอันตรายที่สุดของภาวะไตเสื่อมในโรคเบาหวาน คือ ไตวาย",
			AdminID:            2,
			EducationalGroupID: 2,
			ContentCategoryID:  1,
		},
		{
			Title:              "โรคเบาหวาน น้ำตาลในเลือดสูง ร้ายแรงกว่าที่คิด",
			PictureIn:          "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/2024/11/%E0%B8%99%E0%B9%89%E0%B8%B3%E0%B8%95%E0%B8%B2%E0%B8%A5%E0%B9%83%E0%B8%99%E0%B9%80%E0%B8%A5%E0%B8%B7%E0%B8%AD%E0%B8%94%E0%B8%AA%E0%B8%B9%E0%B8%87%E0%B9%80%E0%B8%87%E0%B8%B5%E0%B8%A2%E0%B8%9A-%E0%B9%86-%E0%B9%81%E0%B8%95%E0%B9%88%E0%B8%A3%E0%B9%89%E0%B8%B2%E0%B8%A2%E0%B9%81%E0%B8%A3%E0%B8%87%E0%B8%81%E0%B8%A7%E0%B9%88%E0%B8%B2%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%84%E0%B8%B4%E0%B8%94.png",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/2024/11/%E0%B8%99%E0%B9%89%E0%B8%B3%E0%B8%95%E0%B8%B2%E0%B8%A5%E0%B9%83%E0%B8%99%E0%B9%80%E0%B8%A5%E0%B8%B7%E0%B8%AD%E0%B8%94%E0%B8%AA%E0%B8%B9%E0%B8%87%E0%B9%80%E0%B8%87%E0%B8%B5%E0%B8%A2%E0%B8%9A-%E0%B9%86-%E0%B9%81%E0%B8%95%E0%B9%88%E0%B8%A3%E0%B9%89%E0%B8%B2%E0%B8%A2%E0%B9%81%E0%B8%A3%E0%B8%87%E0%B8%81%E0%B8%A7%E0%B9%88%E0%B8%B2%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%84%E0%B8%B4%E0%B8%94.png",
			Link:               "",
			Credit:             "https://www.rama.mahidol.ac.th/ramachannel",
			Description:        "โรคเบาหวาน เป็นภาวะที่ร่างกายมีระดับน้ำตาลในเลือดสูงเกินมาตรฐาน เกิดจากการขาดอินซูลินหรืออินซูลินทำงานได้ไม่เต็มที่\n\nอาการของ โรคเบาหวาน เบื้องต้นที่ต้องระวัง\nกระหายน้ำบ่อย และปัสสาวะบ่อย\nเหนื่อยง่าย น้ำหนักลดโดยไม่ทราบสาเหตุ\nสายตาพร่ามัว เห็นไม่ชัดเจน\nแผลหายช้า ติดเชื้อง่าย\n\nวิธีป้องกันและควบคุม โรคเบาหวาน\nออกกำลังกายสม่ำเสมอ อย่างน้อย 150 นาทีต่อสัปดาห์\nจำกัดปริมาณน้ำตาลและแป้ง เลือกกินอาหารที่มีประโยชน์\nตรวจสุขภาพประจำปี เพื่อติดตามระดับน้ำตาลในเลือด\nปรึกษาแพทย์หากมีความเสี่ยง เช่น มีประวัติคนในครอบครัวเป็นโรคเบาหวาน",
			AdminID:            2,
			EducationalGroupID: 2,
			ContentCategoryID:  3,
		},
		{
			Title:              "ภารกิจพิชิตโรคเบาหวาน - Eat to Goal",
			PictureIn:          "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/2024/01/08ftg_15_v2.jpg",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/2024/01/08ftg_15_v2-1197x1536.jpg",
			Link:               "",
			Credit:             "https://www.rama.mahidol.ac.th/ramachannel",
			Description:        "พิชิตโรคเบาหวาน\nสังเกตและดูแลตัวเองเพื่อสู้โรคเบาหวาน\nปัจจัยเสี่ยงทำให้เป็นโรคเบาหวาน\nพันธุกรรม\nการรับประทานอาหารที่มีน้ำตาลสูง\nไม่ออกกำลังกายหรือมีกิจกรรมทางกายน้อย\nภาวะอ้วน\nอาการโรคเบาหวาน\nไม่มีอาการ\nกระหายน้ำบ่อย ปัสสาวะบ่อย\nแผลหายช้า ตามัว\nน้ำหนักลด\nอ่อนเพลีย\nเมนูแนะนำ\n“ยำถั่วพู”\nถั่วพู 100 กรัม\nหมูต้ม 50 กรัม\nกะทิธัญพืช 3 ช้อนโต๊ะ\nมะพร้าวคั่ว 1 ช้อนโต๊ะ\nถั่วลิสงคั่ว 1 ช้อนโต๊ะ\nพริกชี้ฟ้าหั่นฝอย 1 เม็ด\nน้ำมะนาว 1 ช้อนชา\nส่วนผสมน้ำยำ\nพริกแห้งเม็ดใหญ่ 2 เม็ด\nหอมแดงซอย 2 หัว\nกระเทียม 3 ช้อนโต๊ะ\nน้ำตาลหญ้าหวาน 1% ช้อนชา\nน้ำปลา 1 ช้อนชา",
			AdminID:            1,
			EducationalGroupID: 2,
			ContentCategoryID:  3,
		},
		{
			Title:              "ความเชื่อผิด ๆ เกี่ยวกับโรคเบาหวาน",
			PictureIn:          "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/2021/12/EP06_Infographic_%E0%B8%82%E0%B9%89%E0%B8%AD%E0%B9%80%E0%B8%97%E0%B9%87%E0%B8%88%E0%B8%88%E0%B8%A3%E0%B8%B4%E0%B8%87%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B9%80%E0%B8%9A%E0%B8%B2%E0%B8%AB%E0%B8%A7%E0%B8%B2%E0%B8%99-ai-07-12-64-01.jpg.webp",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/2021/12/EP06_Infographic_%E0%B8%82%E0%B9%89%E0%B8%AD%E0%B9%80%E0%B8%97%E0%B9%87%E0%B8%88%E0%B8%88%E0%B8%A3%E0%B8%B4%E0%B8%87%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B9%80%E0%B8%9A%E0%B8%B2%E0%B8%AB%E0%B8%A7%E0%B8%B2%E0%B8%99-ai-07-12-64-01-1080x1350.jpg",
			Link:               "",
			Credit:             "https://www.rama.mahidol.ac.th/ramachannel",
			Description:        "ผู้ป่วยเบาหวานสามารถบริจาคเลือดได้ หากคุมระดับน้ำตาลได้ดี ผู้ป่วยเบาหวานห้ามหยุดรับประทานยาเอง โรคเบาหวานรักษาไม่หายขาดแต่ทำให้สงบได้ โดยการคุมระดับน้ำตาลให้อยู่ในเกณฑ์ปกติ",
			AdminID:            1,
			EducationalGroupID: 2,
			ContentCategoryID:  3,
		},
		{
			Title:              "ยารักษาโรคเบาหวาน ใช้โดยพลการไม่ได้นะ",
			PictureIn:          "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/2018/05/%E0%B8%A2%E0%B8%B2%E0%B8%A3%E0%B8%B1%E0%B8%81%E0%B8%A9%E0%B8%B2%E0%B9%80%E0%B8%9A%E0%B8%B2%E0%B8%AB%E0%B8%A7%E0%B8%B2%E0%B8%99-%E0%B9%83%E0%B8%8A%E0%B9%89%E0%B9%82%E0%B8%94%E0%B8%A2%E0%B8%9E%E0%B8%A5%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B9%84%E0%B8%A1%E0%B9%88%E0%B9%84%E0%B8%94%E0%B9%89%E0%B8%99%E0%B8%B0-infographic.jpg.webp",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/2018/05/%E0%B8%A2%E0%B8%B2%E0%B8%A3%E0%B8%B1%E0%B8%81%E0%B8%A9%E0%B8%B2%E0%B9%80%E0%B8%9A%E0%B8%B2%E0%B8%AB%E0%B8%A7%E0%B8%B2%E0%B8%99-%E0%B9%83%E0%B8%8A%E0%B9%89%E0%B9%82%E0%B8%94%E0%B8%A2%E0%B8%9E%E0%B8%A5%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B9%84%E0%B8%A1%E0%B9%88%E0%B9%84%E0%B8%94%E0%B9%89%E0%B8%99%E0%B8%B0-infographic.jpg",
			Link:               "",
			Credit:             "",
			Description:        "ยารักษาโรคเบาหวาน ชนิด Metformin เป็นยาที่มีผลข้างเคียงค่อนข้างมาก และไม่ควรใช้โดยพลการ เนื่องจากต้องมีการปรับระดับยาในบางภาวะโดยแพทย์ เพื่อให้เหมาะกับคนไข้แต่ละราย ที่ผ่านมาพบว่ามีบางรายนำไปใช้ลดน้ำหนักโดยการหาซื้อกินเองตามร้านขายยา เป็นเรื่องที่ไม่ควรทำโดยเด็ดขาด เพราะอาจจะได้รับอันตรายจากการใช้ยาได้\n\nคำเตือน ห้ามใช้ลดน้ำหนักเนื่องจากตัวยา มีอาการข้างเคียงค่อนข้างมาก ทางที่ดีควรใช้ยาภายใต้การดูแลของแพทย์",
			AdminID:            1,
			EducationalGroupID: 2,
			ContentCategoryID:  3,
		},
		{
			Title:              "อาหารที่คนเป็นโรคเบาหวาน ควรทานและหลีกเลี่ยง",
			PictureIn:          "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/2016/12/baowhan-info.jpg.webp",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/2016/12/baowhan-info.jpg",
			Link:               "",
			Credit:             "",
			Description:        "อาหารที่ควรทาน\nอาหารไขมันต่ำ\nน้ำมันมะกอก\nปลา\nไข่\nถั่ว\nอาหารที่ควรหลีกเลี่ยง\nน้ำตาล\nแป้ง\nข้าว (ควรลดปริมาณหรือกินข้าวที่ไม่ขัดสี)\nขนมปัง\nผลไม้ที่มีน้ำตาลสูง",
			AdminID:            1,
			EducationalGroupID: 2,
			ContentCategoryID:  3,
		},
		{
			Title:              "9 สัญญาณเตือนโรคเบาหวาน",
			PictureIn:          "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/2016/08/1-5.png.webp",
			PictureOut:         "https://www.rama.mahidol.ac.th/ramachannel/wp-content/uploads/2016/08/1-5.png",
			Link:               "",
			Credit:             "",
			Description:        "สัญญาณเตือนโรคเบาหวาน ได้แก่\nปัสสาวะบ่อยผิดปกติ\nคอแห้ง กระหายน้ำบ่อย\nหิวบ่อย กินจุกว่าเดิม\nน้ำหนักตัวลดโดยไม่ทราบสาเหตุ\nเป็นแผล แต่หายช้ากว่าปกติ\nอ่อนเพลีย ไม่มีแรง\nมีอาการตาพล่ามัว มองไม่ชัด เป็นช่วง ๆ\nผิวหนังแห้งและคัน\nรู้สึกชาบริเวณปลายนิ้วมือ นิ้วเท้า",
			AdminID:            1,
			EducationalGroupID: 2,
			ContentCategoryID:  3,
		},
	}

	for _, content := range EducationalContent {
		db.FirstOrCreate(&content, entity.EducationalContent{
			Title:       content.Title,
			PictureIn:   content.PictureIn,
			PictureOut:  content.PictureOut,
			Link:        content.Link,
			Credit:      content.Credit,
			Description: content.Description,
		})
	}

	FoodChoice := []entity.FoodChoice{
		{
			FoodName: "นม และผลิตภัณฑ์นมไขมันต่ำหรือไร้ไขมัน",
		},
		{
			FoodName: "เนื้อสัตว์ไม่ติดหนัง ไม่ติดมัน เนื้อหมู เนื้อไก่ เนื้อวัว อาหารทะเล ไข่ ไข่ขาว เต้าหู้ โปรตีนเกษตร",
		},
		{
			FoodName: "ธัญพืชและผลิตภัณฑ์: ข้าว แป้ง ก๋วยเตี๋ยว ขนมจีน ขนมปัง ข้าวโพด ข้าวฟ่าง ข้าวโอ๊ต ทั้งขัดสี และไม่ขัดสี",
		},
		{
			FoodName: "ถั่ว: ถั่วเหลือง ถั่วเหลือง ถั่วเขียว ถั่วแดง ถั่วดำ ถั่วลิสง เม็ดมะม่วงหิมพานต์ อัลมอลด์ ",
		},
		{
			FoodName: "น้ำมันชนิดดี: น้ำมันพืช น้ำมันรำข้าว น้ำมันมะกอก น้ำมันถั่วเหลือง",
		},
		{
			FoodName: "ไขมันอิ่มตัว ไขมันทรานส์",
		},
		{
			FoodName: "สมุนไพร และเครื่องเทศ",
		},
		{
			FoodName: "้เกลือ น้ำปลา ซีอิ้ว เครื่องปรุงรสที่มีโซเดียม",
		},
		{
			FoodName: "ขนมหวาน น้ำตาล เครื่องดื่มที่ใส่น้ำตาล",
		},
		{
			FoodName: "อาหารที่มีฟอสฟอรัสแอบซ่อน",
		},
	}

	for _, foodchoice := range FoodChoice {
		db.FirstOrCreate(&foodchoice, entity.FoodChoice{
			FoodName: foodchoice.FoodName})
	}

	FoodchoiceDisease := []entity.FoodchoiceDisease{
		{
			DiseaseID:    1, //1-3a
			FoodChoiceID: 1,
			Description:  "รับประทานในปริมาณที่เหมาะสม",
		},
		{
			DiseaseID:    1, //1-3a
			FoodChoiceID: 2,
			Description:  "รับประทานในปริมาณที่เหมาะสม",
		},
		{
			DiseaseID:    1, //1-3a
			FoodChoiceID: 3,
			Description:  "รับประทานให้หลากหลายในปริมาณที่เหมาะสม",
		},
		{
			DiseaseID:    1, //1-3a
			FoodChoiceID: 4,
			Description:  "รับประทานในปริมาณที่เหมาะสม",
		},
		{
			DiseaseID:    1, //1-3a
			FoodChoiceID: 5,
			Description:  "รับประทานในปริมาณที่เหมาะสม",
		},
		{
			DiseaseID:    1, //1-3a
			FoodChoiceID: 6,
			Description:  "หลีกเลี่ยง",
		},
		{
			DiseaseID:    1, //1-3a
			FoodChoiceID: 7,
			Description:  "ใช้ได้",
		},
		{
			DiseaseID:    1, //1-3a
			FoodChoiceID: 8,
			Description:  "จำกัดการรับประทาน",
		},
		{
			DiseaseID:    1, //1-3a
			FoodChoiceID: 9,
			Description:  "จำกัดการรับประทาน",
		},
		{
			DiseaseID:    1, //1-3a
			FoodChoiceID: 10,
			Description:  "หลีกเลี่ยงเด็ดขาด",
		},
		{
			DiseaseID:    2, //3b-5
			FoodChoiceID: 1,
			Description:  "มีโปรตีน มีโพแทสเซียม และฟอสฟอรัสสูง",
		},
		{
			DiseaseID:    2, //3b-5
			FoodChoiceID: 2,
			Description:  "จำกัดปริมาณและ ระวังโพแทสเซียมและฟอสฟอรัสในอาหารบางชนิด",
		},
		{
			DiseaseID:    2, //3b-5
			FoodChoiceID: 3,
			Description:  "ธัญพืชและผลิตภัณฑ์ที่ไม่ขัดสีมีโพแทสเซียมและฟอสฟอรัสสูง",
		},
		{
			DiseaseID:    2, //3b-5
			FoodChoiceID: 4,
			Description:  "มีทั้งโพแทสเซียมและฟอสฟอรัสสูง",
		},
		{
			DiseaseID:    2, //3b-5
			FoodChoiceID: 5,
			Description:  "รับประทานในปริมาณที่เหมาะสม",
		},
		{
			DiseaseID:    2, //3b-5
			FoodChoiceID: 6,
			Description:  "หลีกเลี่ยง",
		},
		{
			DiseaseID:    2, //3b-5
			FoodChoiceID: 7,
			Description:  "ใช้ได้",
		},
		{
			DiseaseID:    2, //3b-5
			FoodChoiceID: 8,
			Description:  "จำกัดการรับประทาน",
		},
		{
			DiseaseID:    2, //3b-5
			FoodChoiceID: 9,
			Description:  "จำกัดการรับประทาน",
		},
		{
			DiseaseID:    2, //3b-5
			FoodChoiceID: 10,
			Description:  "หลีกเลี่ยงเด็ดขาด",
		},
	}

	for _, foodchoicedisease := range FoodchoiceDisease {
		db.FirstOrCreate(&foodchoicedisease, entity.FoodchoiceDisease{
			DiseaseID:    foodchoicedisease.DiseaseID,
			FoodChoiceID: foodchoicedisease.FoodChoiceID,
			Description:  foodchoicedisease.Description})
	}

	FoodExchanges := []entity.FoodExchange{
		{Amount: "1", Unit: "ทัพพี", FoodItemID: 1},
		{Amount: "1/2", Unit: "ทัพพี", FoodItemID: 2},
		{Amount: "2", Unit: "ทัพพี", FoodItemID: 3},
		{Amount: "1", Unit: "ทัพพี", FoodItemID: 15},
		{Amount: "1", Unit: "ทัพพี", FoodItemID: 4},
		{Amount: "1", Unit: "ทัพพี", FoodItemID: 12},
		{Amount: "1", Unit: "ทัพพี", FoodItemID: 13},
		{Amount: "2", Unit: "ทัพพี", FoodItemID: 14},
		{Amount: "1", Unit: "ทัพพี", FoodItemID: 9},
		{Amount: "1", Unit: "แผ่น", FoodItemID: 10},
		{Amount: "6", Unit: "แผ่น", FoodItemID: 11},
		{Amount: "6-8", Unit: "ชิ้น", FoodItemID: 22},
		{Amount: "6-8", Unit: "ชิ้น", FoodItemID: 23},
		{Amount: "1/2", Unit: "ผล", FoodItemID: 25},
		{Amount: "1/2", Unit: "ผลกลาง", FoodItemID: 26},
		{Amount: "1/2", Unit: "ผล", FoodItemID: 27},
		{Amount: "1/2", Unit: "ผล", FoodItemID: 28},
		{Amount: "1", Unit: "ผลเล็ก", FoodItemID: 16},
		{Amount: "1", Unit: "ผลใหญ่", FoodItemID: 33},
		{Amount: "1", Unit: "เม็ดเล็ก", FoodItemID: 34},
		{Amount: "1", Unit: "ทัพพี", FoodItemID: 79},
		{Amount: "1", Unit: "ทัพพี", FoodItemID: 80},
		{Amount: "1/2", Unit: "ฝักใหญ่", FoodItemID: 81},
		{Amount: "6-8", Unit: "ชิ้น", FoodItemID: 82},
		{Amount: "1", Unit: "ผล", FoodItemID: 83},
	}

	for _, foodexchange := range FoodExchanges {
		db.FirstOrCreate(&foodexchange, entity.FoodExchange{
			Amount:     foodexchange.Amount,
			Unit:       foodexchange.Unit,
			FoodItemID: foodexchange.FoodItemID,
		})
	}

}
