package config

import (
	"fmt"
	// "time"
	// "log"
	"github.com/helloeve02/CPE681012/entity"
	"gorm.io/driver/sqlite"
	"gorm.io/gorm"
)

var db *gorm.DB

// DB returns the database connection instance
func DB() *gorm.DB {
	return db
}

// ConnectionDB initializes the database connection
func ConnectionDB() {
	database, err := gorm.Open(sqlite.Open("nutrition.db?cache=shared"), &gorm.Config{})
	if err != nil {
		panic("failed to connect database")
	}
	fmt.Println("connected database")
	db = database
}

func SetupDatabase() {
	// Automigrate Tables
	err := db.AutoMigrate(
		&entity.Menu{},
		&entity.Admin{},
		&entity.DiseaseTag{},
		&entity.Disease{},
		&entity.EducationalContent{},
		&entity.FiveFoodGroups{},
		&entity.Ingredients{},
		&entity.Tag{},
		&entity.MealMenu{},
		&entity.Meal{},
		&entity.Mealday{},
		&entity.Mealplan{},
		&entity.AgeRange{},
		&entity.FoodGroup{},
		&entity.IbwRange{},
		&entity.MealTime{},
		&entity.NutritionGroup{},
		&entity.NutritionRecommendation{},
		&entity.PortionRecommendation{},
		&entity.Rule{},
		&entity.MenuTag{},
		&entity.FoodFlag{},
		&entity.FoodItem{},
		&entity.EducationalGroup{},
		&entity.FoodChoice{},
		&entity.FoodchoiceDisease{},
	)
	if err != nil {
		panic("failed to migrate database: " + err.Error())
	}
	fmt.Println("Database tables migrated successfully")

	Menu := []entity.Menu{
		{
			Title: "ยำถั่วฝักยาว/มะเขือ",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
		- ถั่วฝักยาวลวกพอสุกหั่นเป็นท่อนสั้น: 4 ฝัก (40 กรัม)
		- มะเขือผ่อย หรือมะเขือเปราะลวกพอสุกหั่นเป็นชิ้นเล็ก: 2 ช้อนโต๊ะ (30 กรัม)
		- มะเขือพวงลวกสุก: 15 เม็ด (15 กรัม)
		- หมูไม่ติดมันบด: 1 ช้อนโต๊ะ (15 กรัม)
		- น้ำมันรำข้าว: 2 ช้อนชา (10 กรัม)
		- กระเทียม: 3 กลีบ (7.5 กรัม)
		- หอมแดง: 2 หัวเล็ก (10 กรัม)
		- พริกหนุ่มเม็ดใหญ่: 4 เม็ด (40 กรัม)
		- น้ำเห็ดหอม: 50 ซีซี (50 กรัม)
		- กะปิ: 1/2 ช้อนชา (2.5 กรัม)
		- รากผักชี: 3 ราก (6 กรัม)
		- ต้นหอม / ผักชี / ใบแมงลัก: เล็กน้อยสำหรับตกแต่งอาหาร

		วิธีทำ
		1. โขลกพริกหนุ่ม กระเทียม หอมแดง รากผักชี ให้เข้ากัน
		2. ใส่กะปิ โขลกรวมกัน จากนั้นใส่ถั่วฝักยาว มะเขือเปราะ และมะเขือพวง โขลกให้เข้ากัน
		3. ผัดเครื่องแกงที่โขลกไว้กับน้ำมันรำข้าว
		4. ใส่หมูบดลงไป ผัดจนหมูสุกและเข้ากันดี
		5. ตักใส่จาน โรยหน้าด้วยต้นหอม ผักชี และใบแมงลักเพื่อความสวยงาม`,
			// Region: "ภาคเหนือ",
			Image:  "https://f.ptcdn.info/511/002/000/1361646707-IMG2766Med-o.jpg",
			Credit: "https://pantip.com/topic/30178641",
		},
		{
			Title: "น้ำพริกอ่อง",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
	- หมูไม่ติดมันบด: 1 ช้อนโต๊ะ (15 กรัม)
	- มะเขือส้ม หรือมะเขือเทศลูกเล็กหั่นสี่เหลี่ยม: 1/2 ถ้วย (40 กรัม)
	- พริกแห้งเม็ดใหญ่ เอาทั้งเม็ด: 2 เม็ด (5 กรัม)
	- น้ำเปล่า: 1/4 ถ้วย (60 กรัม)
	- น้ำตาล: 1/4 ช้อนชา (1.25 กรัม)
	- กระเทียมปอกเปลือก: 3 กลีบ (7.5 กรัม)
	- หอมแดงปอกเปลือก: 1.5 หัว (7.5 กรัม)
	- กะปิ: 1/4 ช้อนชา (1.25 กรัม)
	- น้ำปลา: 1/5 ช้อนชา (1 กรัม)
	- น้ำมันรำข้าว: 1.5 ช้อนชา (7.5 กรัม)
	- มะขามเปียก: 1 ช้อนชา (5 กรัม)
	- แตงกวา: 1 ลูก (40 กรัม)
	- มะเขือเปราะ: 1 ลูก (25 กรัม)
	- ผักกาดขาวปลี: 2 ก้าน (20 กรัม)
	- ผักชีหั่นฝอย: เล็กน้อยสำหรับตกแต่งอาหาร

	วิธีทำ
	1. นำพริกแห้งเม็ดใหญ่แช่น้ำให้นิ่ม
	2. โขลกพริกแห้ง กระเทียม หอมแดง กะปิ ให้ละเอียด
	3. ใส่มะเขือเทศลูกเล็ก คนให้เข้ากันรวมกับเครื่องแกงในข้อ 2
	4. ผัดเครื่องแกงที่โขลกไว้กับน้ำมันให้หอม ใส่หมูบดผัดให้สุก ใส่น้ำ
	5. ปรุงรสด้วยน้ำปลา และน้ำมะขามเปียก
	6. ตักใส่ถ้วย แต่งหน้าด้วยผักชี รับประทานกับผักสด`,
			// Region: "ภาคเหนือ",
			Image:  "https://img.wongnai.com/p/1920x0/2017/09/24/c415bbcecc5145c9a967b132e28a1087.jpg",
			Credit: "https://www.facebook.com/amonrat.Thuamchot",
		},
		{
			Title: "แกงแคไก่บ้าน",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
	- เนื้ออกไก่หั่นเป็นชิ้นขนาดพอคำ: 1 ช้อนโต๊ะ (15 กรัม)
	- ถั่วฝักยาว: 2 ฝัก (20 กรัม)
	- มะเขือผ่อย หรือมะเขือเปราะ: 1 ลูก (25 กรัม)
	- มะเขือพวง: 10 ลูก (10 กรัม)
	- ใบชะพลู: 3 ใบ (5 กรัม)
	- ชะอมเด็ดยอดอ่อน: 2 ช้อนชา (5 กรัม)
	- ใบพริกอ่อน: 2 ช้อนโต๊ะ (5 กรัม)
	- พริกขี้หนูแห้ง: 3 เม็ดเล็ก (2.5 กรัม)
	- กระเทียม: 4 กลีบ (10 กรัม)
	- หอมแดง: 4 หัวเล็ก (20 กรัม)
	- กะปิ: 1/2 ช้อนชา (2.5 กรัม)
	- น้ำเห็ดหอมสดต้มเคี่ยว 1 ชั่วโมง: 150 ซี.ซี. (150 กรัม)

	วิธีทำ
	1. โขลกพริกขี้หนูแห้ง กระเทียม หอมแดง และกะปิให้ละเอียดจนเข้ากัน
	2. ตั้งน้ำเห็ดหอมให้เดือด แล้วใส่เครื่องแกงที่โขลกไว้ลงไป
	3. ใส่เนื้อไก่ลงต้มจนเริ่มสุก จากนั้นใส่ผักที่สุกยาก เช่น ถั่วฝักยาว มะเขือเปราะ
	4. เมื่อน้ำเดือดอีกครั้ง ใส่ผักสุกง่าย เช่น ใบชะพลู ชะอม ใบพริกอ่อน
	5. รอให้เดือดอีกครั้ง แล้วยกลงจากเตา ตักเสิร์ฟร้อน ๆ`,
			// Region: "ภาคเหนือ",
			Image:  "https://i.ytimg.com/vi/Jvf4KMuuoEQ/maxresdefault.jpg",
			Credit: "https://www.facebook.com/profile.php?id=100080562848664",
		},
		{
			Title: "แกงส้มตูนปลานิล",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
	- ก้านตูนเด็ดเป็นท่อนขนาด 1/2 นิ้ว: 3/4 ถ้วยตวง (60 กรัม)
	- เนื้อปลานิล: 1 ช้อนโต๊ะ (15 กรัม)
	- ยอดอ่อนตำลึง: 1/2 ถ้วยตวง (15 กรัม)
	- มะเขือส้มหรือมะเขือเทศลูกเล็กผ่า: 1/3 ถ้วยตวง (30 กรัม)
	- น้ำมะกรูด: 3 ลูก (15 กรัม)
	- พริกขี้หนูสด: 7 เม็ด (3 กรัม)
	- หอมแดง: 4 หัว (20 กรัม)
	- กระเทียม: 6 กลีบ (15 กรัม)
	- กะปิ: 1/2 ช้อนชา (2.5 กรัม)
	- ขมิ้น: 1 แว่น (2 กรัม)
	- น้ำเปล่า: 200 ซี.ซี. (200 กรัม)

	วิธีทำ
	1. โขลกพริกขี้หนูสด หอมแดง กระเทียม และกะปิรวมกันให้ละเอียด
	2. ใส่ขมิ้นลงไปโขลกรวมกันอีกครั้งจนเนียน
	3. ต้มน้ำให้เดือด แล้วใส่เครื่องแกงที่โขลกไว้ลงไป
	4. ใส่เนื้อปลานิล ก้านตูน และยอดตำลึงลงไปต้มจนสุก
	5. ปรุงรสด้วยน้ำมะกรูดก่อนยกลง ตักใส่ถ้วยพร้อมเสิร์ฟ`,
			// Region: "ภาคเหนือ",
			Image:  "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEikO0YvxPPCqwJAgtPfgJjjdTX2oZvUWFvgAHLRItqY9q1UbwYqXBIEZqUmjsrk4wfTavQfzmLbPzMUSd6LBjZmxI3Vhag7jsOMyxPg3V2AVikonT_SdHb5CiDBbQkI2Fv68L8eMmlyKhM/s1600/%E0%B9%81%E0%B8%81%E0%B8%87%E0%B8%95%E0%B8%B9%E0%B8%99%E0%B9%83%E0%B8%AA%E0%B9%88%E0%B8%9B%E0%B8%A5%E0%B8%B2.jpg",
			Credit: "https://th.wikipedia.org/wiki/%E0%B8%A1%E0%B8%AB%E0%B8%B2%E0%B8%A7%E0%B8%B4%E0%B8%97%E0%B8%A2%E0%B8%B2%E0%B8%A5%E0%B8%B1%E0%B8%A2%E0%B9%80%E0%B8%8A%E0%B8%B5%E0%B8%A2%E0%B8%87%E0%B9%83%E0%B8%AB%E0%B8%A1%E0%B9%88",
		},
		{
			Title: "จอผักกาด",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
	- ผักกาดจ้อน หรือดอกผักกวางตุ้งหั่นเป็นท่อน: 3/4 ถ้วยตวง (80 กรัม)
	- หมูไม่ติดมัน: 1 ช้อนโต๊ะ (15 กรัม)
	- น้ำเห็ดหอมสด: 3/4 ถ้วยตวง (180 กรัม)
	- กะปิ: 1/4 ช้อนชา (1.25 กรัม)
	- กระเทียมสับหยาบ: 2 กลีบ (5 กรัม)
	- หอมแดงปอกเปลือกทุบพอแตก: 1 หัว (5 กรัม)
	- พริกขี้หนูแห้ง: 5 เม็ด (5 กรัม)
	- น้ำมะขามเปียก: 3 ช้อนโต๊ะ (45 กรัม)
	- น้ำตาลปี๊บ: 3/4 ช้อนชา (3.75 กรัม)
	- น้ำมันรำข้าว: 2 ช้อนชา (10 กรัม)

	วิธีทำ
	1. เจียวกระเทียมพอเหลือง ตักขึ้นพักไว้ แล้วทอดพริกขี้หนูแห้งให้กรอบ
	2. ผัดกะปิกับน้ำมันที่เหลือให้หอม แล้วใส่หมูลงผัดพอสุก จากนั้นตักใส่หม้อ
	3. เติมน้ำเห็ดหอมลงในหม้อ รอให้เดือดแล้วใส่ผักกวางตุ้ง เคี่ยวจนผักเปื่อยนุ่ม
	4. ใส่พริกทอด 2 เม็ดลงเคี่ยวพร้อมผัก ปรุงรสด้วยน้ำมะขามเปียกและน้ำตาลปี๊บ คนให้เข้ากัน
	5. ตักใส่ถ้วย โรยหน้าด้วยกระเทียมเจียว และแต่งหน้าด้วยพริกทอดที่เหลือ`,
			// Region: "ภาคเหนือ",
			Image: "https://static.thairath.co.th/media/4DQpjUtzLUwmJZZSC41tBS2JyaLrHhBkHieCf4lwMRxT.jpg",
		},
		{
			Title: "ลาบคั่ว",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
	- ไข่ขาวเบอร์ 2: 4 ฟอง (140 กรัม)
	- วุ้นเส้น: 1 ห่อ (50 กรัม)
	- แป้งมัน: 5 ช้อนโต๊ะ (25 กรัม)
	- รากผักชีโขลกละเอียด: 5 ราก (10 กรัม)
	- ต้นหอมหั่น: 1.5 ช้อนโต๊ะ (15 กรัม)
	- ผักชีหั่น: 3 ช้อนโต๊ะ (15 กรัม)
	- ขิงแก่หั่นฝอย: 3 ช้อนโต๊ะ (45 กรัม)
	- กระเทียมปอกสับ: 6 กลีบ (15 กรัม)
	- น้ำมันรำข้าว: 5 ช้อนชา (25 กรัม)
	- ซีอิ๊วขาว: 1 ช้อนชา (5 กรัม)
	- น้ำตาล: 1.5 ช้อนชา (7.5 กรัม)
	- น้ำมะนาว: 4 ช้อนชา (20 กรัม)
	- เครื่องเทศลาบ: 1 ช้อนชา (5 กรัม)
	- น้ำเห็ดหอมต้ม: 150 ซี.ซี. (150 กรัม)
	- ผักกาดขาว: 5 ก้าน (150 กรัม)

	วิธีทำ
	1. นำวุ้นเส้นแช่น้ำให้นิ่มมาตัดและสับ ผสมไข่ขาวให้เข้ากันแล้วร่อนแป้งมันทีละน้อย คนให้เข้ากัน
	2. นำถาดสำหรับนึ่งไข่ทาน้ำมันให้ทั่ว เทส่วนผสมข้อ 1 ลงไป แล้วนำไปนึ่งประมาณ 20 นาทีให้สุก พักให้เย็น แล้วแกะออกมาหั่นเป็นสี่เหลี่ยมเล็ก
	3. ผสมเครื่องเทศลาบ คลุกเคล้ากับส่วนผสมในข้อ 2 ให้ทั่ว
	4. เจียวขิงหั่นฝอยให้เหลืองตักพักไว้ในข้อ 3 จากนั้นนำน้ำมันที่เหลือเจียวกระเทียม ตักขึ้น และเจียวรากผักชีให้หอม
	5. นำส่วนผสมข้อ 3 ผัดต่อใส่น้ำเห็ดหอมผัดจนแห้ง ปรุงรสด้วยซีอิ๊วขาว ต้นหอม ผักชี
	6. ปิดไฟใส่น้ำมะนาวคนให้เข้ากันตักใส่จาน โรยด้วยต้นหอม ผักชีอีกเล็กน้อย รับประทานคู่กับผักกาดขาว`,
			// Region: "ภาคเหนือ",
			Image:  "https://png.pngtree.com/thumb_back/fh260/background/20220324/pngtree-spicy-thai-pork-salad-with-ground-pork-and-pork-liver-larb-mu-photo-image_21814272.jpg",
			Credit: "https://th.pngtree.com/freebackground/spicy-thai-pork-salad-with-ground-pork-and-pork-liver-larb-mu-photo_8413949.html",
		},
		{
			Title: "ขนมจีนน้ำเงี้ยว",
			Description: `ส่วนประกอบพริกแกง (ต่อ 2 ที่)
	- พริกชี้ฟ้าแห้ง: 3 เม็ด (3 กรัม)
	- หอมแดง: 2 หัว (10 กรัม)
	- กระเทียม: 2 ช้อนชา (10 กรัม)
	- ตะไคร้ซอย: 1 ต้น (10 กรัม)
	- ข่าแก่: 5 แว่น (15 กรัม)
	- รากผักชี: 1 ต้น (2 กรัม)
	- เกลือป่น: 1/4 ช้อนชา (1 กรัม)

	ส่วนประกอบ (ต่อ 2 ที่)
	- น้ำมันรำข้าว: 2 ช้อนชา (10 กรัม)
	- เนื้อหมูสับ: 4 1/3 ช้อนโต๊ะ (65 กรัม)
	- น้ำเปล่า: 400 มิลลิลิตร (400 มิลลิลิตร)
	- ดอกงิ้ว: 4 ดอก (2 กรัม)
	- มะเขือเทศ: 5 ลูก (120 กรัม)
	- ขนมจีน: 2 จับ (18 กรัม)
	- น้ำปลา: 1/2 ช้อนชา (2 กรัม)

	วิธีทำ
	1. โขลกส่วนผสมพริกแกงให้เข้ากัน
	2. ใส่น้ำมันพืชในหม้อตั้งไฟพอร้อน ใส่น้ำพริกแกงลงผัดจนหอม
	3. ผัดเนื้อหมูจนสุก และเข้ากันดี
	4. ใส่น้ำเปล่าลงไป หรี่ไฟแล้วเคี่ยวจนเดือด และมีกลิ่นหอม จากนั้นใส่ดอกงิ้ว และมะเขือเทศ เคี่ยวจนเข้ากัน
	5. จัดเสิร์ฟ พร้อมกะหล่ำปลีซอย กระเทียมเจียว หากชอบรสเปรี้ยวสามารถปรุงรสด้วยน้ำมะนาวตามชอบ`,
			// Region: "ภาคเหนือ",
			Image:  "https://sharp-weeclub.com/wp-content/uploads/2022/01/%E0%B8%82%E0%B8%99%E0%B8%A1%E0%B8%88%E0%B8%B5%E0%B8%991-990x510-1.jpg",
			Credit: "https://kongthaijeen.com/cn/41301/",
		},
		{
			Title: "ตำขนุน",
			Description: `ส่วนประกอบพริกแกง (ต่อ 2 ที่)
  - พริกขี้หนูแห้ง: 3 เม็ด (3 กรัม)
  - กระเทียม: 3 กลีบ (6 กรัม)
  - หอมแดง: 1 หัว (6 กรัม)
  - ข่าหั่น: 1 แว่น (3 กรัม)
  - ตะไคร้ซอย: 1 ต้น (3 กรัม)
  - กะปิ: 1/4 ช้อนชา (2 กรัม)

  ส่วนประกอบ (ต่อ 2 ที่)
  - ขนุนอ่อน: 2 ชิ้น (100 กรัม)
  - เนื้อหมูสับ: 2 ช้อนโต๊ะ (40 กรัม)
  - มะเขือเทศ: 2 ลูก (15 กรัม)
  - ใบมะกรูด: 2 ใบ (1 กรัม)
  - กระเทียมเจียว: 1 ช้อนชา (5 กรัม)
  - ผักชีซอย: 1 กรัม
  - ต้นหอมซอย: 3 กรัม
  - พริกขี้หนูแห้งทอด: 1 เม็ด (1 กรัม)
  - น้ำมันรำข้าว: 2 ช้อนชา (10 กรัม)
  - กระเทียมสับ: 1 ช้อนชา (5 กรัม)
  - น้ำปลา: 1/2 ช้อนชา (2 กรัม)

  วิธีทำ
  1. หั่นขนุนอ่อนตามขวาง นำไปต้มให้เปื่อย ตักขึ้นพักไว้
  2. โขลกขนุนให้ละเอียดแล้วพักไว้ จากนั้นโขลกส่วนประกอบของพริกแกงรวมกันให้ละเอียด
  3. นำพริกแกง เนื้อหมูสับ มะเขือเทศ และขนุนมาโขลกรวมกัน
  4. เจียวกระเทียมพอเหลือง ใส่ส่วนผสมที่โขลกรวมกันแล้วลงผัดให้หอม
  5. เมื่อเนื้อหมูสุกดีแล้ว ใส่ใบมะกรูด ตามด้วยผักชี ต้นหอมซอย ลงผัดให้เข้ากัน`,
			// Region: "ภาคเหนือ",
			Image:  "https://www.maeban.co.th/upfiles/blog/469811576_1757125385107540_8515113923452393484_n.jpg",
			Credit: "https://phiangphitc.wordpress.com/2013/07/18/%E0%B8%95%E0%B8%B3%E0%B8%82%E0%B8%99%E0%B8%B8%E0%B8%99/",
		},
		{
			Title: "น้ำพริกมะเขือเทศ",
			Description: `ส่วนประกอบพริกแกง (ต่อ 1 ที่)
  - มะเขือเทศย่างไฟ: 3 ลูก (50 กรัม)
  - พริกหนุ่มย่างไฟ: 3 เม็ด (40 กรัม)
  - หอมแดงย่างไฟ: 3 หัว (15 กรัม)
  - กระเทียมย่างไฟ: 4 กลีบ (8 กรัม)
  - น้ำปลา: 1/3 ช้อนชา (1.5 กรัม)
  - ไข่ต้ม: 1/2 ฟอง (25 กรัม)
  - ถั่วฝักยาว: 2 ฝัก (20 กรัม)
  - กะหล่ำปลี: 1/6 ลูก (20 กรัม)

  วิธีทำ
  1. ย่างมะเขือเทศ พริกหนุ่ม หอมแดง กระเทียม ให้สุกทั่วกัน
  2. ลอกเปลือกที่ไหม้ออก
  3. หากต้องการเผ็ดน้อย ควรเอาไส้พริกหนุ่มออก
  4. โขลกพริกหนุ่ม มะเขือเทศ หอมแดง กระเทียม ทั้งหมดให้เข้ากัน ปรุงรสด้วยน้ำปลา
  5. หากชอบรสเปรี้ยว ให้ปรุงรสด้วยน้ำมะนาวเล็กน้อย รับประทานแนมกับผักลวก และไข่ต้ม`,
			// Region: "ภาคเหนือ",
			Image:  "https://img.kapook.com/u/surauch/cook1/Thai_2.jpg",
			Credit: "https://www.bloggang.com/m/viewdiary.php?id=thewho&month=03-2018&date=31&group=18&gblog=1",
		},
		{
			Title: "แอ๊บหมู",
			Description: `ส่วนประกอบพริกแกง (ต่อ 2 ที่)
- น้ำพริกแกงเผ็ด: 1 ช้อนชาพูน (7 กรัม)
- เนื้อหมูสับ: 3 ช้อนโต๊ะ (50 กรัม)
- ผักกาดขาว: 1 ก้าน (20 กรัม)
- เห็ดหูหนู: 3 ดอก (15 กรัม)
- โหระพา: 1 กิ่ง (5 กรัม)
- ผักชีฝรั่ง ใบมะกรูด: เล็กน้อย

วิธีทำ
1. ผสมน้ำพริกแกงเผ็ดกับหมูสับให้เข้ากัน
2. ซอยเห็ดหูหนู ผักชีฝรั่ง ใบมะกรูด ผสมคลุกเคล้ากับเนื้อหมู
3. ตัดใบตองซ้อนกันสองชั้น รองด้วยผักกาดขาวและโหระพา
4. ตักส่วนผสมใส่ห่อใบตอง ใช้ไม้กลัดนำไปย่างหรืออบจนสุก`,
			// Region: "ภาคเหนือ",
			Image:  "https://img.wongnai.com/p/256x256/2023/06/04/b1e8748c61d4459d826187fb574aeb1f.jpg",
			Credit: "https://shorturl.at/YuvZu",
		},
		{
			Title: "ต้มโคล้งปลาช่อน",
			Description: `ส่วนประกอบพริกแกง (ต่อ 1 ที่)
- เนื้อปลาช่อนสด: 1 ช้อนโต๊ะ (25 กรัม)
- กระเทียม, ข่า, กระชาย, หอมแดง: อย่างละ 3 กรัม (รวม 18 กรัม)
- ตะไคร้, พริกบางใหญ่แห้ง
- มะเขือเทศราชินี, เห็ดนางฟ้า: 1/2 ทัพพี (40 กรัม)
- ใบมะกรูด, ใบกะเพรา, ผักชีฝรั่ง: อย่างละ 2-3 ใบ (รวม 5 กรัม)
- น้ำมะนาว: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำปลา: 1/4 ช้อนชา (1.25 กรัม)
- น้ำสะอาด: 200 มิลลิลิตร

วิธีทำ
1. นำหอม, กระเทียม, ข่า, กระชาย, ตะไคร้, พริก คั่วด้วยไฟปานกลางจนหอมและเกรียมเล็กน้อย
2. ตั้งน้ำให้เดือด ใส่เครื่องสมุนไพรที่คั่วไว้ มะเขือเทศ และเห็ดนางฟ้าลงต้มต่อจนเดือด
3. ใส่เนื้อปลาช่อนหั่นชิ้นบางลงในน้ำซุป ต้มต่อจนสุก
4. จัดใบมะกรูด, ใบกะเพรา, ผักชีฝรั่ง, น้ำมะนาว, น้ำปลา ลงในภาชนะ
5. ตักต้มโคล้งใส่ลงไป รับประทานกับข้าวสวยร้อน ๆ`,
			// Region: "ภาคกลาง",
			Image:  "https://api2.krua.co/wp-content/uploads/2020/06/SlideBanner1140x507-650.jpg",
			Credit: "https://www.wongnai.com/reviews/71c0729575454bc18a87cdc060ac937c",
		},
		{
			Title: "แกงส้มเปลือกแตงโมกุ้งสด",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
- เนื้อกุ้งสดขนาดกลาง: 3 ตัว (15 กรัม) (ปอกเปลือก ผ่าหลัง)
- เนื้อปลาช่อน: 1/2 ช้อนโต๊ะ (10 กรัม)
- เปลือกแตงโม: 1 ทัพพี (80 กรัม) (เอาเฉพาะส่วนเนื้อขาว หั่นชิ้นพอดีคำ)
- พริกชี้ฟ้าแห้ง: 3 ดอก (3 กรัม) (เอาเมล็ดออก หั่นท่อนเล็กๆ)
- หอมแดง: 1/2 ช้อนโต๊ะ (10 กรัม) (ปอกเปลือก หั่นเป็นชิ้นเล็ก)
- กระเทียม: 1 กลีบเล็ก (2 กรัม) (ปอกเปลือก หั่นเป็นชิ้นเล็ก)
- กระชาย: 1/2 ช้อนโต๊ะ (10 กรัม) (หั่นท่อนเล็ก)
- กะปิ: 1/2 ช้อนชา (3 กรัม)
- น้ำตาลปี๊บ: 1/2 ช้อนชา (3 กรัม)
- มะขามเปียก: 30 กรัม (ละลายเนื้อมะขาม 10 กรัมในน้ำ 3 ช้อนโต๊ะ)
- น้ำสะอาด: 1 ถ้วยตวง (240 มิลลิลิตร)

วิธีทำ
1. ต้มน้ำให้เดือด ใส่เนื้อปลาและกุ้งสด พอสุกตักขึ้นมาพักไว้
2. เตรียมน้ำพริกแกงโดยโขลกพริกแห้ง, กระชาย, กระเทียมพอละเอียด ใส่หอมแดงลงโขลกต่อจนละเอียด
3. ใส่กะปิและเนื้อปลาที่ต้มไว้ลงโขลกให้เข้ากัน จะได้น้ำพริกแกงส้มสำหรับ 1 ที่
4. ใส่น้ำพริกแกงและเปลือกแตงโมลงต้มจนเปลือกแตงโมนุ่ม
5. ปรุงรสด้วยน้ำตาลและน้ำมะขามเปียก ตามด้วยกุ้ง รอจนสุกพร้อมตักเสิร์ฟ`,
			// Region: "ภาคกลาง",
			Image:  "https://thecookingsociety.com/wp-content/uploads/2022/02/Screen-Shot-2565-02-26-at-15.54.50.png",
			Credit: "https://cooking.kapook.com/view75219.html",
		},
		{
			Title: "ผัดฉ่าไข่ขาว",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
- ไข่ต้มสุกเอาแต่ไข่ขาว: 1 ฟอง (30 กรัม)
- พริกบางใหญ่แห้ง: 2 ดอก (10 กรัม)
- กระเทียม: 3 กลีบ
- พริกหนุ่มสดหั่นเฉลียงเป็นชิ้นใหญ่: 3 ดอก (20 กรัม)
- พริกชี้ฟ้าสด (เขียว/แดง/เหลือง): อย่างละ 1 ดอกเล็ก (รวม 10 กรัม) (เอาเมล็ดออก หั่นเฉลียงเป็นชิ้นพอสวย)
- ใบมะกรูด, ผักชีฝรั่ง (ฉีกเป็นชิ้นเล็ก): อย่างละ 2-3 ใบ (รวม 3 กรัม)
- ใบกะเพราเด็ด: 3 กรัม
- กระชายสด (ซอยเป็นเส้นพอสวย): 1 ช้อนโต๊ะ (15 กรัม)
- พริกไทยอ่อน: 3 ช่อเล็ก (10 กรัม)
- น้ำมันพืช: 3 ช้อนชา (15 กรัม)
- น้ำปลา: 1/4 ช้อนชา (1.25 กรัม)
- น้ำตาลปี๊บ: 1/3 ช้อนชา (2 กรัม)

วิธีทำ
1. หั่นไข่ขาวต้มสุก 1 ฟองเป็นลูกเต๋าขนาดพอสวย คั่วด้วยไฟปานกลางพอเป็นสีเหลืองนวล ตักขึ้นพักไว้
2. โขลกกระเทียมและพริกบางใหญ่แห้งจนละเอียดและเข้ากัน จากนั้นนำไปผัดในน้ำมันจนหอม ใส่ใบมะกรูด, กระชาย แล้วใส่ไข่ขาว ตามด้วยพริกหนุ่ม, พริกชี้ฟ้าสามสี, ใบมะกรูด, ผักชีฝรั่ง, ใบกะเพรา และพริกไทยอ่อน ผัดให้เข้ากัน (ถ้าแห้ง เติมน้ำเปล่าพอขลุกขลิก)
3. ปรุงรสด้วยน้ำตาล, น้ำปลา แล้วจึงใส่ผักชีฝรั่งและใบกะเพรา ยกลงพร้อมเสิร์ฟ`,
			// Region: "ภาคกลาง",
			Image:  "https://i.ytimg.com/vi/dGQwq6GshVw/maxresdefault.jpg",
			Credit: "https://www.youtube.com/watch?v=QluWnJGqMuU&ab_channel=%E0%B8%84%E0%B8%B8%E0%B8%93%E0%B8%AD%E0%B9%89%E0%B8%AD%E0%B8%A1%E0%B8%AA%E0%B8%B2%E0%B8%A3%E0%B8%B4%E0%B8%99%E0%B8%B5%E0%B8%81%E0%B8%B4%E0%B8%99%E0%B8%94%E0%B8%B5%E0%B8%A1%E0%B8%B5%E0%B8%AA%E0%B8%95%E0%B8%B4",
		},
		{
			Title: "หลนกุ้ง ผักสด",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
- เนื้อกุ้งสด ปอกเปลือก สับหยาบๆ: 1 ช้อนโต๊ะ (20 กรัม)
- น้ำกะทิ: 2 ช้อนโต๊ะ (30 กรัม)
- หอมแดงซอย: 1 ช้อนโต๊ะ (15 กรัม)
- พริกหนุ่มสด (พริกชี้ฟ้าสดเขียว/แดง/เหลือง): อย่างละ 1 ดอก (รวม 15 กรัม)
- ตะไคร้อ่อนซอยบาง: 2 ช้อนชา (10 กรัม)
- ใบมะกรูดอ่อนหั่นฝอย: 2 ช้อนชา (4 กรัม)
- มะขามเปียก: 10 กรัม (ละลายเนื้อมะขาม 10 กรัมในน้ำ 3 ช้อนโต๊ะ)
- น้ำตาลปี๊บ: 1/4 ช้อนชา (2 กรัม)
- เนื้อแตงกวาหั่น: 1/2 ลูก (20 กรัม)
- ขมิ้นขาวหั่น: 10 แว่น (20 กรัม)
- ผักกาดขาวหั่น: 1/2 ก้าน (10 กรัม)
- ถั่วฝักยาวหั่น: 1 ฝัก (10 กรัม)
- เกลือป่น: 1/8 ช้อนชา (0.5 กรัม)

วิธีทำ
1. เคี่ยวน้ำกะทิด้วยไฟปานกลาง ใส่กุ้งสับ พอสุก ใส่หอมแดงทั้งหมด, ตะไคร้ซอย 1 ช้อนชา, ใบมะกรูดซอย 1 ช้อนชา คลุกเคล้าให้เข้ากัน
2. ใส่พริกหนุ่ม, พริก 3 สี (เหลือไว้แต่งหน้าอย่างละ 2-3 ชิ้น) แล้วปรุงรสด้วยน้ำตาล, น้ำมะขามเปียก
3. พอสุก ตักใส่ถ้วย ตกแต่งโรยหน้าด้วยพริกสี, ตะไคร้ซอย, ใบมะกรูดซอย ตกแต่งด้วยผักให้สวยงาม`,
			// Region: "ภาคกลาง",
			Image:  "https://www.bloggang.com/data/jazzy-bong/picture/1436528038.jpg",
			Credit: "https://www.bloggang.com/m/mainblog.php?id=jazzy-bong&month=11-07-2015&group=28&gblog=20",
		},
		{
			Title: "ข้าวผัดเบญจรงค์",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
- ข้าวสวย: 1.5 ทัพพี (80 กรัม)
- สันในไก่หั่นลูกเต๋าเล็ก: 1 ช้อนโต๊ะ (30 กรัม)
- แครอทหั่นลูกเต๋าเล็ก: 1 ช้อนโต๊ะ (10 กรัม)
- หอมใหญ่หั่นลูกเต๋าเล็ก: 1 ช้อนโต๊ะ (10 กรัม)
- เห็ดหอมหั่นลูกเต๋าเล็ก: 1 ช้อนโต๊ะ (10 กรัม)
- เมล็ดข้าวโพดหวานต้มสุก: 1 ช้อนโต๊ะ (10 กรัม)
- ถั่วฝักยาวหั่นลูกเต๋าเล็ก: 1 ช้อนโต๊ะ (10 กรัม)
- แตงกวาหั่น: 1/2 ผลเล็ก (15 กรัม)
- ต้นหอม: 1 ต้นเล็ก (40 กรัม)
- น้ำมันรำข้าว: 2 ช้อนชา (10 กรัม)
- ซีอิ๊วขาว: 1/2 ช้อนชา (3 กรัม)
- พริกไทย: เล็กน้อย

วิธีทำ
1. ตั้งกระทะใส่น้ำมันบนไฟกลางพอร้อน ใส่หอมใหญ่, เห็ดหอมลงไปผัดพอหอม
2. ใส่สันในไก่, แครอท, ถั่วฝักยาว ผัดจนสุก และใส่เมล็ดข้าวโพดหวาน
3. ใส่ข้าวสวยปรุงรสด้วยซีอิ๊วขาว ผัดให้เข้ากัน ตักใส่จาน โรยด้วยพริกไทย ตกแต่งด้วยแตงกวา, ต้นหอม`,
			// Region: "ภาคกลาง",
			Image:  "https://img.wongnai.com/p/1920x0/2021/02/19/4ebb3ee1417746ba8f552a195f26e908.jpg",
			Credit: "https://www.sanook.com/women/tag/%E0%B8%82%E0%B9%89%E0%B8%B2%E0%B8%A7%E0%B8%9C%E0%B8%B1%E0%B8%94%E0%B8%81%E0%B8%B8%E0%B9%89%E0%B8%87/",
		},
		{
			Title: "ปลาสามรส",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
- เนื้อปลากะพงหั่นเป็นชิ้น: 2 ช้อนโต๊ะ (25 กรัม)
- พริกชี้ฟ้าแดง: 2 เม็ด (10 กรัม)
- หอมใหญ่หั่นสี่เหลี่ยมเล็ก: 2 ช้อนโต๊ะ (20 กรัม)
- มะเขือเทศหั่นสี่เหลี่ยมเล็ก: 2 ช้อนโต๊ะ (20 กรัม)
- มันฝรั่งหั่นสี่เหลี่ยมเล็ก: 1 ช้อนโต๊ะ (10 กรัม)
- น้ำตาลปี๊บ: 1/2 ช้อนโต๊ะ (10 กรัม)
- น้ำมะขามเปียก: 2 ช้อนโต๊ะ (20 กรัม)
- กระเทียม: 1/2 ช้อนชา (2 กรัม)
- พริกไทย: 5 เม็ด (1 กรัม)
- น้ำมันรำข้าว: 2 ช้อนชา (10 กรัม)
- น้ำปลา: 1/2 ช้อนชา (2 กรัม)
- น้ำต้มสุก: 1/4 ถ้วยตวง (60 กรัม)
- ผักชีเด็ดใบสำหรับตกแต่ง

วิธีทำ
1. ตั้งกระทะให้ร้อน ทอดปลากะพงให้เหลือง ตักขึ้นพักไว้
2. โขลกกระเทียม, พริกไทย, พริกสดพอหยาบ ใส่น้ำซุปลงไปเล็กน้อย ผัดให้หอม
3. ใส่หอมใหญ่, มันฝรั่ง, มะเขือเทศ ปรุงรสด้วยน้ำตาลปี๊บ, น้ำมะขาม, น้ำปลา
4. นำปลาที่ทอดไว้จัดใส่จาน ราดซอสบนปลาที่ทอดแล้ว แต่งหน้าด้วยผักชีและพริกชี้ฟ้าแดง`,
			// Region: "ภาคกลาง",
			Image:  "https://chefoldschool.com/wp-content/uploads/2020/06/p45.jpg",
			Credit: "https://shop.line.me/@nuy98/product/1000746977",
		},
		{
			Title: "ยำใหญ่",
			Description: `ส่วนประกอบ (ต่อ 3 ที่)
- ไข่ขาวต้มปอกเปลือกผ่าสี่: 1 ฟอง (30 กรัม)
- ปลาหมึกสดหั่น: 1/4 ถ้วยตวง (40 กรัม)
- กุ้งสดปอกเปลือกผ่าหลัง: 3 ตัว (40 กรัม)
- แครอทฝานบางๆ: 1/2 ถ้วยตวง (20 กรัม)
- หอมใหญ่หั่น: 1/2 ถ้วยตวง (40 กรัม)
- หัวไชเท้าฝานบางๆ: 1/4 ถ้วยตวง (40 กรัม)
- แตงกวาฝานบางๆ: 1/2 ถ้วยตวง (40 กรัม)
- ขึ้นฉ่ายหั่น: 1/4 ถ้วยตวง (20 กรัม)

ส่วนประกอบน้ำปรุงรส (ต่อ 3 ที่)
- พริกชี้ฟ้าแดงโขลกหยาบ: 3 เม็ด (20 กรัม)
- น้ำมะนาว: 2 ช้อนโต๊ะ (30 กรัม)
- น้ำปลา: 1/2 ช้อนชา (3 กรัม)
- น้ำตาลทราย: 2 ช้อนชา (10 กรัม)
วิธีทำ
1. ลวกปลาหมึกสด, กุ้งสดในน้ำเดือด จากนั้นตักขึ้นพักไว้ให้สะเด็ดน้ำ
2. ผสมน้ำปลา, น้ำตาลทราย เติมน้ำเล็กน้อย คนพอเข้ากัน ใส่พริกสดที่โขลกละเอียดแล้ว จากนั้นเคี่ยวบนไฟพอเดือดทิ้งให้เย็น ใส่น้ำมะนาว
3. ผสมปลาหมึกสด, กุ้งสด, ไข่ขาว, แครอท, หอมใหญ่, แตงกวา, หัวไชเท้า และน้ำยำในข้อ 2 คลุกให้เข้ากัน จากนั้นตักใส่จาน ยกขึ้นเสิร์ฟ`,
			// Region: "ภาคกลาง",
			Image:  "https://img.wongnai.com/p/1920x0/2018/09/11/60880f95ecfd4ff68756ec9e680a6f3f.jpg",
			Credit: "https://www.wongnai.com/recipes/mixed-spicy-salad-recipe",
		},

		{
			Title: "ต้มจับฉ่ายหมูสันนอก",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- หมูสันนอกหั่นชิ้น: 4 ช้อนโต๊ะ (60 กรัม)
- หัวไชเท้า: 1/2 ถ้วยตวง (50 กรัม)
- เห็ดฟาง: 1/2 ถ้วยตวง (50 กรัม)
- กะหล่ำปลี: 1/2 ถ้วยตวง (40 กรัม)
- ต้นกระเทียม: 1/2 ถ้วยตวง (30 กรัม)
- ผักโขม: 1/2 ถ้วยตวง (30 กรัม)
- ขึ้นฉ่าย: 1/2 ถ้วยตวง (30 กรัม)
- คะน้า: 1/2 ถ้วยตวง (30 กรัม)
- ผักกาดขาว: 1/2 ถ้วยตวง (30 กรัม)
- ผักกวางตุ้ง: 1/2 ถ้วยตวง (30 กรัม)
- กระเทียม: 10 กรัม
- น้ำมันรำข้าว: 2 ช้อนชา (10 กรัม)
- น้ำตาลปี๊บ: 1 ช้อนชา (5 กรัม)
- ซีอิ๊วดำ: 1/2 ช้อนชา (3 กรัม)
- ซีอิ๊วขาว: 1 ช้อนชา (5 กรัม)
- น้ำเปล่า: 3 ถ้วยตวง (750 กรัม)
  วิธีทำ
1. ล้างผักทุกชนิดด้วยน้ำสะอาด สะเด็ดน้ำให้แห้ง
2. หั่นผักทุกชนิดเป็นชิ้นใหญ่ๆ
3. ทุบกระเทียมพอแตก นำลงผัดในน้ำมันให้หอม ใส่เนื้อหมูลงผัด เคี่ยวหมูจนนุ่ม ใส่น้ำตาลปี๊บผัดให้หอมจนน้ำตาลละลาย
4. ใส่ซีอิ๊วขาว, ซีอิ๊วดำ ผัดไปเรื่อยๆ เติมผักที่หั่นลงไป ผัดต่อประมาณ 10 นาที
5. เติมน้ำต้มสุกให้ปริมาณน้ำต่ำกว่าผักเล็กน้อย ต้มไฟอ่อนๆ ต่อจนผักเปื่อย แล้วตักใส่ชามพร้อมเสิร์ฟ`,
			// Region: "ภาคกลาง",
			Image:  "https://static.thairath.co.th/media/dFQROr7oWzulq5Fa5LJGNmDUIqkiQVkYDqXcFTh41EztNktBWbceEb2EWQpvlrKxcWU.jpg",
			Credit: "https://shorturl.at/Wdgo0",
		},

		{
			Title: "ผัดผักรวมไข่ขาว",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
- ไข่ไก่ไข่ขาว: 3 ช้อนโต๊ะ (30 กรัม)
- น้ำมันพืชสำหรับทอดไข่: 1 ช้อนชา (5 กรัม)
- ผักกาดขาว: 1 ถ้วยตวง (70 กรัม)
- ถั่วฝักยาวหั่นท่อน: 2 ช้อนโต๊ะ (20 กรัม)
- แครอทหั่นสี่เหลี่ยม: 1 ช้อนโต๊ะ (10 กรัม)
- กระเทียมสับ: 1 ช้อนชา (5 กรัม)
- ซีอิ๊วขาว: 1/4 ช้อนชา (1.25 กรัม)
- น้ำมันพืชสำหรับผัด: 1 ช้อนชา (5 กรัม)
วิธีทำ
1. ทอดไข่ขาวให้พอเหลือง หั่นเป็นสี่เหลี่ยม
2. ล้างผักต่างๆ ให้สะอาด
3. ตั้งไฟ เจียวกระเทียมให้เหลืองหอม ใส่ถั่วฝักยาว, แครอท, ผักกาดขาว, ไข่ขาว แล้วผัดให้สุก
4. ปรุงรสด้วยซีอิ๊วขาว คนให้เข้ากันพอสุกยกลง`,
			// Region: "ภาคกลาง",
			Image:  "https://img.kapook.com/u/2018/surauch/cooking/co1/pk2.jpg",
			Credit: "https://cooking.kapook.com/view207896.html",
		},

		{
			Title: "ไข่ยัดไส้กะเพราหอม",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
- ไข่ขาวดิบ: 4 1/2 ช้อนโต๊ะ (45 กรัม)
- นมสดพร่องมันเนย: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำมันพืชสำหรับผัด: 1 ช้อนชา (5 กรัม)
- กระเทียม: 1 ช้อนชา (5 กรัม)
- พริกขี้หนูสับ: 1/2 ช้อนชา (3 กรัม)
- หอมใหญ่: 1 ช้อนโต๊ะ (15 กรัม)
- เห็ดฟาง: 2 ช้อนโต๊ะ (20 กรัม)
- ใบกะเพรา: 1 ช้อนโต๊ะ (15 กรัม)
- ซีอิ๊วขาว: 1/5 ช้อนชา (1 กรัม)
- น้ำมันพืชสำหรับทอด: 1 ช้อนชา (5 กรัม)
วิธีทำ 
1. ตั้งกระทะใส่น้ำมันพอร้อน ใส่กระเทียมสับ, พริกขี้หนูสับ, หอมใหญ่ ผัดพอหอม ใส่เห็ดฟาง ผัดให้เข้ากันใส่ใบกะเพรา ปรุงรสด้วยซีอิ๊วขาว ยกลงพักไว้
2. ผสมไข่ขาวกับนมสดคนให้เข้ากัน
3. ตั้งกระทะพอร้อน ใส่ไข่ที่ผสมแล้ว ทอดแผ่ให้ทั่วกระทะใส่ส่วนผสมข้อที่ 1 วางตรงกลางไข่ เสร็จแล้วจึงค่อยๆ ห่อไข่เป็นรูปสี่เหลี่ยม พอสุกยกลงเสิร์ฟพร้อมผักต่างๆ`,
			// Region: "ภาคกลาง",
			Image:  "https://img.wongnai.com/p/1968x0/2020/03/24/524ed43d3e914520934b9f277820f00b.jpg",
			Credit: "https://www.wongnai.com/recipes/ugc/08e2db7d1ac74e20b284c21388751dbd",
		},
		{
			Title: "ขนมจีนน้ำยาปักษ์ใต้",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- เนื้อปลาต้มหรือนึ่งสุก: 8 ช้อนโต๊ะ (120 กรัม) (ใช้ปลาช่อน หรือปลาทะเลเช่นปลาน้ำดอกไม้หรือปลาทูสด)
- น้ำพริกน้ำยาแกงปักษ์ใต้: 1 ช้อนโต๊ะ (15 กรัม)
- กะทิ: 1/2 ถ้วย (120 กรัม)
- น้ำเปล่า หรือหางกะทิ: 1.5 ถ้วย (360 กรัม)
- น้ำตาลปี๊บ: 1 ช้อนชา (5 กรัม)
- น้ำปลาดี: 1 ช้อนชา (5 กรัม)
- ใบมะกรูด (ฉีกเป็นชิ้นเล็ก): 5 ใบ (5 กรัม)
- ขนมจีน (คนละ 1.5 จับ หรือ 135 กรัม): 540 กรัม
- ผักเคียง: แตงกวาหั่นเป็นชิ้น 2 ลูก (50 กรัม), ถั่วฝักยาวหั่นเป็นท่อน 3 ผักใหญ่ (35 กรัม), ยอดมะม่วงหิมพานต์ 7 ยอด (40 กรัม)

วิธีทำ
1. นำเนื้อปลาต้มสุกแกะเอาแต่เนื้อมาโขลกรวมกันกับพริกแกงน้ำยาให้เป็นเนื้อเดียวกัน พักไว้
2. นำหางกะทิหรือน้ำเปล่า 1.5 ถ้วยตั้งไฟใช้ไฟปานกลาง คนให้เดือด ใส่เนื้อปลาที่โขลกรวมกับพริกแกง ละลายคนให้เข้ากัน
3. ใส่ใบมะกรูดที่ฉีกเป็นชิ้นเล็ก ๆ ลงในน้ำยา ปรุงรสด้วยน้ำตาลปี๊บ และน้ำปลาดี ชิมรส คนให้เข้ากัน เติมกะทิ 1/2 ถ้วย คนจนเดือด ยกลงเสิร์ฟพร้อมขนมจีน และผักเคียง

หมายเหตุ: กรณีผู้ป่วยเบาหวาน สามารถเพิ่มรสหวานโดยใส่น้ำตาลเทียมแทนน้ำตาลปี๊บและน้ำตาลทราย`,
			// Region: "ภาคใต้",
			Image:  "https://img.kapook.com/u/2017/surauch/cooking/y1_4.jpg",
			Credit: "https://shorturl.at/TpDA3",
		},
		{
			Title: "น้ำพริกแกงปักษ์ใต้",
			Description: `ส่วนประกอบ (ต่อ 13 ช้อนโต๊ะ)
- พริกขี้หนูแห้ง: 22 เม็ด (18 กรัม)
- ตะไคร้หั่นซอย: 5 ต้น (50 กรัม)
- ขมิ้นสด: 2 แง่ง (40 กรัม)
- หอมแดงปอกเปลือก: 5 หัว (25 กรัม)
- กระเทียม: 40 กลีบ (50 กรัม)
- ข่าหั่นละเอียด: 5 แว่น (10 กรัม)
- ผิวมะกรูดหั่นซอยเป็นชิ้นเล็ก: 10 กรัม
- เกลือป่น: 1/2 ช้อนชา (2.5 กรัม)
- พริกไทยเม็ด: 15 เม็ด (15 กรัม)
- กะปิ: 4 ช้อนชา (20 กรัม)

วิธีทำ
1. นำทุกอย่างยกเว้นกะปิ โขลกรวมกันในครกให้ละเอียด
2. ใส่กะปิโขลกให้เข้ากันพักไว้เพื่อนำไปปรุงน้ำยา

หมายเหตุ: สูตรน้ำพริกนี้เมื่อทำเสร็จจะได้ 195 กรัม (13 ช้อนโต๊ะ) สามารถนำไปเป็นเครื่องปรุงน้ำพริกแกงคั่ว น้ำยาปักษ์ใต้ ผัดเผ็ด คั่วกลิ้ง หรือแกงไตปลา ฯลฯ`,
			// Region: "ภาคใต้",
			Image:  "https://jeeor.com/wp-content/uploads/2023/08/%E0%B8%A0%E0%B8%B2%E0%B8%9E%E0%B8%9B%E0%B8%81%E0%B8%AB%E0%B8%99%E0%B9%89%E0%B8%B2%E0%B9%84%E0%B8%95%E0%B8%9B%E0%B8%A5%E0%B8%B2-Recovered.jpg",
			Credit: "https://jeeor.com/?page_id=3444",
		},
		{
			Title: "คั่วกลิ้งหมู",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- หมูเนื้อแดง บดละเอียด: 6 1/3 ช้อนโต๊ะ (100 กรัม)
- น้ำพริกแกงปักษ์ใต้: 4 ช้อนชา (20 กรัม)
- น้ำเปล่า: 1/4 ถ้วยตวง (60 กรัม)
- พริกไทยสด: 5 ช่อ (20 กรัม)
- ตะไคร้หั่นฝอย: 1 ช้อนโต๊ะ (15 กรัม)
- ข่าสดสับละเอียด: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำปลาดี: 1 ช้อนชา (5 กรัม)
- น้ำตาลปี๊บ: 1 ช้อนชา (5 กรัม)
- พริกชี้ฟ้าแดงหั่นเป็นเส้นสำหรับโรยหน้า: 1 เม็ด (3 กรัม)
- ใบมะกรูดหั่นฝอยละเอียด: 5 ใบ (5 กรัม)
- ผักสด: แตงกวาหั่นเป็นชิ้น 1 ผล (30 กรัม), ถั่วฝักยาว 3 ผัก (30 กรัม), ยอดมะม่วงหิมพานต์ 8 ยอด (40 กรัม), ยอดมันปู 5 ยอด (30 กรัม)

วิธีทำ
1. ใส่น้ำเปล่าลงในกระทะ ตั้งไฟพอร้อนใส่เนื้อหมูสับลงไปผัดจนเกือบสุก
2. จากนั้นใส่น้ำพริกคั่วกลิ้งลงไปผัดกับหมูสับให้เข้ากัน ปรุงรสด้วยน้ำตาลปี๊บ และน้ำปลา ผัดให้เข้ากัน
3. ปิดไฟแล้วใส่พริกไทยอ่อน, ตะไคร้หั่นฝอย ข่าสดสับ พริกชี้ฟ้าแดงหั่น และใบมะกรูดซอยลงไปผัดให้เข้ากัน ตักใส่จาน เสิร์ฟพร้อมกับผักสดตามชอบ`,
			// Region: "ภาคใต้",
			Image:  "https://www.unileverfoodsolutions.co.th/dam/global-ufs/mcos/SEA/calcmenu/recipes/TH-recipes/red-meats-&-red-meat-dishes/%E0%B8%84%E0%B8%B1%E0%B9%88%E0%B8%A7%E0%B8%81%E0%B8%A5%E0%B8%B4%E0%B9%89%E0%B8%87%E0%B8%AB%E0%B8%A1%E0%B8%B9/%E0%B8%84%E0%B8%B1%E0%B9%88%E0%B8%A7%E0%B8%81%E0%B8%A5%E0%B8%B4%E0%B9%89%E0%B8%87%E0%B8%AB%E0%B8%A1%E0%B8%B9_header.jpg",
			Credit: "https://www.unileverfoodsolutions.co.th/th/recipe/%E0%B8%84%E0%B8%B1%E0%B9%88%E0%B8%A7%E0%B8%81%E0%B8%A5%E0%B8%B4%E0%B9%89%E0%B8%87%E0%B8%AB%E0%B8%A1%E0%B8%B9-R90018816.html",
		},
		{
			Title: "ต้มกะทิผักเหลียงกุ้งสด",
			Description: `ส่วนประกอบเครื่องปรุง (ต่อ 3 ที่)
- หอมแดง: 5 หัว (25 กรัม)
- กะปิ: 1 ช้อนชา (5 กรัม)
- พริกไทย: 20 เม็ด (8 กรัม)

ส่วนประกอบต่อ 3 ที่
- กะทิคั้น: 1/2 ถ้วยตวง (120 กรัม)
- น้ำเปล่าหรือหางกะทิ: 1 ถ้วยตวง (240 กรัม)
- ผักเหลียงเด็ดเอาแต่ใบ: 100 กรัม
- กุ้งสดปอกเปลือก หั่นเป็นชิ้นสั้นขนาด 1 ซม.: 8 ตัว (80 กรัม)
- น้ำตาลปี๊บ: 1 ช้อนชา (5 กรัม)
- น้ำปลาดี: 1/2 ช้อนชา (2.5 กรัม)

วิธีทำ
1. ล้างผักเหลียงให้สะอาด สะเด็ดน้ำ เด็ดเอาแต่ใบ หากใบใหญ่ให้ฉีกให้เล็กลง
2. โขลกหอมแดง กะปิ พริกไทย จนละเอียด และเข้ากัน
3. นำหางกะทิตั้งไฟพอใกล้เดือดใส่เครื่องปรุงรสที่โขลกละลายคนให้เข้ากัน
4. พอเดือดใส่ใบผักเหลียง กะทิ น้ำตาลปี๊บ น้ำปลาดี เมื่อน้ำเดือด เคี่ยวต่อสักพัก
5. หมั่นคนกะทิบ่อยๆ อย่าให้กะทิแตกมัน
6. ใส่กุ้งสด เร่งไฟให้แรง จะช่วยป้องกันผักเหม็นเขียวได้ เติมหัวกะทิคนไม่ให้กะทิแตกมัน เมื่อกะทิเดือดอีกครั้ง ยกลงตักเสิร์ฟ`,
			// Region: "ภาคใต้",
			Image:  "https://img.wongnai.com/p/1920x0/2017/10/13/c4cd67bcd224401f800730cd9e4f3d02.jpg",
			Credit: "https://nlovecooking.com/%E0%B9%83%E0%B8%9A%E0%B9%80%E0%B8%AB%E0%B8%A5%E0%B8%B5%E0%B8%A2%E0%B8%87%E0%B8%95%E0%B9%89%E0%B8%A1%E0%B8%81%E0%B8%B0%E0%B8%97%E0%B8%B4/",
		},
		{
			Title: "ผัดผักเหลียงไข่ขาว",
			Description: `ส่วนประกอบ (ต่อ 3 ที่)
- ผักเหลียง: 2 กำ (120 กรัม)
- ไข่ขาว: 3 ฟอง (105 กรัม)
- น้ำตาลทราย: 1 ช้อนชา (5 กรัม)
- น้ำมันหอย: 1 ช้อนชา (5 กรัม)
- ซีอิ๊วขาว: 1/2 ช้อนชา (2.5 กรัม)
- พริกไทยป่น: 1/2 ช้อนชา (2.5 กรัม)
- กระเทียมสับละเอียด: 2 ช้อนชา (10 กรัม)
- น้ำมันพืช: 3 ช้อนชา (15 กรัม)
- น้ำเปล่า: 6 ช้อนโต๊ะ (90 กรัม)

วิธีทำ
1. ล้างผักเหลียงให้สะอาด สะเด็ดน้ำ เด็ดเอาแต่ใบ หากใบใหญ่ให้ฉีกให้เล็กลง
2. ตอกไข่ไก่แยกไข่ขาว-ไข่แดง เติมน้ำเปล่า 50 ซีซี ตีผสมให้เข้ากันแล้วพักไว้
3. ตั้งกระทะ ใส่น้ำมัน ตั้งไฟกลาง รอน้ำมันอุ่น จากนั้นนำกระเทียมลงไปเจียวพอหอม หรือเริ่มเหลือง
4. เทไข่ขาวลงในกระทะคนให้สุก ใส่ใบเหลียงลงไป พร้อมน้ำเปล่า 30 ซีซี ผัดให้สุก
5. ใส่เครื่องปรุงรส น้ำมันหอย ซีอิ๊วขาว น้ำตาลทราย คนให้เข้ากันยกลงตักเสิร์ฟ
6. โรยหน้าด้วยพริกไทยป่น`,
			// Region: "ภาคใต้",
			Image:  "https://img.wongnai.com/p/1920x0/2019/03/07/fd1ee1e79c1043c281b46c47b8f8f6e6.jpg",
			Credit: "https://www.wongnai.com/recipes/ugc/330d0ad616a2490ebdbef06a61f86835",
		},
		{
			Title: "แกงเหลืองสับปะรดปลากะพง",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- น้ำเปล่า: 2 ถ้วย (480 กรัม)
- น้ำพริกแกงเหลือง: 1 ช้อนโต๊ะ (15 กรัม)
- สับปะรดหั่นเป็นชิ้น: 1/2 ลูก (250 กรัม)
- เนื้อปลากะพง: 1/2 ถ้วย (120 กรัม)
- น้ำมะขามเปียก: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำมะนาว: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำตาลปี๊บ: 2 ช้อนชา (10 กรัม)
- น้ำตาลทราย: 2 ช้อนชา (10 กรัม)
- ส้มแขก: 3 กรัม (3 กรัม)
- น้ำปลาดี: 1 ช้อนชา (5 กรัม)

วิธีทำ
1. ต้มน้ำเปล่าพอเดือด ใส่น้ำพริกแกงเหลืองคนให้เข้ากัน
2. ใส่สับปะรด ต้มด้วยไฟอ่อน ประมาณ 20 นาที
3. ใส่เนื้อปลากะพง ปิดฝาหม้อ รอให้เดือดและปลาสุก เปิดฝา คนพอเข้ากัน
4. ปรุงรสด้วยน้ำมะขามเปียก น้ำตาลทราย น้ำตาลปี๊บ ชิมรส และใส่น้ำมะนาว
5. คนให้เข้ากัน ยกลงตักเสิร์ฟ

หมายเหตุ: รสหวานของแกงเหลืองขึ้นอยู่กับความสุกของสับปะรด ดังนั้นควรค่อยๆ ปรุงน้ำตาลทีละน้อย`,
			// Region: "ภาคใต้",
			Image:  "https://img.wongnai.com/p/1920x0/2019/11/30/b3f5f4b444cd446aab4fc25d8b87880c.jpg",
			Credit: "https://www.wongnai.com/recipes/ugc/aafcebb8d02d4b69a84a05a69e128a4e",
		},
		{
			Title: "พริกแกงเหลือง",
			Description: `ส่วนประกอบพริกแกง (ต่อ 6 ช้อนโต๊ะ)
- พริกขี้หนูแห้ง: 12 เม็ด (10 กรัม)
- หอมแดง: 8 หัว (40 กรัม)
- กระเทียม: 16 กลีบ (20 กรัม)
- กะปิ: 2 ช้อนชา (10 กรัม)
- เกลือป่น: 1/2 ช้อนชา (2.5 กรัม)
- ข้าวสาร: 20 กรัม

วิธีทำ
1. นำทุกอย่างยกเว้นกะปิ โขลกรวมกันในครกให้ละเอียด
2. ใส่กะปิโขลกให้เข้ากัน พักไว้เพื่อนำไปแกง

หมายเหตุ: สูตรน้ำพริกนี้เมื่อทำเสร็จจะได้ 90 กรัม (6 ช้อนโต๊ะ) ข้าวสารทำให้แกงมีน้ำข้นนำไปเป็นเครื่องปรุงน้ำพริกแกงเหลืองใส่ผัก และปลาหรือกุ้งสดได้หลากหลาย เช่น แกงเหลืองมะละกอใส่กุ้งสด หรือแกงเหลืองสับปะรดใส่ปลาช่อน 
หรือแกงเหลืองยอดมะพร้าวใส่ปลากะพง ฯลฯ`,
			// Region: "ภาคใต้",
			Image:  "https://www.thaimee-d.com/pub/media/catalog/product/cache/9ef2995c1c404cd4852076153399d50d/f/i/file_17_3.jpg",
			Credit: "https://www.lazada.co.th/products/500-i4821168369.html",
		},

		{
			Title: "น้ำพริกกุ้งสด",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- กะปิ: 2 1/3 ช้อนชา (13 กรัม)
- กุ้งสด: 8 ตัว (80 กรัม)
- กระเทียมแกะเปลือก: 1 1/2 หัว (25 กรัม)
- น้ำตาลปี๊บ: 4 ช้อนชา (20 กรัม)
- น้ำมะนาว: 3 ช้อนโต๊ะ (45 กรัม)
- พริกขี้หนูสวน: 8 เม็ด (10 กรัม)
- หอมแดงซอย: 8 หัว (40 กรัม)
- ผักจิ้มน้ำพริก: แตงกวา 1 ลูกใหญ่ (30 กรัม), ถั่วพูต้มสุก 4 ฝัก (30 กรัม), ใบมะม่วงหิมพานต์ 6 ยอด (30 กรัม), ลูกเนียง 1 ลูก (10 กรัม), สะตอ 2 เม็ด (10 กรัม)

วิธีทำ
1. นำกุ้งไปต้มให้สุก แกะเอาแต่เนื้อ แล้วหั่นเป็นชิ้นเล็กๆ
2. นำกะปิห่อใบตองปิ้งให้สุกหอมพักไว้
3. นำกะปิที่ปิ้งไว้ กระเทียม และพริกขี้หนู โขลกหยาบๆ ในครก แบ่งเนื้อกุ้งมา 1 ใน 3 ส่วน ใส่ลงไปโขลกพร้อมน้ำพริก ปรุงรสด้วยน้ำตาลปี๊บ และมะนาว ชิมดูให้ออกรสเปรี้ยวหวาน
4. ใส่เนื้อกุ้งที่เหลือ หอมแดงซอยลงไปคลุกเคล้าให้เข้ากัน (ไม่ต้องตำ) จากนั้นตักใส่ถ้วย เสิร์ฟคู่กับผักสด - ผักลวกตามชอบ`,
			// Region: "ภาคใต้",
			Image:  "https://www.gourmetandcuisine.com/Images/cooking/recipes/recipe_502detail.jpg",
			Credit: "https://www.wongnai.com/restaurants/2146372Lg-%E0%B9%80%E0%B8%A2%E0%B8%B5%E0%B9%88%E0%B8%A2%E0%B8%A1%E0%B9%83%E0%B8%95%E0%B9%89-south-cuisine",
		},

		{
			Title: "แกงคั่วหมูใบยี่หร่า",
			Description: `ส่วนประกอบ (ต่อ 2 ที่)
- หมูสันนอกหั่นเป็นชิ้นขนาด 0.5×1.5×1 นิ้ว: 531 ช้อนโต๊ะ (80 กรัม)
- น้ำพริกแกงเหลือง: 31 ช้อนโต๊ะ (20 กรัม)
- น้ำเปล่า: 1 1/2 ถ้วย (360 มิลลิลิตร)
- น้ำปลาดี: 1 ช้อนชา (5 กรัม)
- น้ำตาลปี๊บ: 1 ช้อนชา (5 กรัม)
- ใบมะกรูดฉีกเป็นชิ้นเล็ก: 5 ใบ (5 กรัม)
- ใบยี่หร่า: 20 ใบ (30 กรัม)

วิธีทำ
1. ตั้งน้ำให้ร้อน ใส่หมูเนื้อแดงลงไปต้มจนเดือด
2. เติมน้ำพริกแกงคนให้เข้ากัน แล้วเคี่ยวด้วยไฟอ่อนๆ ใส่ใบมะกรูดลงไป เคี่ยวจนหมูเริ่มเปื่อย
3. ปรุงรสด้วยน้ำปลาดี น้ำตาลปี๊บ เคี่ยวให้เหลือน้ำขลุกขลิก ใส่ใบยี่หร่ายกลงตักเสิร์ฟกับข้าวสวยร้อนๆ`,
			// Region: "ภาคใต้",
			Image:  "https://i.ytimg.com/vi/5WmM3b-gaIY/sddefault.jpg",
			Credit: "https://www.youtube.com/watch?v=5WmM3b-gaIY&ab_channel=EasyYummy",
		},

		{
			Title: "ผัดหมี่กุ้งสด",
			Description: `ส่วนประกอบน้ำพริกผัด (ต่อ 3 ที่)
- พริกชี้ฟ้าแห้งเม็ดใหญ่ เอาไส้ออกแช่น้ำให้นิ่ม: 3 เม็ด (7 กรัม)
- หอมแดง: 4 หัว (20 กรัม)

ส่วนประกอบ (ต่อ 3 ที่)
- ก๋วยเตี๋ยวเส้นเล็กหรือเส้นหมี่ขาว: 180 กรัม
- น้ำกะทิ: 1 ถ้วยตวง (240 กรัม)
- กุ้งสดแกะเปลือกผ่าหลัง: 6 ตัว (60 กรัม)
- น้ำตาลปี๊บ: 5 ช้อนชา (25 กรัม)
- น้ำเปล่า: 100 มิลลิลิตร (100 กรัม)
- น้ำปลาอย่างดี: 1 ช้อนชา (5 กรัม)
- น้ำมะขามเปียก: 1 ช้อนโต๊ะ (15 กรัม)

ผักเคียง (ต่อ 3 ที่)
- ถั่วงอก: 3 ช้อนโต๊ะ (30 กรัม)
- มะม่วงสับหั่นฝอย: 3 ช้อนโต๊ะ (30 กรัม)
- ใบกุยช่าย: 2 ช้อนโต๊ะ (20 กรัม)
- ใบบัวบก: 2 ช้อนโต๊ะ (20 กรัม)

วิธีทำ
1. เตรียมส่วนผสมน้ำพริกผัด โดยนำพริกชี้ฟ้า หอมแดงโขลกรวมกันให้ละเอียด จะได้น้ำพริกสำหรับผัด 25 กรัม พักไว้เพื่อนำไปผัดหมี่
2. นำเส้นก๋วยเตี๋ยวเส้นเล็กหรือเส้นหมี่ขาวแช่น้ำให้นิ่ม สรงใส่ตะแกรงพักไว้
3. ตั้งกระทะใส่กะทิเคี่ยวกับน้ำพริกหมี่ที่โขลกไว้ คนให้เข้ากัน เติมน้ำตาลปี๊บ น้ำมะขามเปียก น้ำปลา คนให้น้ำตาลปี๊บละลาย
4. นำก๋วยเตี๋ยวเส้นเล็กหรือเส้นหมี่ขาวลงผัดกับน้ำแกงผัดหมี่ ใส่กุ้งสดลงผัดให้สุก เติมน้ำเปล่า ผัดคลุกจนเส้นนิ่ม ยกลงจัดใส่จาน รับประทานกับผัก เช่น แตงกวา ใบบัวบก ถั่วงอก ใบกุยช่าย มะนาว มะม่วงสับฝอย หรือลูกมุดสับฝอย`,
			// Region: "ภาคใต้",
			Image:  "https://img.wongnai.com/p/1920x0/2019/11/03/0f27887e3dcf43c9879e6693588e3751.jpg",
			Credit: "https://www.wongnai.com/recipes/ugc/74fb5e3274c24f17b01926ffcf9bcabe",
		},

		{
			Title: "ปลาต้มขมิ้นและข้าวยำปักษ์ใต้",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- ปลาทูสดล้างสะอาด หั่นเป็นชิ้น (ชิ้นละ 30 กรัม): 2 ตัว (120 กรัม)
- ขมิ้นชันล้างสะอาด ปอกผิวออก ทุบหรือหั่นเป็นชิ้น: 12 แว่น (25 กรัม)
- หอมแดง: 5 หัว (25 กรัม)
- ตะไคร้ล้างสะอาดหั่นแฉลบเป็นชิ้น: 4 ต้น (40 กรัม)
- ส้มแขก: 4 ชิ้น (3 กรัม)
- กระเทียมแกะกลีบ: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำมะขามเปียก: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำตาลปี๊บ: 1 ช้อนชา (5 กรัม)
- น้ำตาลทราย: 2 ช้อนชา (10 กรัม)
- เกลือป่น: 1/4 ช้อนชา (1.5 กรัม)
- พริกขี้หนูสดบุบพอแตก: 4 เม็ด (5 กรัม)
- น้ำเปล่า: 2 ถ้วยตวง (480 กรัม)

ส่วนประกอบข้าวยำปักษ์ใต้ (ต่อ 1 ที่)
- มะพร้าวคั่ว: 2 ช้อนโต๊ะ (30 กรัม)
- กุ้งแห้งป่น: 1 ช้อนชา (5 กรัม)
- ตะไคร้หั่นฝอย: 2 ช้อนโต๊ะ (30 กรัม)
- ถั่วฝักยาวหั่นฝอย: 3 ฝัก (30 กรัม)
- ใบมะกรูดหั่นฝอย: 10 ใบ (10 กรัม)
- ใบชะพลูหั่นฝอย: 12 ใบ (20 กรัม)
- มะม่วงดิบสับหั่นฝอย: 2 ช้อนโต๊ะ (30 กรัม)
- ส้มโอแกะกลีบ: 2 กลีบ (30 กรัม)
- ถั่วงอกเด็ดหาง: 2 ช้อนโต๊ะ (15 กรัม)
- ถั่วพูหั่นฝอย: 3 ช้อนโต๊ะ (30 กรัม)
- แครอทหั่นฝอย: 2 ช้อนชา (10 กรัม)
- พริกขี้หนูปั่นละเอียด: 1/2 ช้อนชา (2 กรัม)
- ข้าวสวย: 1/3 ถ้วย (55 กรัม)
- น้ำบูดู: 1 2/3 ช้อนโต๊ะ (25 กรัม)

วิธีทำ
1. ตั้งหม้อใส่น้ำเปล่า ตะไคร้ ขมิ้น หอมแดงบุบ และกระเทียม ตั้งไฟเคี่ยวจนมีกลิ่นหอมและสีขมิ้นออก
2. พอเดือด ใส่ส้มแขก เกลือป่น น้ำตาลปี๊บ น้ำตาลทราย และน้ำมะขามเปียก เคี่ยวสักพัก
3. ใส่ปลาทูต้มจนสุก
4. ใส่พริกขี้หนูสด ยกลงตักเสิร์ฟ`,
			// Region: "ภาคใต้",
			Image:  "https://i.ytimg.com/vi/S3V3tA18wAY/maxresdefault.jpg",
			Credit: "https://www.youtube.com/watch?v=S3V3tA18wAY&ab_channel=%E0%B8%84%E0%B8%A3%E0%B8%B1%E0%B8%A7%E0%B8%9E%E0%B8%B5%E0%B9%88%E0%B8%81%E0%B8%B1%E0%B8%8D%E0%B8%8D%E0%B9%8CKruaP%27gunn",
		},
		{
			Title: "ข้าวยำปักษ์ใต้และน้ำบูดู",
			Description: `วิธีทำข้าวยำปักษ์ใต้
ผสมน้ำบูดูในข้าวสวย คลุกเคล้าจนทั่ว ใส่มะพร้าวคั่ว กุ้งแห้งป่น ใส่ผักทุกอย่างลงไปคลุกให้เข้ากัน เติมพริกขี้หนูแห้งปั่น หากชอบเปรี้ยวปรุงรสด้วยน้ำมะนาวตามชอบ
ส่วนประกอบน้ำบูดู (ต่อ 24 ช้อนโต๊ะ)
- น้ำตาลปี๊บ: 4 ช้อนโต๊ะ (60 กรัม)
- ตะไคร้: 2 1/2 ต้น (25 กรัม)
- หอมแดง: 6 หัว (30 กรัม)
- ข่าสด: 5 แว่น (10 กรัม)
- น้ำบูดู: 2 ช้อนโต๊ะ (30 กรัม)
- ซีอิ๊วแดงหวาน: 1/2 ช้อนชา (3 กรัม)
- น้ำเปล่า: 2 ถ้วยตวง (480 มิลลิลิตร)

ส่วนประกอบข้าวยำ (ต่อ 4 ที่)
- ผักหวานเด็ดใบอ่อน: 3 ถ้วยตวง (100 กรัม)
- ผักติ้ว: 5 ยอด (5 กรัม)
- ไข่มดแดง: 6 ช้อนโต๊ะ (120 กรัม)
- ปลาช่อน: 6 ช้อนโต๊ะ (90 กรัม)
- เกลือ: 1/6 ช้อนชา (0.75 กรัม)
- น้ำปลาร้า: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำเปล่า: 2 ถ้วยตวง (400 กรัม)
- พริกขี้หนูสด: 5 - 6 เม็ด (5 กรัม)
- หอมแดงซอย: 10 ช้อนชา (50 กรัม)
- ตะไคร้: 6 ช้อนชา (30 กรัม)

วิธีทำน้ำบูดู
1. นำน้ำเปล่าเทใส่หม้อต้มให้เดือด
2. ใส่เครื่องสมุนไพรทั้งหมดลงไปต้มให้กลิ่นหอม
3. เติมน้ำตาลปี๊บลงไปแล้วคนจนละลาย
4. ใส่น้ำบูดู แต่งสีให้เข้มด้วยซีอิ๊วแดงหวาน
5. เคี่ยวต่อประมาณ 5 นาที ยกลงพักไว้

หมายเหตุ: น้ำบูดูสูตรนี้จะได้ปริมาณ 360 มิลลิลิตร หรือ 24 ช้อนโต๊ะ มีรสหวานนำและมีกลิ่นของสมุนไพรจากข่า ตะไคร้ หอมแดง เมื่อนำไปผสมกับข้าวสวยและเครื่องข้าวยำ จะช่วยเพิ่มรสเปรี้ยวและกลมกล่อมด้วยมะม่วงดิบ ส้มโอ และมะนาว`,
			// Region: "ภาคใต้",
			Image:  "https://storage.googleapis.com/gsk-site/khao-yam-1.jpg",
			Credit: "https://www.genyoungactive.com/articles/khao-yam",
		},
		{
			Title: "แกงผักหวานไข่มดแดง",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- เนื้อปลานิล: 5 ช้อนโต๊ะ (80 กรัม)
- ไข่ขาวต้ม: 4 ฟอง (140 กรัม)
- ต้นหอม: 1/4 ถ้วยตวง (15 กรัม)
- ผักชี: 1/4 ถ้วยตวง (15 กรัม)
- น้ำปลาร้า: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำเปล่า: 4 ถ้วยตวง (800 กรัม)
- เกลือ: 1/3 ช้อนชา (1.5 กรัม)
- ขนมจีน: 8 จับ (400 กรัม)
- กระเทียม: 3 ช้อนโต๊ะ (30 กรัม)
- หอมแดง: 3 ช้อนโต๊ะ (30 กรัม)
- พริกแห้งเม็ดใหญ่ 7 เม็ด: 1/2 ถ้วยตวง (20 กรัม)
- ตะไคร้: 4 ช้อนโต๊ะ (20 กรัม)
- กระชาย: 1/2 ถ้วยตวง (40 กรัม)
- ขิงแก่: 3 ช้อนโต๊ะ (15 กรัม)
- กะหล่ำปลีหั่นฝอย: 1/4 ถ้วยตวง (20 กรัม)
- ถั่วฝักยาวหั่นฝอย: 1 ฝัก (10 กรัม)

วิธีทำ
1. นำพริกขี้หนู หอมซอย ตะไคร้ โขลกรวมกันให้ละเอียด
2. เติมน้ำเปล่าในหม้อตั้งไฟให้เดือด เติมเครื่องแกงที่โขลก ข้อ 1 ลงในหม้อ ใส่ปลาช่อนต้มจนสุก
3. ล้างไข่มดแดงในน้ำให้สะอาด สรงใส่ตะแกรงให้สะเด็ดน้ำ
4. นำผักหวานที่ล้างน้ำแล้ว ใส่ลงในหม้อคนให้ทั่ว แล้วหรี่ไฟลง
5. ปรุงรสด้วยน้ำปลาร้า เติมผักติ้ว ไข่มดแดง คนจนทั่ว เคี่ยวจนเดือดประมาณ 5 นาที ปิดไฟ ตักใส่ชามพร้อมเสิร์ฟ`,
			// Region: "ภาคอีสาน",
			Image:  "https://img.wongnai.com/p/1920x0/2017/10/04/f4d2d901befc492f9569d9e47d3aca14.jpg",
			Credit: "https://www.wongnai.com/cooking/cookbooks/ant-eggs-recipes",
		},
		{
			Title: "ขนมจีนน้ำยาลาว",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- หยวกกล้วย: 2 ถ้วยตวง (200 กรัม)
- อกไก่ไม่มีหนัง: 4 ช้อนโต๊ะ (40 กรัม)
- วุ้นเส้น 1 ห่อเล็ก: 1 ถ้วยตวง (40 กรัม)
- ตะไคร้: 3 ช้อนชา (15 กรัม)
- พริกแห้งเม็ดใหญ่: 4 ช้อนโต๊ะ (10 กรัม)
- กระเทียม: 1 ช้อนชา (5 กรัม)
- หอมแดง: 4 ช้อนชา (20 กรัม)
- ข่า: 1 แว่น (5 กรัม)
- กะปิ: 1/4 ช้อนชา (1.25 กรัม)
- เกลือ: 1/4 ช้อนชา (1.25 กรัม)
- น้ำมันรำข้าว: 2 ช้อนชา (10 กรัม)

วิธีทำ
1. ล้างและปอกเปลือกหอมแดง กระเทียม ตะไคร้ ขิง กระชาย พริกแห้ง นำไปต้มในหม้อพร้อมปลานิล
2. นำเครื่องสมุนไพรในข้อ 1 มาโขลกให้ละเอียด
3. นำปลาต้มมายีและผสมกับเครื่องแกง ข้อ 2 โขลกให้เข้ากัน
4. นำน้ำที่ต้มเครื่องแกงมากรองด้วยกระชอน ตั้งไฟให้เดือด นำส่วนผสม ข้อ 3 ใส่ลงในน้ำ คนให้เข้ากัน ปรุงรสด้วยปลาร้า เกลือ พอน้ำเดือดได้ที่ ปิดไฟ เสิร์ฟพร้อมขนมจีน ผักหั่นฝอย ไข่ขาวต้ม`,
			// Region: "ภาคอีสาน",
			Image:  "https://food-heal.com/wp-content/uploads/2022/10/%E0%B8%82%E0%B9%89%E0%B8%B2%E0%B8%A7%E0%B8%9B%E0%B8%B8%E0%B9%89%E0%B8%99%E0%B8%99%E0%B9%89%E0%B8%B3%E0%B8%A2%E0%B8%B2%E0%B8%A5%E0%B8%B2%E0%B8%A7.png",
			Credit: "https://food-heal.com/%E0%B8%82%E0%B9%89%E0%B8%B2%E0%B8%A7%E0%B8%9B%E0%B8%B8%E0%B9%89%E0%B8%99%E0%B8%99%E0%B9%89%E0%B8%B3%E0%B8%A2%E0%B8%B2%E0%B8%A5%E0%B8%B2%E0%B8%A7/",
		},
		{
			Title: "แกงหยวกกล้วย",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- หยวกกล้วย: 2 ถ้วยตวง (200 กรัม)
- อกไก่ไม่มีหนัง: 4 ช้อนโต๊ะ (40 กรัม)
- วุ้นเส้น 1 ห่อเล็ก: 1 ถ้วยตวง (40 กรัม)
- ตะไคร้: 3 ช้อนชา (15 กรัม)
- พริกแห้งเม็ดใหญ่: 4 ช้อนโต๊ะ (10 กรัม)
- กระเทียม: 1 ช้อนชา (5 กรัม)
- หอมแดง: 4 ช้อนชา (20 กรัม)
- ข่า: 1 แว่น (5 กรัม)
- กะปิ: 1/4 ช้อนชา (1.25 กรัม)
- เกลือ: 1/4 ช้อนชา (1.25 กรัม)
- น้ำมันรำข้าว: 2 ช้อนชา (10 กรัม)

วิธีทำ
1. หั่นหยวกกล้วยเป็นแว่น แช่น้ำเกลือ
2. โขลกพริก หอม กระเทียม ข่า ตะไคร้ กะปิ รวมกันจนละเอียด
3. ตั้งกระทะผัดเครื่องแกง ข้อ 2 กับน้ำมันจนหอม ใส่อกไก่ผัดให้เข้ากัน ใส่เกลือ
4. เติมน้ำพอท่วม ใส่หยวกกล้วย
5. รอให้เดือดอีกครั้ง เติมวุ้นเส้น ปิดไฟ พร้อมเสิร์ฟ`,
			// Region: "ภาคอีสาน",
			Image:  "https://img.wongnai.com/p/1920x0/2023/08/01/7c1432face3448ffa084b0d7b204cddf.jpg",
			Credit: "https://www.wongnai.com/recipes/ugc/19c117fd310344ec86eeb1dada5225b0",
		},
		{
			Title: "ห่อหมกปลาช่อนกะหล่ำปลี",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- เนื้อปลาช่อน: 6 ช้อนโต๊ะ (90 กรัม)
- ไข่ขาวดิบ: 1 ฟอง (35 กรัม)
- กะหล่ำปลี: 1/2 ถ้วยตวง (30 กรัม)
- ผักแขยงหั่นฝอย: 1/4 ถ้วยตวง (30 กรัม)
- ใบแมงลัก: 2 กิ่ง (10 กรัม)
- พริกชี้ฟ้าแดงสด 5 เม็ด: 1/4 ถ้วยตวง (50 กรัม)
- หอมแดง: 2 ช้อนชา (10 กรัม)
- ตะไคร้: 2 ช้อนชา (10 กรัม)
- กะปิ: 1 ช้อนชา (5 กรัม)
- กะทิ: 2 ช้อนโต๊ะ (25 กรัม)
- ใบตอง: ไม่มีปริมาณ/น้ำหนักระบุ

วิธีทำ
1. ล้างปลา ขอดเกล็ด แล่เนื้อ หั่นเป็นชิ้น
2. โขลกพริกสด หอมแดง ตะไคร้ กะปิ ให้ละเอียด ตักใส่ชามผสม
3. ผสมกะทิ ไข่ขาว คนให้เข้ากัน จากนั้นเติมผักแขยงคลุกให้เข้ากัน
4. รองใบตองด้วยใบแมงลัก และกะหล่ำปลีหั่นต้มสุก ตักส่วนผสมข้อ 2 และ 3 ใส่กระทงใบตอง นึ่งในน้ำเดือดจัดประมาณ 30 นาที`,
			// Region: "ภาคอีสาน",
			Image:  "https://i.ytimg.com/vi/7sL1cOs-q68/sddefault.jpg",
			Credit: "https://youtu.be/7sL1cOs-q68?si=Nao2LeC2WagHDAsf",
		},
		{
			Title: "ส้มตำปลาร้าพายัพ",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
- มะละกอดิบ: 1/2 ถ้วยตวง (30 กรัม)
- มะเขือเทศสีดา: 1 ช้อนโต๊ะ (15 กรัม)
- ถั่วฝักยาว: 1 ฝัก (10 กรัม)
- กระเทียมกลีบเล็ก: 2 ช้อนชา (10 กรัม)
- พริกขี้หนู: 5 เม็ด (5 กรัม)
- มะกอก: 1/2 ผล (5 กรัม)
- มะอึก: 1/2 ผล (5 กรัม)
- มะเขือเจ้าพระยา: 1/2 ผล (5 กรัม)
- ไข่ขาวนึ่ง: 2 ฟอง (70 กรัม)
- น้ำมะขามเปียกคั้น: 1 ช้อนชา (5 กรัม)
- น้ำมะนาว: 1 ช้อนชา (5 กรัม)
- น้ำปลาร้า: 1 ช้อนชา (5 กรัม)
- ขนมจีน: 1 จับ (100 กรัม)

วิธีทำ
1. โขลกกระเทียม พริกขี้หนูเข้าด้วยกัน จากนั้นหั่นถั่วฝักยาว ฝานมะเขือเทศ โขลกรวมกับมะละกอ มะกอกฝาน
2. นำเนื้อมะอึก มะเขือเจ้าพระยา หั่นเป็นชิ้นบางๆ คลุกเคล้ากับส่วนผสมข้อ 1 ให้เข้ากัน
3. หั่นไข่ขาวต้มเป็นเส้นคล้ายมะละกอ คลุกเคล้าในส่วนผสมข้อ 2
4. เติมน้ำปลาร้า น้ำมะขามเปียก น้ำมะนาว ผสมให้เข้ากัน ตักใส่จาน เสิร์ฟพร้อมขนมจีน`,
			// Region: "ภาคอีสาน",
			Image:  "https://img.wongnai.com/p/1920x0/2020/10/18/1ac05bb40f974c268374a1ae7c491e94.jpg",
			Credit: "https://www.wongnai.com/reviews/5fd7db16875b4da9843cfd227a12ade3",
		},
		{
			Title: "แกงลาวผักรวม",
			Description: `ส่วนประกอบ (ต่อ 1 ที่)
- เนื้อปลาช่อนสด: 1 ช้อนโต๊ะ (15 กรัม)
- ฟักทอง: 3 ชิ้น (10 กรัม)
- บวบหอม: 3 ชิ้น (10 กรัม)
- เห็ดขอนขาว: 3 ชิ้น (10 กรัม)
- เห็ดนางฟ้า: 3 ชิ้น (10 กรัม)
- หอมแดง: 1 ช้อนโต๊ะ (15 กรัม)
- กระเทียม: 1 ช้อนชา (5 กรัม)
- พริกขี้หนูหั่น: 1 ช้อนชา (5 กรัม)
- ตะไคร้: 1 ช้อนชา (5 กรัม)
- กระชาย: 1 ช้อนชา (5 กรัม)
- ข่าอ่อน: 1/2 ช้อนชา (2.5 กรัม)
- ผิวมะกรูด: 1/2 ช้อนชา (2.5 กรัม)
- น้ำใบย่านาง (ใช้ใบย่านาง 5 กรัม): 2 ช้อนโต๊ะ (5 กรัม)
- น้ำปลาร้า: 1 ช้อนชา (5 กรัม)
- ข้าวเบือ: 1/2 ช้อนชา (5 กรัม)
- ใบมะกรูด: 3 ใบ (2 กรัม)
- พริกแดง: 1 เม็ด (5 กรัม)
- ใบแมงลัก: 3 ช่อ (5 กรัม)

วิธีทำ
1. เตรียมข้าวเบือ โดยโขลกข้าวเหนียวที่คั่วจนหอมแล้วให้ละเอียด
2. ล้างใบย่านางให้สะอาด โขลกให้ละเอียด จากนั้นเติมน้ำ 1 แก้ว กรองให้เป็นน้ำสีเขียว
3. ตัดโคนเห็ดทิ้ง จากนั้นหั่นหรือฉีกเห็ดเป็นชิ้นๆ ปอกเปลือกบวบหอม และฟักทอง แล้วหั่นเป็นชิ้น เด็ดใบแมงลักเป็นช่อ
4. เตรียมเครื่องแกงพริกขี้หนู หอมแดง กระเทียม ตะไคร้ ข่า ผิวมะกรูด กระชายหั่นฝอย ตวงตามส่วน โขลกรวมกันจนละเอียด
5. ต้มน้ำใบย่านางพอเดือดใส่เครื่องแกง ฟักทองพอสุก บวบ เห็ด ข้าวเบือ ปรุงรสด้วยน้ำปลาร้า พอเดือดใส่ ใบมะกรูดฉีก ใบแมงลัก พริกแดง ยกลงตักเสิร์ฟ`,
			// Region: "ภาคอีสาน",
			Image: "https://i.ytimg.com/vi/bWBpR0KQXD4/maxresdefault.jpg",
		},
		{
			Title: "แจ่วบองสมุนไพร",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- ปลาร้าปลาช่อน: 1 ช้อนโต๊ะ (13 กรัม)
- ตะไคร้ซอยละเอียด: 2 ช้อนโต๊ะ (10 กรัม)
- หอมซอยบางๆ: 2 ช้อนโต๊ะ (20 กรัม)
- กระเทียมซอยบางๆ: 2 ช้อนโต๊ะ (20 กรัม)
- ข่าหั่นหยาบ: 2 ช้อนชา (10 กรัม)
- พริกคั่วป่นละเอียด: 1 ช้อนชา (5 กรัม)
- มะเขือเทศเนื้อ: 1/2 ถ้วยตวง (80 กรัม)
- น้ำมะขามเปียกคั้น: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำมันพืช: 1 ช้อนโต๊ะ (15 กรัม)
- เนื้อปลาช่อน: 5 ช้อนโต๊ะ (75 กรัม)
- ใบมะกรูด: 3 ใบ (2 กรัม)
- แตงกวา: 4 ลูก (100 กรัม)
- มะเขือเจ้าพระยา: 4 ลูก (100 กรัม)
- ผักกาดขาว: 8 กาบ (100 กรัม)

วิธีทำ
1. ล้างปลาร้า เอาแต่เนื้อ 1 ช้อนโต๊ะ สับให้ละเอียด รวมกับเนื้อปลาช่อน ห่อใบตอง ปิ้งให้สุก
2. คั่วข่า ตะไคร้ หอม กระเทียม ให้หอม แล้วนำมาโขลกให้ละเอียด
3. เผามะเขือเทศ ลอกเปลือกออกแล้วสับละเอียด
4. นำส่วนผสมในข้อ 1-3 มาโขลกรวมกัน ใส่น้ำมะขามเปียก พริกป่น นำลงผัดในน้ำมันให้เข้ากัน
5. ตักใส่จาน โรยหน้าด้วยใบมะกรูดหั่นฝอย จัดเสิร์ฟพร้อมผักสด`,
			// Region: "ภาคอีสาน",
			Image:  "https://th-live-01.slatic.net/p/d885d27f6948ca0a9876c3beccf3a912.jpg",
			Credit: "https://www.lazada.co.th/products/1-kg-i619954353.html",
		},
		{
			Title: "ลาบไข่ขาว",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- ไข่ขาวนึ่งสุก: 4 ฟอง (140 กรัม)
- หอมแดงซอย: 2 ช้อนโต๊ะ (30 กรัม)
- ผักชีใบเลื่อย: 2 ช้อนโต๊ะ (15 กรัม)
- ต้นหอมซอย: 2 ช้อนโต๊ะ (15 กรัม)
- พริกขี้หนูแดงซอย: 1 ช้อนชา (5 กรัม)
- พริกขี้หนูปั่น: 1/2 ช้อนโต๊ะ (2.5 กรัม)
- ข้าวคั่ว: 2 ช้อนโต๊ะ (15 กรัม)
- น้ำมะนาว: 1 ช้อนชา (20 กรัม)
- น้ำปลา: 1 ช้อนชา (5 กรัม)
- น้ำตาลทราย: 1 ช้อนชา (5 กรัม)
- น้ำมันพืช: 2 ช้อนชา (10 กรัม)
- ใบสะระแหน่: 2 ช้อนโต๊ะ (15 กรัม)
- ผักกาดขาว: 2 กาบ (20 กรัม)
- แตงกวา: 2 ลูก (100 กรัม)
- ถั่วฝักยาว: 4 เส้น (50 กรัม)
- น้ำเปล่าต้มสุก: 3 ช้อนโต๊ะ (45 กรัม)

วิธีทำ
1. นำไข่ขาวนึ่งให้สุก สับหยาบๆ ผัดพอเหลือง
2. ผสมน้ำตาลทราย น้ำปลา คนให้ละลาย ใส่น้ำมะนาว
3. นำไข่ขาว ใส่น้ำปรุงรส ข้อ 2. เติมน้ำต้มสุก ใส่หอมแดง ข้าวคั่ว พริกขี้หนูซอย พริกป่น ต้นหอม ผักชี คลุกเคล้าให้เข้ากัน จัดใส่จาน แต่งหน้าด้วยสะระแหน่ เสิร์ฟพร้อมผักสด`,
			// Region: "ภาคอีสาน",
			Image:  "https://sou-dai.com/wp-content/uploads/2022/03/21-1.png",
			Credit: "https://youtu.be/G2wsykvvx_U?si=pNtg4x9Ywf5Qkwa3",
		},
		{
			Title: "ผัดหมี่พิมาย",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- หมี่โคราช: 3 ถ้วยตวง (150 กรัม)
- หอมแดงซอย: 3 ช้อนโต๊ะ (30 กรัม)
- กระเทียมซอย: 1 ช้อนโต๊ะ (15 กรัม)
- หมูเนื้อแดง: 5 ช้อนโต๊ะ (80 กรัม)
- ไข่ไก่: 1 ฟอง (50 กรัม)
- น้ำปลา: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำตาลทราย: 3 ช้อนโต๊ะ (45 กรัม)
- น้ำส้มสายชู: 3 ช้อนโต๊ะ (45 กรัม)
- น้ำมันพืช: 2 ช้อนชา (5 กรัม)
- พริกชี้ฟ้าแห้งปั่น: 1 ช้อนโต๊ะ (5 กรัม)
- ต้นหอม: 10 ต้น (80 กรัม)
- ถั่วงอก: 2 ถ้วยตวง (150 กรัม)
- น้ำมะขามเปียก: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำเปล่า: 1/2 ถ้วยตวง (120 กรัม)

วิธีทำ
1. หั่นหมูเนื้อแดงเป็นชิ้นบางๆ
2. ตีไข่ไก่ให้เป็นเนื้อเดียวกัน ทอดเป็นแผ่นบางพอสุก ม้วน แล้วหั่นฝอย
3. แช่เส้นหมี่จนนุ่ม สะเด็ดน้ำ พักไว้
4. ตั้งกระทะใส่น้ำมัน เจียวหอม กระเทียม จนเหลือง ใส่น้ำปลา น้ำตาล น้ำมะขามเปียก น้ำส้มสายชู และน้ำเปล่า เคี่ยวพอได้สีที่ต้องการ ใส่พริกป่นลงไป
5. นำเส้นหมี่ลงผัดในน้ำปรุง เคล้าให้เข้ากัน ถ้าเส้นแข็งเติมน้ำเปล่าเพิ่ม
6. ตักเสิร์ฟ ตกแต่งด้วยไข่ฝอย ถั่วงอก และต้นหอม`,
			// Region: "ภาคอีสาน",
			Image:  "https://img.wongnai.com/p/1920x0/2017/10/21/2b9ba64f21e84f40a041377cd3b58e1d.jpg",
			Credit: "https://shorturl.at/JTFGx",
		},
		{
			Title: "ป่นปลาผักต้ม",
			Description: `ส่วนประกอบ (ต่อ 4 ที่)
- เนื้อปลาช่อนย่าง: 4 ช้อนโต๊ะ (60 กรัม)
- พริกชี้ฟ้า เขียว แดง: 1/4 ถ้วยตวง (50 กรัม)
- กระเทียม: 2 ช้อนโต๊ะ (30 กรัม)
- หอมแดง: 1/4 ถ้วยตวง (50 กรัม)
- มะเขือเทศเนื้อ เผา: 1 ลูก (80 กรัม)
- น้ำปลาร้าต้มสุก: 1 ช้อนโต๊ะ (15 กรัม)
- น้ำมะขามเปียกต้มสุก: 1 ช้อนโต๊ะ (20 กรัม)
- เกลือป่น: 1/10 ช้อนชา (0.5 กรัม)
- ผักกาดขาว: 8 กาบ (100 กรัม)
- แตงกวา: 2 ลูก (100 กรัม)
- ดอกโสน: 1 ถ้วยตวง (50 กรัม)
- มะเขือเปราะ: 4 ลูก (100 กรัม)
- พริกขี้หนู: 6 เม็ด (10 กรัม)
- น้ำมะนาว: 2 ช้อนชา (10 กรัม)

วิธีทำ
1. นำพริก กระเทียม หอมแดง เผาแล้วโขลกรวมกัน
2. นำปลาช่อนย่าง แกะก้างออก โขลกรวมกับส่วนผสมในข้อ 1
3. เผามะเขือเทศ ปอกเปลือก โขลกรวมกับส่วนผสมในข้อ 1 และ ข้อ 2 ให้เข้ากัน
4. ปรุงรสด้วยน้ำปลาร้า น้ำมะขามเปียก น้ำมะนาว หากข้นไปให้เติมน้ำต้มสุกเพิ่ม จัดเสิร์ฟพร้อมผักสด และผักต้ม`,
			// Region: "ภาคอีสาน",
			Image:  "https://siamfishing.com/_pictures/content/upload2014/201401/1389089340.jpg",
			Credit: "https://siamfishing.com/m/content/m.view.php?cat=recipe&nid=150703",
		},
	}
	for _, pkg := range Menu {
		db.FirstOrCreate(&pkg, entity.Menu{Title: pkg.Title})
	}

	Meals := []entity.Meal{
		{MealdayID: 1, MealType: "มื้อเช้า"},
		{MealdayID: 1, MealType: "มื้อว่าง"},
		{MealdayID: 1, MealType: "มื้อกลางวัน"},
		{MealdayID: 1, MealType: "มื้อเย็น"},
		{MealdayID: 2, MealType: "มื้อเช้า"},
		{MealdayID: 2, MealType: "มื้อว่าง"},
		{MealdayID: 2, MealType: "มื้อกลางวัน"},
		{MealdayID: 2, MealType: "มื้อเย็น"},
		{MealdayID: 3, MealType: "มื้อเช้า"},
		{MealdayID: 3, MealType: "มื้อว่าง"},
		{MealdayID: 3, MealType: "มื้อกลางวัน"},
		{MealdayID: 3, MealType: "มื้อเย็น"},
		{MealdayID: 4, MealType: "มื้อเช้า"},
		{MealdayID: 4, MealType: "มื้อว่าง"},
		{MealdayID: 4, MealType: "มื้อกลางวัน"},
		{MealdayID: 4, MealType: "มื้อเย็น"},
		{MealdayID: 5, MealType: "มื้อเช้า"},
		{MealdayID: 5, MealType: "มื้อว่าง"},
		{MealdayID: 5, MealType: "มื้อกลางวัน"},
		{MealdayID: 5, MealType: "มื้อเย็น"},
		{MealdayID: 6, MealType: "มื้อเช้า"},
		{MealdayID: 6, MealType: "มื้อว่าง"},
		{MealdayID: 6, MealType: "มื้อกลางวัน"},
		{MealdayID: 6, MealType: "มื้อเย็น"},
		{MealdayID: 7, MealType: "มื้อเช้า"},
		{MealdayID: 7, MealType: "มื้อว่าง"},
		{MealdayID: 7, MealType: "มื้อกลางวัน"},
		{MealdayID: 7, MealType: "มื้อเย็น"},
	}

	for _, mealtype := range Meals {
		db.FirstOrCreate(&mealtype, entity.Meal{
			MealdayID: mealtype.MealdayID,
			MealType:  mealtype.MealType,
		})
	}

	Mealplans := []entity.Mealplan{
		{AdminID: 1 , DiseaseID: 1, PlanName: "แผนอาหารสำหรับผู้ป่วยโรคไตระยะ 1-3a"},
		{AdminID: 1 , DiseaseID: 2, PlanName: "แผนอาหารสำหรับผู้ป่วยโรคไตระยะ 3b-5"},
		{AdminID: 1 , DiseaseID: 3, PlanName: "แผนอาหารสำหรับผู้ป่วยโรคไตระยะ HD"},
		{AdminID: 1 , DiseaseID: 4, PlanName: "แผนอาหารสำหรับผู้ป่วยโรคไตระยะ CAPD"},
		{AdminID: 1 , DiseaseID: 5, PlanName: "แผนอาหารสำหรับผู้ป่วยโรคเบาหวาน"},
	}

	for _, mealplan := range Mealplans {
		db.FirstOrCreate(&mealplan, entity.Mealplan{
			AdminID: mealplan.AdminID,
			DiseaseID: mealplan.DiseaseID,
			PlanName: mealplan.PlanName,
		})
	}

	Mealdays := []entity.Mealday{
		{MealplanID: 1, DayofWeek: "วันจันทร์"},
		{MealplanID: 1, DayofWeek: "วันอังคาร"},
		{MealplanID: 1, DayofWeek: "วันพุธ"},
		{MealplanID: 1, DayofWeek: "วันพฤหัสบดี"},
		{MealplanID: 1, DayofWeek: "วันศุกร์"},
		{MealplanID: 1, DayofWeek: "วันเสาร์"},
		{MealplanID: 1, DayofWeek: "วันอาทิตย์"},
	}

	for _, day := range Mealdays {
		db.FirstOrCreate(&day, entity.Mealday{
			MealplanID: day.MealplanID,
			DayofWeek:  day.DayofWeek,
		})
	}

	MealMenus := []entity.MealMenu{
		{MealID: 1, MenuID: 1, PortionText: ""},
		{MealID: 2, MenuID: 1, PortionText: ""},
		{MealID: 3, MenuID: 6, PortionText: ""},
		{MealID: 4, MenuID: 1, PortionText: ""},
		{MealID: 5, MenuID: 1, PortionText: ""},
		{MealID: 6, MenuID: 1, PortionText: ""},
		{MealID: 7, MenuID: 1, PortionText: ""},
		{MealID: 8, MenuID: 1, PortionText: ""},
		{MealID: 9, MenuID: 1, PortionText: ""},
		{MealID: 10, MenuID: 1, PortionText: ""},
		{MealID: 11, MenuID: 1, PortionText: ""},
		{MealID: 12, MenuID: 1, PortionText: ""},
		{MealID: 13, MenuID: 1, PortionText: ""},
		{MealID: 14, MenuID: 1, PortionText: ""},
		{MealID: 15, MenuID: 1, PortionText: ""},
		{MealID: 16, MenuID: 1, PortionText: ""},
		{MealID: 17, MenuID: 1, PortionText: ""},
		{MealID: 18, MenuID: 1, PortionText: ""},
		{MealID: 19, MenuID: 1, PortionText: ""},
		{MealID: 20, MenuID: 1, PortionText: ""},
		{MealID: 21, MenuID: 1, PortionText: ""},
		{MealID: 22, MenuID: 1, PortionText: ""},
		{MealID: 23, MenuID: 1, PortionText: ""},
		{MealID: 24, MenuID: 1, PortionText: ""},
		{MealID: 25, MenuID: 1, PortionText: ""},
		{MealID: 26, MenuID: 1, PortionText: ""},
		{MealID: 27, MenuID: 30, PortionText: ""},
		{MealID: 28, MenuID: 1, PortionText: ""},
	}

	for _, mealmenu := range MealMenus {
		db.FirstOrCreate(&mealmenu, entity.MealMenu{
			MealID:      mealmenu.MealID,
			MenuID:      mealmenu.MenuID,
			PortionText: mealmenu.PortionText,
		})
	}

	Mealplans = []entity.Mealplan{
		{AdminID: 1, DiseaseID: 1, PlanName: "แผนอาหารสำหรับผู้ป่วยโรคไตระยะ 1-3a"},
		{AdminID: 1, DiseaseID: 2, PlanName: "แผนอาหารสำหรับผู้ป่วยโรคไตระยะ 3b-5"},
		{AdminID: 1, DiseaseID: 3, PlanName: "แผนอาหารสำหรับผู้ป่วยโรคไตระยะ HD"},
		{AdminID: 1, DiseaseID: 4, PlanName: "แผนอาหารสำหรับผู้ป่วยโรคไตระยะ CAPD"},
		{AdminID: 1, DiseaseID: 5, PlanName: "แผนอาหารสำหรับผู้ป่วยโรคเบาหวาน"},
	}

	for _, mealplan := range Mealplans {
		db.FirstOrCreate(&mealplan, entity.Mealplan{
			AdminID:   mealplan.AdminID,
			DiseaseID: mealplan.DiseaseID,
			PlanName:  mealplan.PlanName,
		})
	}


	AgeRanges := []entity.AgeRange{
		{AgeMin: 0, AgeMax: 60},
		{AgeMin: 61, AgeMax: 200},
	}

	for _, ageRange := range AgeRanges {
		db.FirstOrCreate(&ageRange, entity.AgeRange{
			AgeMin: ageRange.AgeMin,
			AgeMax: ageRange.AgeMax,
		})
	}

	FoodGroups := []entity.FoodGroup{
		{Name: "ข้าว/แป้ง", Unit: "ทัพพี"},      //1
		{Name: "แป้งปลอดโปรตีน", Unit: "ทัพพี"}, //2
		{Name: "ผัก", Unit: "ทัพพี"},            //3
		{Name: "ผลไม้", Unit: "ส่วน"},           //4
		{Name: "เนื้อสัตว์", Unit: "ช้อนโต๊ะ"},  //5
		{Name: "ไขมัน", Unit: "ช้อนชา"},         //6
		{Name: "ซอสปรุงรส", Unit: "ช้อนชา"},     //7
		{Name: "นม", Unit: "กล่อง"},             //8
	}

	for _, foodGroup := range FoodGroups {
		db.FirstOrCreate(&foodGroup, entity.FoodGroup{
			Name: foodGroup.Name,
			Unit: foodGroup.Unit,
		})
	}

	IbwRanges := []entity.IbwRange{
		{IbwMin: 0, IbwMax: 50},
		{IbwMin: 51, IbwMax: 55},
		{IbwMin: 56, IbwMax: 60},
		{IbwMin: 61, IbwMax: 200},
		{IbwMin: 61, IbwMax: 65},
		{IbwMin: 66, IbwMax: 200},
		{IbwMin: 45, IbwMax: 200},
	}

	for _, ibwRange := range IbwRanges {
		db.FirstOrCreate(&ibwRange, entity.IbwRange{
			IbwMin: ibwRange.IbwMin,
			IbwMax: ibwRange.IbwMax,
		})
	}

	MealTimes := []entity.MealTime{
		{Name: "เช้า"},
		{Name: "กลางวัน"},
		{Name: "เย็น"},
	}

	for _, mealTime := range MealTimes {
		db.FirstOrCreate(&mealTime, entity.MealTime{
			Name: mealTime.Name,
		})
	}

	NutritionGroups := []entity.NutritionGroup{
		{Name: "คาร์โบไฮเดรต"},
		{Name: "โปรตีน"},
		{Name: "ไขมัน"},
	}

	for _, nutritionGroup := range NutritionGroups {
		db.FirstOrCreate(&nutritionGroup, entity.NutritionGroup{
			Name: nutritionGroup.Name,
		})
	}

	Diseases := []entity.Disease{
		{Name: "โรคไต", Stage: "1-3a"},   //1
		{Name: "โรคไต", Stage: "3b-5"},   //2
		{Name: "โรคไต", Stage: "HD"},     //3
		{Name: "โรคไต", Stage: "CAPD"},   //4
		{Name: "โรคเบาหวาน", Stage: "-"}, //5
	}

	for _, disease := range Diseases {
		db.FirstOrCreate(&disease, entity.Disease{
			Name:  disease.Name,
			Stage: disease.Stage,
		})
	}

	/*ขาดข้อมูลผู้ป่วยไตที่อายุ 61 ปี ขึ้นไป*/ /*ีupdate 61 ปีขึ้นไปแล้ว*/
	Rules := []entity.Rule{
		{Calories: 1750, IbwRangeID: 1, AgeRangeID: 1, DiseaseID: 1}, //1
		{Calories: 1925, IbwRangeID: 2, AgeRangeID: 1, DiseaseID: 1}, //2
		{Calories: 2100, IbwRangeID: 3, AgeRangeID: 1, DiseaseID: 1}, //3
		{Calories: 2275, IbwRangeID: 4, AgeRangeID: 1, DiseaseID: 1}, //4

		{Calories: 1750, IbwRangeID: 1, AgeRangeID: 1, DiseaseID: 2}, //5
		{Calories: 1925, IbwRangeID: 2, AgeRangeID: 1, DiseaseID: 2}, //6
		{Calories: 2100, IbwRangeID: 3, AgeRangeID: 1, DiseaseID: 2}, //7
		{Calories: 2275, IbwRangeID: 4, AgeRangeID: 1, DiseaseID: 2}, //8

		{Calories: 1750, IbwRangeID: 1, AgeRangeID: 1, DiseaseID: 3}, //9
		{Calories: 1925, IbwRangeID: 2, AgeRangeID: 1, DiseaseID: 3}, //10
		{Calories: 2100, IbwRangeID: 3, AgeRangeID: 1, DiseaseID: 3}, //11
		{Calories: 2275, IbwRangeID: 4, AgeRangeID: 1, DiseaseID: 3}, //12

		{Calories: 1750, IbwRangeID: 1, AgeRangeID: 1, DiseaseID: 4}, //13
		{Calories: 1925, IbwRangeID: 2, AgeRangeID: 1, DiseaseID: 4}, //14
		{Calories: 2100, IbwRangeID: 3, AgeRangeID: 1, DiseaseID: 4}, //15
		{Calories: 2275, IbwRangeID: 4, AgeRangeID: 1, DiseaseID: 4}, //16

		{Calories: 1500, IbwRangeID: 1, AgeRangeID: 1, DiseaseID: 5}, //17 //เบาหวาน
		{Calories: 1650, IbwRangeID: 2, AgeRangeID: 1, DiseaseID: 5}, //18
		{Calories: 1800, IbwRangeID: 3, AgeRangeID: 1, DiseaseID: 5}, //19
		{Calories: 1950, IbwRangeID: 5, AgeRangeID: 1, DiseaseID: 5}, //20
		{Calories: 2100, IbwRangeID: 6, AgeRangeID: 1, DiseaseID: 5}, //21

		{Calories: 1500, IbwRangeID: 7, AgeRangeID: 2, DiseaseID: 5}, //22

		{Calories: 1500, IbwRangeID: 1, AgeRangeID: 2, DiseaseID: 1}, //23 //ไต อายุ 61 ขึ้นไป
		{Calories: 1650, IbwRangeID: 2, AgeRangeID: 2, DiseaseID: 1}, //24
		{Calories: 1800, IbwRangeID: 3, AgeRangeID: 2, DiseaseID: 1}, //25
		{Calories: 1950, IbwRangeID: 4, AgeRangeID: 2, DiseaseID: 1}, //26

		{Calories: 1500, IbwRangeID: 1, AgeRangeID: 2, DiseaseID: 2}, //27
		{Calories: 1650, IbwRangeID: 2, AgeRangeID: 2, DiseaseID: 2}, //28
		{Calories: 1800, IbwRangeID: 3, AgeRangeID: 2, DiseaseID: 2}, //29
		{Calories: 1950, IbwRangeID: 4, AgeRangeID: 2, DiseaseID: 2}, //30

		{Calories: 1500, IbwRangeID: 1, AgeRangeID: 2, DiseaseID: 3}, //31
		{Calories: 1650, IbwRangeID: 2, AgeRangeID: 2, DiseaseID: 3}, //32
		{Calories: 1800, IbwRangeID: 3, AgeRangeID: 2, DiseaseID: 3}, //33
		{Calories: 1950, IbwRangeID: 4, AgeRangeID: 2, DiseaseID: 3}, //34

		{Calories: 1500, IbwRangeID: 1, AgeRangeID: 2, DiseaseID: 4}, //35
		{Calories: 1650, IbwRangeID: 2, AgeRangeID: 2, DiseaseID: 4}, //36
		{Calories: 1800, IbwRangeID: 3, AgeRangeID: 2, DiseaseID: 4}, //37
		{Calories: 1950, IbwRangeID: 4, AgeRangeID: 2, DiseaseID: 4}, //38
	}

	for _, rule := range Rules {
		db.FirstOrCreate(&rule, entity.Rule{
			Calories:   rule.Calories,
			IbwRangeID: rule.IbwRangeID,
			AgeRangeID: rule.AgeRangeID,
			DiseaseID:  rule.DiseaseID,
		})
	}

	NutritionRecommendations := []entity.NutritionRecommendation{
		{AmountInGrams: 240, AmountInPercentage: 55, NutritionGroupID: 1, RuleID: 1},
		{AmountInGrams: 43, AmountInPercentage: 10, NutritionGroupID: 2, RuleID: 1},
		{AmountInGrams: 68, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 1},

		{AmountInGrams: 265, AmountInPercentage: 55, NutritionGroupID: 1, RuleID: 2},
		{AmountInGrams: 48, AmountInPercentage: 10, NutritionGroupID: 2, RuleID: 2},
		{AmountInGrams: 75, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 2},

		{AmountInGrams: 288, AmountInPercentage: 55, NutritionGroupID: 1, RuleID: 3},
		{AmountInGrams: 53, AmountInPercentage: 10, NutritionGroupID: 2, RuleID: 3},
		{AmountInGrams: 82, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 3},

		{AmountInGrams: 313, AmountInPercentage: 55, NutritionGroupID: 1, RuleID: 4},
		{AmountInGrams: 57, AmountInPercentage: 10, NutritionGroupID: 2, RuleID: 4},
		{AmountInGrams: 88, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 4},

		{AmountInGrams: 249, AmountInPercentage: 57, NutritionGroupID: 1, RuleID: 5},
		{AmountInGrams: 35, AmountInPercentage: 8, NutritionGroupID: 2, RuleID: 5},
		{AmountInGrams: 68, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 5},

		{AmountInGrams: 274, AmountInPercentage: 57, NutritionGroupID: 1, RuleID: 6},
		{AmountInGrams: 38, AmountInPercentage: 8, NutritionGroupID: 2, RuleID: 6},
		{AmountInGrams: 75, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 6},

		{AmountInGrams: 299, AmountInPercentage: 57, NutritionGroupID: 1, RuleID: 7},
		{AmountInGrams: 41, AmountInPercentage: 8, NutritionGroupID: 2, RuleID: 7},
		{AmountInGrams: 82, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 7},

		{AmountInGrams: 324, AmountInPercentage: 57, NutritionGroupID: 1, RuleID: 8},
		{AmountInGrams: 45, AmountInPercentage: 8, NutritionGroupID: 2, RuleID: 8},
		{AmountInGrams: 88, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 8},

		{AmountInGrams: 219, AmountInPercentage: 57, NutritionGroupID: 1, RuleID: 9},
		{AmountInGrams: 65, AmountInPercentage: 8, NutritionGroupID: 2, RuleID: 9},
		{AmountInGrams: 68, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 9},

		{AmountInGrams: 240, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 10},
		{AmountInGrams: 72, AmountInPercentage: 15, NutritionGroupID: 2, RuleID: 10},
		{AmountInGrams: 75, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 10},

		{AmountInGrams: 263, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 11},
		{AmountInGrams: 78, AmountInPercentage: 15, NutritionGroupID: 2, RuleID: 11},
		{AmountInGrams: 82, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 11},

		{AmountInGrams: 284, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 12},
		{AmountInGrams: 85, AmountInPercentage: 15, NutritionGroupID: 2, RuleID: 12},
		{AmountInGrams: 88, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 12},

		{AmountInGrams: 218, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 13},
		{AmountInGrams: 75, AmountInPercentage: 17, NutritionGroupID: 2, RuleID: 13},
		{AmountInGrams: 64, AmountInPercentage: 33, NutritionGroupID: 3, RuleID: 13},

		{AmountInGrams: 240, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 14},
		{AmountInGrams: 82, AmountInPercentage: 17, NutritionGroupID: 2, RuleID: 14},
		{AmountInGrams: 71, AmountInPercentage: 33, NutritionGroupID: 3, RuleID: 14},

		{AmountInGrams: 263, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 15},
		{AmountInGrams: 90, AmountInPercentage: 17, NutritionGroupID: 2, RuleID: 15},
		{AmountInGrams: 77, AmountInPercentage: 33, NutritionGroupID: 3, RuleID: 15},

		{AmountInGrams: 284, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 16},
		{AmountInGrams: 97, AmountInPercentage: 17, NutritionGroupID: 2, RuleID: 16},
		{AmountInGrams: 83, AmountInPercentage: 33, NutritionGroupID: 3, RuleID: 16},

		{AmountInGrams: 187.5, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 17},
		{AmountInGrams: 75, AmountInPercentage: 20, NutritionGroupID: 2, RuleID: 17},
		{AmountInGrams: 50, AmountInPercentage: 30, NutritionGroupID: 3, RuleID: 17},

		{AmountInGrams: 206.25, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 18},
		{AmountInGrams: 82.5, AmountInPercentage: 20, NutritionGroupID: 2, RuleID: 18},
		{AmountInGrams: 55, AmountInPercentage: 30, NutritionGroupID: 3, RuleID: 18},

		{AmountInGrams: 225, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 19},
		{AmountInGrams: 90, AmountInPercentage: 20, NutritionGroupID: 2, RuleID: 19},
		{AmountInGrams: 60, AmountInPercentage: 30, NutritionGroupID: 3, RuleID: 19},

		{AmountInGrams: 243.75, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 20},
		{AmountInGrams: 97.5, AmountInPercentage: 20, NutritionGroupID: 2, RuleID: 20},
		{AmountInGrams: 65, AmountInPercentage: 30, NutritionGroupID: 3, RuleID: 20},

		{AmountInGrams: 262.5, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 21},
		{AmountInGrams: 105, AmountInPercentage: 20, NutritionGroupID: 2, RuleID: 21},
		{AmountInGrams: 70, AmountInPercentage: 30, NutritionGroupID: 3, RuleID: 21},

		{AmountInGrams: 187.5, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 22},
		{AmountInGrams: 75, AmountInPercentage: 20, NutritionGroupID: 2, RuleID: 22},
		{AmountInGrams: 50, AmountInPercentage: 30, NutritionGroupID: 3, RuleID: 22},

		{AmountInGrams: 206, AmountInPercentage: 55, NutritionGroupID: 1, RuleID: 23},
		{AmountInGrams: 41, AmountInPercentage: 11, NutritionGroupID: 2, RuleID: 23},
		{AmountInGrams: 57, AmountInPercentage: 34, NutritionGroupID: 3, RuleID: 23},

		{AmountInGrams: 227, AmountInPercentage: 55, NutritionGroupID: 1, RuleID: 24},
		{AmountInGrams: 50, AmountInPercentage: 12, NutritionGroupID: 2, RuleID: 24},
		{AmountInGrams: 61, AmountInPercentage: 33, NutritionGroupID: 3, RuleID: 24},

		{AmountInGrams: 248, AmountInPercentage: 55, NutritionGroupID: 1, RuleID: 25},
		{AmountInGrams: 54, AmountInPercentage: 12, NutritionGroupID: 2, RuleID: 25},
		{AmountInGrams: 66, AmountInPercentage: 33, NutritionGroupID: 3, RuleID: 25},

		{AmountInGrams: 268, AmountInPercentage: 55, NutritionGroupID: 1, RuleID: 26},
		{AmountInGrams: 59, AmountInPercentage: 12, NutritionGroupID: 2, RuleID: 26},
		{AmountInGrams: 72, AmountInPercentage: 33, NutritionGroupID: 3, RuleID: 26},

		{AmountInGrams: 214, AmountInPercentage: 57, NutritionGroupID: 1, RuleID: 27},
		{AmountInGrams: 30, AmountInPercentage: 8, NutritionGroupID: 2, RuleID: 27},
		{AmountInGrams: 58, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 27},

		{AmountInGrams: 227, AmountInPercentage: 55, NutritionGroupID: 1, RuleID: 28},
		{AmountInGrams: 41, AmountInPercentage: 10, NutritionGroupID: 2, RuleID: 28},
		{AmountInGrams: 64, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 28},

		{AmountInGrams: 248, AmountInPercentage: 55, NutritionGroupID: 1, RuleID: 29},
		{AmountInGrams: 45, AmountInPercentage: 10, NutritionGroupID: 2, RuleID: 29},
		{AmountInGrams: 70, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 29},

		{AmountInGrams: 248, AmountInPercentage: 55, NutritionGroupID: 1, RuleID: 30},
		{AmountInGrams: 45, AmountInPercentage: 10, NutritionGroupID: 2, RuleID: 30},
		{AmountInGrams: 70, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 30},

		{AmountInGrams: 191, AmountInPercentage: 51, NutritionGroupID: 1, RuleID: 31},
		{AmountInGrams: 53, AmountInPercentage: 14, NutritionGroupID: 2, RuleID: 31},
		{AmountInGrams: 58, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 31},

		{AmountInGrams: 206, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 32},
		{AmountInGrams: 62, AmountInPercentage: 15, NutritionGroupID: 2, RuleID: 32},
		{AmountInGrams: 64, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 32},

		{AmountInGrams: 225, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 33},
		{AmountInGrams: 68, AmountInPercentage: 15, NutritionGroupID: 2, RuleID: 33},
		{AmountInGrams: 70, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 33},

		{AmountInGrams: 244, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 34},
		{AmountInGrams: 73, AmountInPercentage: 15, NutritionGroupID: 2, RuleID: 34},
		{AmountInGrams: 76, AmountInPercentage: 35, NutritionGroupID: 3, RuleID: 34},

		{AmountInGrams: 188, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 35},
		{AmountInGrams: 68, AmountInPercentage: 18, NutritionGroupID: 2, RuleID: 35},
		{AmountInGrams: 53, AmountInPercentage: 32, NutritionGroupID: 3, RuleID: 35},

		{AmountInGrams: 206, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 36},
		{AmountInGrams: 74, AmountInPercentage: 18, NutritionGroupID: 2, RuleID: 36},
		{AmountInGrams: 59, AmountInPercentage: 32, NutritionGroupID: 3, RuleID: 36},

		{AmountInGrams: 225, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 37},
		{AmountInGrams: 81, AmountInPercentage: 18, NutritionGroupID: 2, RuleID: 37},
		{AmountInGrams: 64, AmountInPercentage: 32, NutritionGroupID: 3, RuleID: 37},

		{AmountInGrams: 244, AmountInPercentage: 50, NutritionGroupID: 1, RuleID: 38},
		{AmountInGrams: 88, AmountInPercentage: 18, NutritionGroupID: 2, RuleID: 38}, //ในข้อมูลเขียนว่า 288 เดาว่าtypo
		{AmountInGrams: 69, AmountInPercentage: 32, NutritionGroupID: 3, RuleID: 38},
	}

	for _, rec := range NutritionRecommendations {
		db.Where("rule_id = ? AND nutrition_group_id = ?", rec.RuleID, rec.NutritionGroupID).
			Assign(entity.NutritionRecommendation{
				AmountInGrams:      rec.AmountInGrams,
				AmountInPercentage: rec.AmountInPercentage,
				NutritionGroupID:   rec.NutritionGroupID,
				RuleID:             rec.RuleID,
			}).
			FirstOrCreate(&rec)
	}

	PortionRecommendations := []entity.PortionRecommendation{
		{Amount: 3, FoodGroupID: 1, MealTimeID: 1, RuleID: 1}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 1},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 1},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 1},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 1, RuleID: 1},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 1, RuleID: 1},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 1},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 1}, //กลางวัน
		{Amount: 3.5, FoodGroupID: 2, MealTimeID: 2, RuleID: 1},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 1},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 2, RuleID: 1},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 2, RuleID: 1},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 2, RuleID: 1},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 1},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 1}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 1},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 1},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 1},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 3, RuleID: 1},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 3, RuleID: 1},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 1},

		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 2}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 2},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 2},
		{Amount: 1.5, FoodGroupID: 4, MealTimeID: 1, RuleID: 2},
		{Amount: 3.5, FoodGroupID: 5, MealTimeID: 1, RuleID: 2},
		{Amount: 3.5, FoodGroupID: 6, MealTimeID: 1, RuleID: 2},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 2},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 2}, //กลางวัน
		{Amount: 3, FoodGroupID: 2, MealTimeID: 2, RuleID: 2},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 2},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 2, RuleID: 2},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 2, RuleID: 2},
		{Amount: 3.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 2},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 2},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 2}, //เย็น
		{Amount: 1, FoodGroupID: 2, MealTimeID: 3, RuleID: 2},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 2},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 2},
		{Amount: 3.5, FoodGroupID: 5, MealTimeID: 3, RuleID: 2},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 3, RuleID: 2},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 2},

		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 3}, //เช้า
		{Amount: 1, FoodGroupID: 2, MealTimeID: 1, RuleID: 3},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 3},
		{Amount: 1.5, FoodGroupID: 4, MealTimeID: 1, RuleID: 3},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 1, RuleID: 3},
		{Amount: 3.5, FoodGroupID: 6, MealTimeID: 1, RuleID: 3},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 3},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 3}, //กลางวัน
		{Amount: 3.5, FoodGroupID: 2, MealTimeID: 2, RuleID: 3},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 3},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 2, RuleID: 3},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 2, RuleID: 3},
		{Amount: 3.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 3},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 3},
		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 3}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 3},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 3},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 3},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 3, RuleID: 3},
		{Amount: 3.5, FoodGroupID: 6, MealTimeID: 3, RuleID: 3},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 3},

		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 4}, //เช้า
		{Amount: 1.5, FoodGroupID: 2, MealTimeID: 1, RuleID: 4},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 1, RuleID: 4},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 4},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 1, RuleID: 4},
		{Amount: 4, FoodGroupID: 6, MealTimeID: 1, RuleID: 4},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 4},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 4}, //กลางวัน
		{Amount: 3.5, FoodGroupID: 2, MealTimeID: 2, RuleID: 4},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 4},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 4},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 2, RuleID: 4},
		{Amount: 4, FoodGroupID: 6, MealTimeID: 2, RuleID: 4},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 4},
		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 4}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 4},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 3, RuleID: 4},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 4},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 3, RuleID: 4},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 3, RuleID: 4},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 4},

		{Amount: 3, FoodGroupID: 1, MealTimeID: 1, RuleID: 5}, //เช้า
		{Amount: 1, FoodGroupID: 2, MealTimeID: 1, RuleID: 5},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 5},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 5},
		{Amount: 2, FoodGroupID: 5, MealTimeID: 1, RuleID: 5},
		{Amount: 3.5, FoodGroupID: 6, MealTimeID: 1, RuleID: 5},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 5},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 5}, //กลางวัน
		{Amount: 3, FoodGroupID: 2, MealTimeID: 2, RuleID: 5},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 5},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 2, RuleID: 5},
		{Amount: 2, FoodGroupID: 5, MealTimeID: 2, RuleID: 5},
		{Amount: 3.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 5},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 5},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 5}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 5},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 5},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 5},
		{Amount: 2, FoodGroupID: 5, MealTimeID: 3, RuleID: 5},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 3, RuleID: 5},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 5},

		{Amount: 3, FoodGroupID: 1, MealTimeID: 1, RuleID: 6}, //เช้า
		{Amount: 1.5, FoodGroupID: 2, MealTimeID: 1, RuleID: 6},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 6},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 6},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 1, RuleID: 6},
		{Amount: 3.5, FoodGroupID: 6, MealTimeID: 1, RuleID: 6},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 6},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 6}, //กลางวัน
		{Amount: 3, FoodGroupID: 2, MealTimeID: 2, RuleID: 6},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 6},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 6},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 2, RuleID: 6},
		{Amount: 3.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 6},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 6},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 6}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 6},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 6},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 6},
		{Amount: 2, FoodGroupID: 5, MealTimeID: 3, RuleID: 6},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 3, RuleID: 6},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 6},

		{Amount: 3, FoodGroupID: 1, MealTimeID: 1, RuleID: 7}, //เช้า
		{Amount: 1.5, FoodGroupID: 2, MealTimeID: 1, RuleID: 7},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 7},
		{Amount: 3, FoodGroupID: 4, MealTimeID: 1, RuleID: 7},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 1, RuleID: 7},
		{Amount: 4, FoodGroupID: 6, MealTimeID: 1, RuleID: 7},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 7},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 7}, //กลางวัน
		{Amount: 4, FoodGroupID: 2, MealTimeID: 2, RuleID: 7},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 7},
		{Amount: 2, FoodGroupID: 4, MealTimeID: 2, RuleID: 7},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 2, RuleID: 7},
		{Amount: 4, FoodGroupID: 6, MealTimeID: 2, RuleID: 7},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 7},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 7}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 7},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 3, RuleID: 7},
		{Amount: 3, FoodGroupID: 4, MealTimeID: 3, RuleID: 7},
		{Amount: 2, FoodGroupID: 5, MealTimeID: 3, RuleID: 7},
		{Amount: 4, FoodGroupID: 6, MealTimeID: 3, RuleID: 7},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 7},

		{Amount: 3, FoodGroupID: 1, MealTimeID: 1, RuleID: 8}, //เช้า
		{Amount: 1.5, FoodGroupID: 2, MealTimeID: 1, RuleID: 8},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 1, RuleID: 8},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 8},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 1, RuleID: 8},
		{Amount: 5, FoodGroupID: 6, MealTimeID: 1, RuleID: 8},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 8},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 8}, //กลางวัน
		{Amount: 4, FoodGroupID: 2, MealTimeID: 2, RuleID: 8},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 8},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 8},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 2, RuleID: 8},
		{Amount: 4, FoodGroupID: 6, MealTimeID: 2, RuleID: 8},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 8},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 8}, //เย็น
		{Amount: 1, FoodGroupID: 2, MealTimeID: 3, RuleID: 8},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 3, RuleID: 8},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 8},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 3, RuleID: 8},
		{Amount: 4, FoodGroupID: 6, MealTimeID: 3, RuleID: 8},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 8},

		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 9}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 9},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 9},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 9},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 1, RuleID: 9},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 1, RuleID: 9},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 9},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 9}, //กลางวัน
		{Amount: 2, FoodGroupID: 2, MealTimeID: 2, RuleID: 9},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 9},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 2, RuleID: 9},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 2, RuleID: 9},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 2, RuleID: 9},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 9},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 9}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 9},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 9},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 9},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 3, RuleID: 9},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 3, RuleID: 9},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 9},

		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 10}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 10},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 10},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 10},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 1, RuleID: 10},
		{Amount: 2.5, FoodGroupID: 6, MealTimeID: 1, RuleID: 10},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 10},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 10}, //กลางวัน
		{Amount: 3, FoodGroupID: 2, MealTimeID: 2, RuleID: 10},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 10},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 2, RuleID: 10},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 2, RuleID: 10},
		{Amount: 2.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 10},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 10},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 10}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 10},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 10},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 10},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 3, RuleID: 10},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 3, RuleID: 10},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 10},

		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 11}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 11},
		{Amount: 2.5, FoodGroupID: 3, MealTimeID: 1, RuleID: 11},
		{Amount: 1.5, FoodGroupID: 4, MealTimeID: 1, RuleID: 11},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 1, RuleID: 11},
		{Amount: 2.5, FoodGroupID: 6, MealTimeID: 1, RuleID: 11},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 11},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 11}, //กลางวัน
		{Amount: 3, FoodGroupID: 2, MealTimeID: 2, RuleID: 11},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 11},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 2, RuleID: 11},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 2, RuleID: 11},
		{Amount: 2.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 11},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 11},
		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 11}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 11},
		{Amount: 2.5, FoodGroupID: 3, MealTimeID: 3, RuleID: 11},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 11},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 3, RuleID: 11},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 3, RuleID: 11},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 11},

		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 12}, //เช้า
		{Amount: 1, FoodGroupID: 2, MealTimeID: 1, RuleID: 12},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 1, RuleID: 12},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 12},
		{Amount: 6.5, FoodGroupID: 5, MealTimeID: 1, RuleID: 12},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 1, RuleID: 12},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 12},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 2, RuleID: 12}, //กลางวัน
		{Amount: 1, FoodGroupID: 2, MealTimeID: 2, RuleID: 12},
		{Amount: 2.5, FoodGroupID: 3, MealTimeID: 2, RuleID: 12},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 12},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 2, RuleID: 12},
		{Amount: 2.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 12},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 12},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 12}, //เย็น
		{Amount: 1, FoodGroupID: 2, MealTimeID: 3, RuleID: 12},
		{Amount: 2.5, FoodGroupID: 3, MealTimeID: 3, RuleID: 12},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 12},
		{Amount: 6.5, FoodGroupID: 5, MealTimeID: 3, RuleID: 12},
		{Amount: 2.5, FoodGroupID: 6, MealTimeID: 3, RuleID: 12},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 12},

		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 13}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 13},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 13},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 13},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 1, RuleID: 13},
		{Amount: 1.5, FoodGroupID: 6, MealTimeID: 1, RuleID: 13},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 13},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 13}, //กลางวัน
		{Amount: 2, FoodGroupID: 2, MealTimeID: 2, RuleID: 13},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 13},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 2, RuleID: 13},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 2, RuleID: 13},
		{Amount: 1.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 13},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 13},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 13}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 13},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 13},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 13},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 3, RuleID: 13},
		{Amount: 1.5, FoodGroupID: 6, MealTimeID: 3, RuleID: 13},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 13},

		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 14}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 14},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 14},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 14},
		{Amount: 7, FoodGroupID: 5, MealTimeID: 1, RuleID: 14},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 1, RuleID: 14},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 14},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 14}, //กลางวัน
		{Amount: 3, FoodGroupID: 2, MealTimeID: 2, RuleID: 14},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 14},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 2, RuleID: 14},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 2, RuleID: 14},
		{Amount: 1.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 14},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 14},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 14}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 14},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 14},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 14},
		{Amount: 7, FoodGroupID: 5, MealTimeID: 3, RuleID: 14},
		{Amount: 1.5, FoodGroupID: 6, MealTimeID: 3, RuleID: 14},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 14},

		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 15}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 15},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 15},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 15},
		{Amount: 7.5, FoodGroupID: 5, MealTimeID: 1, RuleID: 15},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 1, RuleID: 15},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 15},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 15}, //กลางวัน
		{Amount: 3, FoodGroupID: 2, MealTimeID: 2, RuleID: 15},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 15},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 15},
		{Amount: 7, FoodGroupID: 5, MealTimeID: 2, RuleID: 15},
		{Amount: 1.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 15},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 15},
		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 15}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 15},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 15},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 15},
		{Amount: 7.5, FoodGroupID: 5, MealTimeID: 3, RuleID: 15},
		{Amount: 1.5, FoodGroupID: 6, MealTimeID: 3, RuleID: 15},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 15},

		{Amount: 4, FoodGroupID: 1, MealTimeID: 1, RuleID: 16}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 16},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 1, RuleID: 16},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 16},
		{Amount: 8, FoodGroupID: 5, MealTimeID: 1, RuleID: 16},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 1, RuleID: 16},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 16},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 16}, //กลางวัน
		{Amount: 3, FoodGroupID: 2, MealTimeID: 2, RuleID: 16},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 16},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 16},
		{Amount: 8, FoodGroupID: 5, MealTimeID: 2, RuleID: 16},
		{Amount: 1.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 16},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 16},
		{Amount: 3.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 16}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 16},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 3, RuleID: 16},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 16},
		{Amount: 8, FoodGroupID: 5, MealTimeID: 3, RuleID: 16},
		{Amount: 1.5, FoodGroupID: 6, MealTimeID: 3, RuleID: 16},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 16},

		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 17}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 17},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 17},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 17},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 1, RuleID: 17},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 1, RuleID: 17},
		{Amount: 0, FoodGroupID: 8, MealTimeID: 1, RuleID: 17},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 2, RuleID: 17}, //กลางวัน
		{Amount: 0, FoodGroupID: 2, MealTimeID: 2, RuleID: 17},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 17},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 2, RuleID: 17},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 2, RuleID: 17},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 2, RuleID: 17},
		{Amount: 0, FoodGroupID: 8, MealTimeID: 2, RuleID: 17},
		{Amount: 2, FoodGroupID: 1, MealTimeID: 3, RuleID: 17}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 17},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 17},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 3, RuleID: 17},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 3, RuleID: 17},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 3, RuleID: 17},
		{Amount: 1, FoodGroupID: 8, MealTimeID: 3, RuleID: 17},

		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 18}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 18},
		{Amount: 2.5, FoodGroupID: 3, MealTimeID: 1, RuleID: 18},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 18},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 1, RuleID: 18},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 1, RuleID: 18},
		{Amount: 0, FoodGroupID: 8, MealTimeID: 1, RuleID: 18},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 2, RuleID: 18}, //กลางวัน
		{Amount: 0, FoodGroupID: 2, MealTimeID: 2, RuleID: 18},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 18},
		{Amount: 0.5, FoodGroupID: 4, MealTimeID: 2, RuleID: 18},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 2, RuleID: 18},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 2, RuleID: 18},
		{Amount: 0, FoodGroupID: 8, MealTimeID: 2, RuleID: 18},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 18}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 18},
		{Amount: 2.5, FoodGroupID: 3, MealTimeID: 3, RuleID: 18},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 18},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 3, RuleID: 18},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 3, RuleID: 18},
		{Amount: 1, FoodGroupID: 8, MealTimeID: 3, RuleID: 18},

		{Amount: 3, FoodGroupID: 1, MealTimeID: 1, RuleID: 19}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 19},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 1, RuleID: 19},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 19},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 1, RuleID: 19},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 1, RuleID: 19},
		{Amount: 0, FoodGroupID: 8, MealTimeID: 1, RuleID: 19},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 2, RuleID: 19}, //กลางวัน
		{Amount: 0, FoodGroupID: 2, MealTimeID: 2, RuleID: 19},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 19},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 19},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 2, RuleID: 19},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 2, RuleID: 19},
		{Amount: 0, FoodGroupID: 8, MealTimeID: 2, RuleID: 19},
		{Amount: 2, FoodGroupID: 1, MealTimeID: 3, RuleID: 19}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 19},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 3, RuleID: 19},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 19},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 3, RuleID: 19},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 3, RuleID: 19},
		{Amount: 1, FoodGroupID: 8, MealTimeID: 3, RuleID: 19},

		{Amount: 3, FoodGroupID: 1, MealTimeID: 1, RuleID: 20}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 20},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 1, RuleID: 20},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 20},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 1, RuleID: 20},
		{Amount: 1.5, FoodGroupID: 6, MealTimeID: 1, RuleID: 20},
		{Amount: 0, FoodGroupID: 8, MealTimeID: 1, RuleID: 20},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 2, RuleID: 20}, //กลางวัน
		{Amount: 0, FoodGroupID: 2, MealTimeID: 2, RuleID: 20},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 2, RuleID: 20},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 20},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 2, RuleID: 20},
		{Amount: 1.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 20},
		{Amount: 0, FoodGroupID: 8, MealTimeID: 2, RuleID: 20},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 20}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 20},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 3, RuleID: 20},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 3, RuleID: 20},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 3, RuleID: 20},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 3, RuleID: 20},
		{Amount: 1, FoodGroupID: 8, MealTimeID: 3, RuleID: 20},

		{Amount: 3, FoodGroupID: 1, MealTimeID: 1, RuleID: 21}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 21},
		{Amount: 3.5, FoodGroupID: 3, MealTimeID: 1, RuleID: 21},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 21},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 1, RuleID: 21},
		{Amount: 1.5, FoodGroupID: 6, MealTimeID: 1, RuleID: 21},
		{Amount: 0.5, FoodGroupID: 8, MealTimeID: 1, RuleID: 21},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 2, RuleID: 21}, //กลางวัน
		{Amount: 0, FoodGroupID: 2, MealTimeID: 2, RuleID: 21},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 2, RuleID: 21},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 21},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 2, RuleID: 21},
		{Amount: 1.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 21},
		{Amount: 0, FoodGroupID: 8, MealTimeID: 2, RuleID: 21},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 21}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 21},
		{Amount: 3.5, FoodGroupID: 3, MealTimeID: 3, RuleID: 21},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 3, RuleID: 21},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 3, RuleID: 21},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 3, RuleID: 21},
		{Amount: 1, FoodGroupID: 8, MealTimeID: 3, RuleID: 21},

		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 22}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 22},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 22},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 22},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 1, RuleID: 22},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 1, RuleID: 22},
		{Amount: 0, FoodGroupID: 8, MealTimeID: 1, RuleID: 22},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 2, RuleID: 22}, //กลางวัน
		{Amount: 0, FoodGroupID: 2, MealTimeID: 2, RuleID: 22},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 22},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 2, RuleID: 22},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 2, RuleID: 22},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 2, RuleID: 22},
		{Amount: 0, FoodGroupID: 8, MealTimeID: 2, RuleID: 22},
		{Amount: 2, FoodGroupID: 1, MealTimeID: 3, RuleID: 22}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 22},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 22},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 3, RuleID: 22},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 3, RuleID: 22},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 3, RuleID: 22},
		{Amount: 1, FoodGroupID: 8, MealTimeID: 3, RuleID: 22},

		{Amount: 2, FoodGroupID: 1, MealTimeID: 1, RuleID: 23}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 23},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 23},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 23},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 1, RuleID: 23},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 1, RuleID: 23},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 23},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 23}, //กลางวัน
		{Amount: 3, FoodGroupID: 2, MealTimeID: 2, RuleID: 23},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 23},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 23},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 2, RuleID: 23},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 2, RuleID: 23},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 23},
		{Amount: 2, FoodGroupID: 1, MealTimeID: 3, RuleID: 23}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 23},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 23},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 23},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 3, RuleID: 23},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 3, RuleID: 23},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 23},

		{Amount: 3, FoodGroupID: 1, MealTimeID: 1, RuleID: 24}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 24},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 24},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 24},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 1, RuleID: 24},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 1, RuleID: 24},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 24},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 24}, //กลางวัน
		{Amount: 2, FoodGroupID: 2, MealTimeID: 2, RuleID: 24},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 24},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 24},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 2, RuleID: 24},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 2, RuleID: 24},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 24},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 24}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 24},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 24},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 24},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 3, RuleID: 24},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 3, RuleID: 24},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 24},

		{Amount: 2, FoodGroupID: 1, MealTimeID: 1, RuleID: 25}, //เช้า
		{Amount: 1, FoodGroupID: 2, MealTimeID: 1, RuleID: 25},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 25},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 25},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 1, RuleID: 25},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 1, RuleID: 25},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 25},
		{Amount: 2, FoodGroupID: 1, MealTimeID: 2, RuleID: 25}, //กลางวัน
		{Amount: 1, FoodGroupID: 2, MealTimeID: 2, RuleID: 25},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 25},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 25},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 2, RuleID: 25},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 2, RuleID: 25},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 25},
		{Amount: 2, FoodGroupID: 1, MealTimeID: 3, RuleID: 25}, //เย็น
		{Amount: 1, FoodGroupID: 2, MealTimeID: 3, RuleID: 25},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 25},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 25},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 3, RuleID: 25},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 3, RuleID: 25},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 25},

		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 26}, //เช้า
		{Amount: 1, FoodGroupID: 2, MealTimeID: 1, RuleID: 26},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 26},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 26},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 1, RuleID: 26},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 1, RuleID: 26},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 26},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 2, RuleID: 26}, //กลางวัน
		{Amount: 1, FoodGroupID: 2, MealTimeID: 2, RuleID: 26},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 26},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 26},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 2, RuleID: 26},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 2, RuleID: 26},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 26},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 26}, //เย็น
		{Amount: 1, FoodGroupID: 2, MealTimeID: 3, RuleID: 26},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 26},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 26},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 3, RuleID: 26},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 3, RuleID: 26},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 26},

		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 27}, //เช้า
		{Amount: 1, FoodGroupID: 2, MealTimeID: 1, RuleID: 27},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 27},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 27},
		{Amount: 2, FoodGroupID: 5, MealTimeID: 1, RuleID: 27},
		{Amount: 2.5, FoodGroupID: 6, MealTimeID: 1, RuleID: 27},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 27},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 27}, //กลางวัน
		{Amount: 3, FoodGroupID: 2, MealTimeID: 2, RuleID: 27},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 27},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 27},
		{Amount: 2, FoodGroupID: 5, MealTimeID: 2, RuleID: 27},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 2, RuleID: 27},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 27},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 27}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 27},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 27},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 27},
		{Amount: 2, FoodGroupID: 5, MealTimeID: 3, RuleID: 27},
		{Amount: 2.5, FoodGroupID: 6, MealTimeID: 3, RuleID: 27},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 27},

		{Amount: 2, FoodGroupID: 1, MealTimeID: 1, RuleID: 28}, //เช้า
		{Amount: 1, FoodGroupID: 2, MealTimeID: 1, RuleID: 28},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 28},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 28},
		{Amount: 2, FoodGroupID: 5, MealTimeID: 1, RuleID: 28},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 1, RuleID: 28},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 28},
		{Amount: 2, FoodGroupID: 1, MealTimeID: 2, RuleID: 28}, //กลางวัน
		{Amount: 0, FoodGroupID: 2, MealTimeID: 2, RuleID: 28},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 28},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 28},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 2, RuleID: 28},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 2, RuleID: 28},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 28},
		{Amount: 2, FoodGroupID: 1, MealTimeID: 3, RuleID: 28}, //เย็น
		{Amount: 1, FoodGroupID: 2, MealTimeID: 3, RuleID: 28},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 28},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 28},
		{Amount: 2, FoodGroupID: 5, MealTimeID: 3, RuleID: 28},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 3, RuleID: 28},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 28},

		{Amount: 0, FoodGroupID: 1, MealTimeID: 1, RuleID: 29}, //เช้า
		{Amount: 3, FoodGroupID: 2, MealTimeID: 1, RuleID: 29},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 29},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 29},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 1, RuleID: 29},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 1, RuleID: 29},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 29},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 2, RuleID: 29}, //กลางวัน
		{Amount: 0, FoodGroupID: 2, MealTimeID: 2, RuleID: 29},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 29},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 29},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 2, RuleID: 29},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 2, RuleID: 29},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 29},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 29}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 29},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 29},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 29},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 3, RuleID: 29},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 3, RuleID: 29},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 29},

		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 30}, //เช้า
		{Amount: 1, FoodGroupID: 2, MealTimeID: 1, RuleID: 30},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 30},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 30},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 1, RuleID: 30},
		{Amount: 3.5, FoodGroupID: 6, MealTimeID: 1, RuleID: 30},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 30},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 2, RuleID: 30}, //กลางวัน
		{Amount: 1, FoodGroupID: 2, MealTimeID: 2, RuleID: 30},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 30},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 30},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 2, RuleID: 30},
		{Amount: 3.5, FoodGroupID: 6, MealTimeID: 2, RuleID: 30},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 30},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 30}, //เย็น
		{Amount: 0.5, FoodGroupID: 2, MealTimeID: 3, RuleID: 30},
		{Amount: 3, FoodGroupID: 3, MealTimeID: 3, RuleID: 30},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 30},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 3, RuleID: 30},
		{Amount: 3, FoodGroupID: 6, MealTimeID: 3, RuleID: 30},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 30},

		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 31}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 31},
		{Amount: 1, FoodGroupID: 3, MealTimeID: 1, RuleID: 31},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 31},
		{Amount: 3, FoodGroupID: 5, MealTimeID: 1, RuleID: 31},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 1, RuleID: 31},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 31},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 2, RuleID: 31}, //กลางวัน
		{Amount: 0, FoodGroupID: 2, MealTimeID: 2, RuleID: 31},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 31},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 31},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 2, RuleID: 31},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 2, RuleID: 31},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 31},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 31}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 31},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 31},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 31},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 3, RuleID: 31},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 3, RuleID: 31},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 31},

		{Amount: 3, FoodGroupID: 1, MealTimeID: 1, RuleID: 32}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 32},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 32},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 1, RuleID: 32},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 1, RuleID: 32},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 1, RuleID: 32},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 32},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 32}, //กลางวัน
		{Amount: 2, FoodGroupID: 2, MealTimeID: 2, RuleID: 32},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 32},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 32},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 2, RuleID: 32},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 2, RuleID: 32},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 32},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 32}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 32},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 32},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 32},
		{Amount: 4, FoodGroupID: 5, MealTimeID: 3, RuleID: 32},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 3, RuleID: 32},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 32},

		{Amount: 3, FoodGroupID: 1, MealTimeID: 1, RuleID: 33}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 33},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 33},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 1, RuleID: 33},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 1, RuleID: 33},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 1, RuleID: 33},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 33},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 33}, //กลางวัน
		{Amount: 3, FoodGroupID: 2, MealTimeID: 2, RuleID: 33},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 33},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 33},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 2, RuleID: 33},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 2, RuleID: 33},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 33},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 33}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 33},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 33},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 33},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 3, RuleID: 33},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 3, RuleID: 33},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 33},

		{Amount: 3, FoodGroupID: 1, MealTimeID: 1, RuleID: 34}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 34},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 34},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 34},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 1, RuleID: 34},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 1, RuleID: 34},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 34},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 34}, //กลางวัน
		{Amount: 3, FoodGroupID: 2, MealTimeID: 2, RuleID: 34},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 34},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 34},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 2, RuleID: 34},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 2, RuleID: 34},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 34},
		{Amount: 3, FoodGroupID: 1, MealTimeID: 3, RuleID: 34}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 34},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 34},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 34},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 3, RuleID: 34},
		{Amount: 2, FoodGroupID: 6, MealTimeID: 3, RuleID: 34},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 34},

		{Amount: 2, FoodGroupID: 1, MealTimeID: 1, RuleID: 35}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 35},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 35},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 35},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 1, RuleID: 35},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 1, RuleID: 35},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 35},
		{Amount: 2, FoodGroupID: 1, MealTimeID: 2, RuleID: 35}, //กลางวัน
		{Amount: 0, FoodGroupID: 2, MealTimeID: 2, RuleID: 35},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 35},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 35},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 2, RuleID: 35},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 2, RuleID: 35},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 35},
		{Amount: 2, FoodGroupID: 1, MealTimeID: 3, RuleID: 35}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 35},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 35},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 35},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 3, RuleID: 35},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 3, RuleID: 35},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 35},

		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 36}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 36},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 36},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 36},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 1, RuleID: 36},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 1, RuleID: 36},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 36},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 2, RuleID: 36}, //กลางวัน
		{Amount: 0, FoodGroupID: 2, MealTimeID: 2, RuleID: 36},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 36},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 36},
		{Amount: 5, FoodGroupID: 5, MealTimeID: 2, RuleID: 36},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 2, RuleID: 36},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 36},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 36}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 36},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 36},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 36},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 3, RuleID: 36},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 3, RuleID: 36},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 36},

		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 37}, //เช้า
		{Amount: 0, FoodGroupID: 2, MealTimeID: 1, RuleID: 37},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 37},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 1, RuleID: 37},
		{Amount: 6, FoodGroupID: 5, MealTimeID: 1, RuleID: 37},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 1, RuleID: 37},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 37},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 2, RuleID: 37}, //กลางวัน
		{Amount: 3.5, FoodGroupID: 2, MealTimeID: 2, RuleID: 37},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 37},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 2, RuleID: 37},
		{Amount: 7, FoodGroupID: 5, MealTimeID: 2, RuleID: 37},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 2, RuleID: 37},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 37},
		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 3, RuleID: 37}, //เย็น
		{Amount: 0, FoodGroupID: 2, MealTimeID: 3, RuleID: 37},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 37},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 37},
		{Amount: 7, FoodGroupID: 5, MealTimeID: 3, RuleID: 37},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 3, RuleID: 37},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 37},

		{Amount: 2.5, FoodGroupID: 1, MealTimeID: 1, RuleID: 38}, //เช้า
		{Amount: 1, FoodGroupID: 2, MealTimeID: 1, RuleID: 38},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 1, RuleID: 38},
		{Amount: 0, FoodGroupID: 4, MealTimeID: 1, RuleID: 38},
		{Amount: 7, FoodGroupID: 5, MealTimeID: 1, RuleID: 38},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 1, RuleID: 38},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 1, RuleID: 38},
		{Amount: 2, FoodGroupID: 1, MealTimeID: 2, RuleID: 38}, //กลางวัน
		{Amount: 1, FoodGroupID: 2, MealTimeID: 2, RuleID: 38},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 2, RuleID: 38},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 2, RuleID: 38},
		{Amount: 8, FoodGroupID: 5, MealTimeID: 2, RuleID: 38},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 2, RuleID: 38},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 2, RuleID: 38},
		{Amount: 0, FoodGroupID: 1, MealTimeID: 3, RuleID: 38}, //เย็น
		{Amount: 3, FoodGroupID: 2, MealTimeID: 3, RuleID: 38},
		{Amount: 2, FoodGroupID: 3, MealTimeID: 3, RuleID: 38},
		{Amount: 1, FoodGroupID: 4, MealTimeID: 3, RuleID: 38},
		{Amount: 7, FoodGroupID: 5, MealTimeID: 3, RuleID: 38},
		{Amount: 1, FoodGroupID: 6, MealTimeID: 3, RuleID: 38},
		{Amount: 1, FoodGroupID: 7, MealTimeID: 3, RuleID: 38},
	}

	for _, rec := range PortionRecommendations {
		db.Where("rule_id = ? AND food_group_id = ? AND meal_time_id = ?", rec.RuleID, rec.FoodGroupID, rec.MealTimeID).
			Assign(entity.PortionRecommendation{
				Amount:      rec.Amount,
				FoodGroupID: rec.FoodGroupID,
				MealTimeID:  rec.MealTimeID,
				RuleID:      rec.RuleID,
			}).
			FirstOrCreate(&rec)
	}

	Ingredient := []entity.Ingredients{
		{
			Name:   "อะโวคาโด",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Avocado-1.jpg",
			Credit: "https://medthai.com/%E0%B8%AD%E0%B8%B0%E0%B9%82%E0%B8%A7%E0%B8%84%E0%B8%B2%E0%B9%82%E0%B8%94/",
		},
		{
			Name:   "มังคุด",
			Credit: "https://medthai.com/%E0%B8%A1%E0%B8%B1%E0%B8%87%E0%B8%84%E0%B8%B8%E0%B8%94/",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Mangosteen-1.jpg",
		},
		{
			Name:   "แก้วมังกร",
			Credit: "https://medthai.com/%E0%B9%81%E0%B8%81%E0%B9%89%E0%B8%A7%E0%B8%A1%E0%B8%B1%E0%B8%87%E0%B8%81%E0%B8%A3/",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Dragon-fruit-1.jpg",
		},
		{
			Name:   "สัปปะรด",
			Credit: "https://medthai.com/%E0%B8%AA%E0%B8%B1%E0%B8%9A%E0%B8%9B%E0%B8%B0%E0%B8%A3%E0%B8%94/",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Pineapple-1.jpg",
		},
		{
			Name:   "มะพร้าว",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Coconut-1.jpg",
			Credit: "https://medthai.com/%E0%B8%A1%E0%B8%B0%E0%B8%9E%E0%B8%A3%E0%B9%89%E0%B8%B2%E0%B8%A7/",
		},
		{
			Name:   "กล้วย",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Banana-1.jpg",
			Credit: "https://medthai.com/%E0%B8%81%E0%B8%A5%E0%B9%89%E0%B8%A7%E0%B8%A2/",
		},
		{
			Name:   "อินทผลัม",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/%E0%B8%AD%E0%B8%B4%E0%B8%99%E0%B8%97%E0%B8%9C%E0%B8%B2%E0%B8%A5%E0%B8%B1%E0%B8%A1.jpg",
			Credit: "https://medthai.com/%E0%B8%AD%E0%B8%B4%E0%B8%99%E0%B8%97%E0%B8%9C%E0%B8%A5%E0%B8%B1%E0%B8%A1/",
		},
		{
			Name:   "เสารส",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Passion-Fruit-1.jpg",
			Credit: "https://medthai.com/%E0%B9%80%E0%B8%AA%E0%B8%B2%E0%B8%A7%E0%B8%A3%E0%B8%AA/",
		},
		{
			Name:   "หม่อน",
			Image:  "https://medthai.com/wp-content/uploads/2014/07/%E0%B8%AB%E0%B8%A1%E0%B9%88%E0%B8%AD%E0%B8%99.jpg",
			Credit: "https://medthai.com/%E0%B8%AB%E0%B8%A1%E0%B9%88%E0%B8%AD%E0%B8%99/",
		},
		{
			Name:   "กระท้อน",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Santol-3.jpg",
			Credit: "https://medthai.com/%E0%B8%81%E0%B8%A3%E0%B8%B0%E0%B8%97%E0%B9%89%E0%B8%AD%E0%B8%99/",
		},
		{
			Name:   "แอปเปิ้ล",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Apple-1.jpg",
			Credit: "https://medthai.com/%E0%B9%81%E0%B8%AD%E0%B8%9B%E0%B9%80%E0%B8%9B%E0%B8%B4%E0%B9%89%E0%B8%A5/",
		},
		{
			Name:   "ส้ม",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Orange-1.jpg",
			Credit: "https://medthai.com/%E0%B8%AA%E0%B9%89%E0%B8%A1/",
		},
		{
			Name:   "หอมแดง",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Shallot-1.jpg",
			Credit: "https://medthai.com/%E0%B8%AB%E0%B8%AD%E0%B8%A1%E0%B9%81%E0%B8%94%E0%B8%87/",
		},
		{
			Name:   "มะเบือยาว",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Eggplant-1.jpg",
			Credit: "https://medthai.com/%E0%B8%A1%E0%B8%B0%E0%B9%80%E0%B8%82%E0%B8%B7%E0%B8%AD%E0%B8%A2%E0%B8%B2%E0%B8%A7/",
		},
		{
			Name:   "พริก",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Chili-1.jpg",
			Credit: "https://medthai.com/%E0%B8%9E%E0%B8%A3%E0%B8%B4%E0%B8%81/",
		},
		{
			Name:   "ผักชี",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Coriander-1.jpg",
			Credit: "https://medthai.com/%E0%B8%9C%E0%B8%B1%E0%B8%81%E0%B8%8A%E0%B8%B5/",
		},
		{
			Name:   "บัวบก",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Gotu-kola-1.jpg",
			Credit: "https://medthai.com/%E0%B9%83%E0%B8%9A%E0%B8%9A%E0%B8%B1%E0%B8%A7%E0%B8%9A%E0%B8%81/",
		},
		{
			Name:   "บร็อคโคลี่",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/%E0%B8%9A%E0%B8%A3%E0%B9%87%E0%B8%AD%E0%B8%84%E0%B9%82%E0%B8%84%E0%B8%A5%E0%B8%B5%E0%B9%88.jpg",
			Credit: "https://medthai.com/%E0%B8%9A%E0%B8%A3%E0%B9%87%E0%B8%AD%E0%B8%84%E0%B9%82%E0%B8%84%E0%B8%A5%E0%B8%B5%E0%B9%88/",
		},
		{
			Name:   "ฝรั่ง",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Guava-1.jpg",
			Credit: "https://medthai.com/%E0%B8%9D%E0%B8%A3%E0%B8%B1%E0%B9%88%E0%B8%87/",
		},
		{
			Name:   "แตงโม",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/%E0%B8%A3%E0%B8%B9%E0%B8%9B%E0%B9%81%E0%B8%95%E0%B8%87%E0%B9%82%E0%B8%A1.jpg",
			Credit: "https://medthai.com/%E0%B9%81%E0%B8%95%E0%B8%87%E0%B9%82%E0%B8%A1/",
		},
		{
			Name:   "ทุเรียน",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Durian-1.jpg",
			Credit: "https://medthai.com/%E0%B8%97%E0%B8%B8%E0%B9%80%E0%B8%A3%E0%B8%B5%E0%B8%A2%E0%B8%99/",
		},
		{
			Name:   "เชอร์รี่",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Cherry-1.jpg",
			Credit: "https://medthai.com/%E0%B9%80%E0%B8%8A%E0%B8%AD%E0%B8%A3%E0%B9%8C%E0%B8%A3%E0%B8%B5%E0%B9%88/",
		},
		{
			Name:   "กีวี่",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Kiwifruit-1.jpg",
			Credit: "https://medthai.com/%E0%B8%81%E0%B8%B5%E0%B8%A7%E0%B8%B5%E0%B9%88/",
		},
		{
			Name:   "มะม่วง",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Mango-1.jpg",
			Credit: "https://medthai.com/%E0%B8%A1%E0%B8%B0%E0%B8%A1%E0%B9%88%E0%B8%A7%E0%B8%87/",
		},
		{
			Name:   "แคนตาลูป",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/%E0%B9%81%E0%B8%84%E0%B8%99%E0%B8%95%E0%B8%B2%E0%B8%A5%E0%B8%B9%E0%B8%9B.jpg",
			Credit: "https://medthai.com/%E0%B9%81%E0%B8%84%E0%B8%99%E0%B8%95%E0%B8%B2%E0%B8%A5%E0%B8%B9%E0%B8%9B/",
		},
		{
			Name:   "แตงไทย",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/%E0%B9%81%E0%B8%95%E0%B8%87%E0%B9%84%E0%B8%97%E0%B8%A2.jpg",
			Credit: "https://medthai.com/%E0%B9%81%E0%B8%95%E0%B8%87%E0%B9%84%E0%B8%97%E0%B8%A2/",
		},
		{
			Name:   "ทับทิม",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Pomegranate-1.jpg",
			Credit: "https://medthai.com/%E0%B8%97%E0%B8%B1%E0%B8%9A%E0%B8%97%E0%B8%B4%E0%B8%A1/",
		},
		{
			Name:   "น้อยหน่า",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Custard-Apple-1.jpg",
			Credit: "https://medthai.com/%E0%B8%99%E0%B9%89%E0%B8%AD%E0%B8%A2%E0%B8%AB%E0%B8%99%E0%B9%88%E0%B8%B2/",
		},
		{
			Name:   "มะขาม",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Tamarind-1.jpg",
			Credit: "https://medthai.com/%E0%B8%A1%E0%B8%B0%E0%B8%82%E0%B8%B2%E0%B8%A1/",
		},
		{
			Name:   "มังคุด",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Mangosteen-1.jpg",
			Credit: "https://medthai.com/%E0%B8%A1%E0%B8%B1%E0%B8%87%E0%B8%84%E0%B8%B8%E0%B8%94/",
		},
		{
			Name:   "มะพร้าว",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Coconut-1.jpg",
			Credit: "https://medthai.com/%E0%B8%A1%E0%B8%B0%E0%B8%9E%E0%B8%A3%E0%B9%89%E0%B8%B2%E0%B8%A7/",
		},
		{
			Name:   "มะละกอ",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Papaya-1.jpg",
			Credit: "https://medthai.com/%E0%B8%A1%E0%B8%B0%E0%B8%A5%E0%B8%B0%E0%B8%81%E0%B8%AD/",
		},
		{
			Name:   "มะปราง",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/%E0%B8%A1%E0%B8%B0%E0%B8%9B%E0%B8%A3%E0%B8%B2%E0%B8%87.jpg",
			Credit: "https://medthai.com/%E0%B8%A1%E0%B8%B0%E0%B8%9B%E0%B8%A3%E0%B8%B2%E0%B8%87/",
		},
		{
			Name:   "ลองกอง",
			Image:  "https://medthai.com/wp-content/uploads/2013/11/%E0%B8%A5%E0%B8%AD%E0%B8%87%E0%B8%81%E0%B8%AD%E0%B8%87.jpg",
			Credit: "https://medthai.com/%E0%B8%A5%E0%B8%AD%E0%B8%87%E0%B8%81%E0%B8%AD%E0%B8%87/",
		},
		{
			Name:   "ลำไย",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Longan-1.jpg",
			Credit: "https://medthai.com/%E0%B8%A5%E0%B8%B3%E0%B9%84%E0%B8%A2/",
		},
		{
			Name:   "ลิ้นจี่",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Lychee-1.jpg",
			Credit: "https://medthai.com/%E0%B8%A5%E0%B8%B4%E0%B9%89%E0%B8%99%E0%B8%88%E0%B8%B5%E0%B9%88/",
		},
		{
			Name:   "สตรอเบอร์รี่",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/รูปสตรอเบอร์รี่.jpg",
			Credit: "https://medthai.com/สตรอเบอร์รี่/",
		},
		{
			Name:   "ส้มโอ",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Pomelo-1.jpg",
			Credit: "https://medthai.com/ส้มโอ/",
		},
		{
			Name:   "สาลี่",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Chinese-pear-1.jpg",
			Credit: "https://medthai.com/สาลี่/",
		},
		{
			Name:   "ส้ม",
			Image:  "https://medthai.com/wp-content/uploads/2013/07/Orange-1.jpg",
			Credit: "https://medthai.com/ส้ม/",
		},
		{Name: "อัญชัน", Image: "https://medthai.com/wp-content/uploads/2013/07/Butterfly-pea-1.jpg", Credit: "https://medthai.com/อัญชัน/"},
		{Name: "มะกรูด", Image: "https://medthai.com/wp-content/uploads/2013/07/Kaffir-lime-1.jpg", Credit: "https://medthai.com/มะกรูด/"},
		{Name: "ตะไคร้", Image: "https://medthai.com/wp-content/uploads/2013/07/Lemongrass-1.jpg", Credit: "https://medthai.com/ตะไคร้/"},
		{Name: "กระเทียม", Image: "https://medthai.com/wp-content/uploads/2013/07/Garlic-1.jpg", Credit: "https://medthai.com/กระเทียม/"},
		{Name: "มะเขือเทศ", Image: "https://medthai.com/wp-content/uploads/2013/07/Tomato-1.jpg", Credit: "https://medthai.com/มะเขือเทศ/"},
		{Name: "ฟักทอง", Image: "https://medthai.com/wp-content/uploads/2013/07/Pumpkin-1.jpg", Credit: "https://medthai.com/ฟักทอง/"},
		{Name: "แครอท", Image: "https://medthai.com/wp-content/uploads/2013/07/Carrot-1.jpg", Credit: "https://medthai.com/แครอท/"},
		{Name: "มะรุม", Image: "https://medthai.com/wp-content/uploads/2013/07/Moringa-1.jpg", Credit: "https://medthai.com/มะรุม/"},
		{Name: "มะระขี้นก", Image: "https://medthai.com/wp-content/uploads/2013/07/Momordica-charantia-1.jpg", Credit: "https://medthai.com/มะระขี้นก/"},
		{Name: "กะเพรา", Image: "https://medthai.com/wp-content/uploads/2013/07/Holy-basil-1.jpg", Credit: "https://medthai.com/กะเพรา/"},
		{Name: "โหระพา", Image: "https://medthai.com/wp-content/uploads/2013/07/Sweet-Basil-1.jpg", Credit: "https://medthai.com/โหระพา/"},
		{Name: "กระเจี๊ยบเขียว", Image: "https://medthai.com/wp-content/uploads/2013/09/กระเจี๊ยบเขียว.jpg", Credit: "https://medthai.com/กระเจี๊ยบเขียว/"},
		{Name: "ตำลึง", Image: "https://medthai.com/wp-content/uploads/2013/07/Ivy-Gourd-1.jpg", Credit: "https://medthai.com/ตำลึง/"},
		{Name: "สะตอ", Image: "https://medthai.com/wp-content/uploads/2013/07/สะตอ.jpg", Credit: "https://medthai.com/สะตอ/"},
		{Name: "ผักบุ้ง", Image: "https://medthai.com/wp-content/uploads/2013/07/Swamp-cabbage-1.jpg", Credit: "https://medthai.com/ผักบุ้ง/"},
		{Name: "แตงกวา", Image: "https://medthai.com/wp-content/uploads/2013/07/Cucumber-1.jpg", Credit: "https://medthai.com/แตงกวา/"},
		{Name: "กะหล่ำปลี", Image: "https://medthai.com/wp-content/uploads/2013/07/Cabbage-1.jpg", Credit: "https://medthai.com/กะหล่ำปลี/"},
		{Name: "กระชาย", Image: "https://medthai.com/wp-content/uploads/2013/08/ต้นกระชาย.jpg", Credit: "https://medthai.com/กระชาย/"},
		{Name: "ขิง", Image: "https://medthai.com/wp-content/uploads/2013/07/Ginger-1.jpg", Credit: "https://medthai.com/ขิง/"},
		{Name: "ผักคะน้า", Image: "https://medthai.com/wp-content/uploads/2013/07/Kai-Lan-1.jpg", Credit: "https://medthai.com/ผักคะน้า/"},
		{Name: "ชะอม", Image: "https://medthai.com/wp-content/uploads/2013/07/Climbing-Wattle-1.jpg", Credit: "https://medthai.com/ชะอม/"},
		{Name: "ถั่วงอก", Image: "https://medthai.com/wp-content/uploads/2013/07/Bean-Sprouts-1.jpg", Credit: "https://medthai.com/ถั่วงอก/"},
		{Name: "ถั่วลันเตา", Image: "https://medthai.com/wp-content/uploads/2013/10/ถั่วลันเตา1.jpg", Credit: "https://medthai.com/ถั่วลันเตา/"},
	}
	for _, pkg := range Ingredient {
		db.FirstOrCreate(&pkg, entity.Ingredients{Name: pkg.Name})
	}

	hashedPassword, _ := HashPassword("123456")
	users := []entity.Admin{
		{FirstName: "Supaluck", LastName: "Tohthong", UserName: "Eveamare", Password: hashedPassword},
	}

	for _, user := range users {
		db.FirstOrCreate(&user, entity.Admin{FirstName: user.FirstName})
	}

	Tag := []entity.Tag{
		{Name: "ภาคใต้"},
		{Name: "ภาคกลาง"},
		{Name: "ภาคอีสาน"},
		{Name: "ภาคเหนือ"},
		{Name: "ต้ม"},
		{Name: "ยำ"},
		{Name: "น้ำพริก"},
		{Name: "แกง"},
		{Name: "ลาบ"},
		{Name: "เส้น"},
		{Name: "ผัด"},
		{Name: "ทอด"},
		{Name: "นึ่ง"},
		{Name: "ส้มตำ"},
	}

	for _, Tag := range Tag {
		db.FirstOrCreate(&Tag, entity.Tag{
			Name: Tag.Name,
		})
	}

	MenuTag := []entity.MenuTag{
		{MenuID: 1, TagID: 4},
		{MenuID: 1, TagID: 6},
		{MenuID: 2, TagID: 4},
		{MenuID: 2, TagID: 7},
		{MenuID: 3, TagID: 4},
		{MenuID: 3, TagID: 8},
		{MenuID: 4, TagID: 4},
		{MenuID: 4, TagID: 8},
		{MenuID: 5, TagID: 4},
		{MenuID: 5, TagID: 5},
		{MenuID: 6, TagID: 4},
		{MenuID: 6, TagID: 9},
		{MenuID: 7, TagID: 4},
		{MenuID: 7, TagID: 10},
		{MenuID: 8, TagID: 4},
		{MenuID: 8, TagID: 6},
		{MenuID: 9, TagID: 4},
		{MenuID: 9, TagID: 7},
		{MenuID: 10, TagID: 4},
		{MenuID: 10, TagID: 7},

		{MenuID: 11, TagID: 2},
		{MenuID: 11, TagID: 5},
		{MenuID: 12, TagID: 2},
		{MenuID: 12, TagID: 8},
		{MenuID: 13, TagID: 2},
		{MenuID: 13, TagID: 11},
		{MenuID: 14, TagID: 2},
		{MenuID: 14, TagID: 7},
		{MenuID: 15, TagID: 2},
		{MenuID: 15, TagID: 11},
		{MenuID: 16, TagID: 2},
		{MenuID: 16, TagID: 12},
		{MenuID: 17, TagID: 2},
		{MenuID: 17, TagID: 6},
		{MenuID: 18, TagID: 2},
		{MenuID: 18, TagID: 5},
		{MenuID: 19, TagID: 2},
		{MenuID: 19, TagID: 11},
		{MenuID: 20, TagID: 2},
		{MenuID: 20, TagID: 11},

		{MenuID: 21, TagID: 1},
		{MenuID: 21, TagID: 10},
		{MenuID: 22, TagID: 1},
		{MenuID: 22, TagID: 7},
		{MenuID: 23, TagID: 1},
		{MenuID: 23, TagID: 11},
		{MenuID: 24, TagID: 1},
		{MenuID: 24, TagID: 5},
		{MenuID: 25, TagID: 1},
		{MenuID: 25, TagID: 11},
		{MenuID: 26, TagID: 1},
		{MenuID: 26, TagID: 8},
		{MenuID: 27, TagID: 1},
		{MenuID: 27, TagID: 7},
		{MenuID: 28, TagID: 1},
		{MenuID: 28, TagID: 7},
		{MenuID: 29, TagID: 1},
		{MenuID: 29, TagID: 8},
		{MenuID: 30, TagID: 1},
		{MenuID: 30, TagID: 10},
		{MenuID: 30, TagID: 11},
		{MenuID: 31, TagID: 1},
		{MenuID: 31, TagID: 6},

		{MenuID: 32, TagID: 3},
		{MenuID: 32, TagID: 8},
		{MenuID: 33, TagID: 3},
		{MenuID: 33, TagID: 10},
		{MenuID: 34, TagID: 3},
		{MenuID: 34, TagID: 8},
		{MenuID: 35, TagID: 3},
		{MenuID: 35, TagID: 13},
		{MenuID: 36, TagID: 3},
		{MenuID: 36, TagID: 14},
		{MenuID: 37, TagID: 3},
		{MenuID: 37, TagID: 8},
		{MenuID: 38, TagID: 3},
		{MenuID: 38, TagID: 7},
		{MenuID: 39, TagID: 3},
		{MenuID: 39, TagID: 9},
		{MenuID: 40, TagID: 3},
		{MenuID: 40, TagID: 11},
		{MenuID: 41, TagID: 3},
		{MenuID: 41, TagID: 7},
	}
	db.Create(&MenuTag)

	FoodFlag := []entity.FoodFlag{
		{
			Flag:        "ควรรับประทาน",
			FoodGroupID: 1,
		},
		{
			Flag:        "ควรรับประทาน",
			FoodGroupID: 3,
		},
		{
			Flag:        "ควรรับประทาน", //ผลไม้
			FoodGroupID: 4,
		},
		{
			Flag:        "ควรรับประทาน",
			FoodGroupID: 6,
		},
		{
			Flag:        "ควรหลีกเลี่ยง",
			FoodGroupID: 1,
		},
		{
			Flag:        "ควรหลีกเลี่ยง",
			FoodGroupID: 3,
		},
		{
			Flag:        "ควรหลีกเลี่ยง",
			FoodGroupID: 4,
		},
		{
			Flag:        "ควรหลีกเลี่ยง",
			FoodGroupID: 5,
		},
		{
			Flag:        "ควรหลีกเลี่ยง",
			FoodGroupID: 6,
		},
	}

	for _, flag := range FoodFlag {
		db.FirstOrCreate(&flag, entity.FoodFlag{
			Flag:        flag.Flag,
			FoodGroupID: flag.FoodGroupID})
	}

	FoodItem := []entity.FoodItem{
		{
			Name:        "ข้าวสวย",
			Image:       "https://fit-d.com/image_webp/f?src=./uploads/food/a860b2d3f85d9ed0fb25289795345ecf.jpg",
			Credit:      "https://fit-d.com/food/view/NDI2/%E0%B8%82%E0%B9%89%E0%B8%AD%E0%B8%A1%E0%B8%B9%E0%B8%A5%E0%B9%82%E0%B8%A0%E0%B8%8A%E0%B8%99%E0%B8%B2%E0%B8%81%E0%B8%B2%E0%B8%A3%20%E0%B9%81%E0%B8%84%E0%B8%A5%E0%B8%AD%E0%B8%A3%E0%B8%B5%E0%B9%88%20%E0%B8%82%E0%B9%89%E0%B8%B2%E0%B8%A7%E0%B8%AA%E0%B8%A7%E0%B8%A2--%E0%B8%82%E0%B9%89%E0%B8%B2%E0%B8%A7%E0%B9%80%E0%B8%9B%E0%B8%A5%E0%B9%88%E0%B8%B2-steamed-rice#nutrition_fact_part",
			Description: "ฟอสฟอรัสต่ำ,โพแทสเซียมต่ำ",
			FoodFlagID:  1,
		},
		{
			Name:        "ข้าวเหนียว",
			Image:       "https://1376delivery.com/productimages/7036_-.jpg",
			Credit:      "https://1376delivery.com/7/lao-yuan/product/2586/sticky-rice",
			Description: "ฟอสฟอรัสต่ำ,โพแทสเซียมต่ำ",
			FoodFlagID:  1,
		},
		{
			Name:        "ข้าวต้ม",
			Image:       "https://i.pinimg.com/originals/53/1d/c4/531dc48a9a143c97162f27b73b1b9c56.jpg",
			Credit:      "https://jp.pinterest.com/pin/746119863235427592/",
			Description: "ฟอสฟอรัสต่ำ,โพแทสเซียมต่ำ",
			FoodFlagID:  1,
		},
		{
			Name:        "วุ้นเส้น",
			Image:       "https://www.cpbrandsite.com/contents/tips_tricks/fbpi6pbgedvmu1lafhx3ruilk8n7se5d6ngop6y0.png",
			Credit:      "https://www.cpbrandsite.com/tips-tricks/%E0%B8%9C%E0%B8%B1%E0%B8%94%E0%B8%A7%E0%B8%B8%E0%B9%89%E0%B8%99%E0%B9%80%E0%B8%AA%E0%B9%89%E0%B8%99%E0%B8%AD%E0%B8%A2%E0%B9%88%E0%B8%B2%E0%B8%87%E0%B9%84%E0%B8%A3%E0%B9%83%E0%B8%AB%E0%B9%89%E0%B8%99%E0%B8%B8%E0%B9%88%E0%B8%A1%E0%B9%81%E0%B8%A5%E0%B8%B0%E0%B9%84%E0%B8%A1%E0%B9%88%E0%B9%83%E0%B8%AB%E0%B9%89%E0%B9%80%E0%B8%AA%E0%B9%89%E0%B8%99%E0%B8%81%E0%B8%AD%E0%B8%94%E0%B8%81%E0%B8%B1%E0%B8%99",
			Description: "ฟอสฟอรัสต่ำ,โพแทสเซียมต่ำ",
			FoodFlagID:  1,
		},
		{
			Name:        "เส้นเซี่ยงไฮ้",
			Image:       "https://www.bloggang.com/data/m/mai-mee/picture/1244199848.jpg",
			Credit:      "https://www.bloggang.com/viewdiary.php?id=mai-mee&month=06-2009&date=05&group=1&gblog=238",
			Description: "ฟอสฟอรัสต่ำ,โพแทสเซียมต่ำ",
			FoodFlagID:  1,
		},
		{
			Name:        "ถั่วแดงสุก",
			Image:       "https://thethaiger.com/th/wp-content/uploads/2024/09/%E0%B8%A0%E0%B8%B2%E0%B8%9E%E0%B8%96%E0%B9%88%E0%B8%B2%E0%B8%A2%E0%B8%AB%E0%B8%99%E0%B9%89%E0%B8%B2%E0%B8%88%E0%B8%AD-2567-09-10-%E0%B9%80%E0%B8%A7%E0%B8%A5%E0%B8%B2-11.22.46-AM-1480x768.png",
			Credit:      "https://thethaiger.com/th/news/1233146/",
			Description: "ฟอสฟอรัสสูง,โพแทสเซียมสูง",
			FoodFlagID:  5,
		},
		{
			Name:        "ขนมปัง",
			Image:       "https://janthai.com/wp-content/uploads/2012/07/%E0%B8%A7%E0%B8%B4%E0%B8%98%E0%B8%B5%E0%B9%80%E0%B8%A5%E0%B8%B7%E0%B8%AD%E0%B8%81%E0%B8%8B%E0%B8%B7%E0%B9%89%E0%B8%AD%E0%B8%82%E0%B8%99%E0%B8%A1%E0%B8%9B%E0%B8%B1%E0%B8%87.jpg",
			Credit:      "https://janthai.com/blog/%E0%B9%80%E0%B8%A3%E0%B8%B7%E0%B9%88%E0%B8%AD%E0%B8%87%E0%B8%99%E0%B9%88%E0%B8%B2%E0%B8%A3%E0%B8%B9%E0%B9%89%E0%B9%80%E0%B8%81%E0%B8%B5%E0%B9%88%E0%B8%A2%E0%B8%A7%E0%B8%81%E0%B8%B1%E0%B8%9A%E0%B8%82-2381.html",
			Description: "ฟอสฟอรัสสูง,โพแทสเซียมสูง",
			FoodFlagID:  5,
		},
		{
			Name:        "แครกเกอร์",
			Image:       "https://t3.ftcdn.net/jpg/02/93/06/52/360_F_293065233_CQ3WBmQafv2T91cvOXp0RkNUSjInYNXa.jpg",
			Credit:      "https://stock.adobe.com/jp/search/images?k=%E3%82%AF%E3%83%A9%E3%83%83%E3%82%AB%E3%83%BC",
			Description: "ฟอสฟอรัสสูง,โพแทสเซียมสูง",
			FoodFlagID:  5,
		},
		{
			Name:        "ลูกเดือยสุก",
			Image:       "https://tbcc-community.com/wp-content/uploads/2022/10/S__25124875.jpg",
			Credit:      "https://tbcc-community.com/articles/meabanchemo2022-10/",
			Description: "ฟอสฟอรัสสูง,โพแทสเซียมสูง",
			FoodFlagID:  5,
		},
		{
			Name:        "มันเทศต้มสุก",
			Image:       "https://res.cloudinary.com/dk0z4ums3/image/upload/v1510041070/attached_image_th/%E0%B8%A1%E0%B8%B1%E0%B8%99%E0%B9%80%E0%B8%97%E0%B8%A8-%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B9%82%E0%B8%A2%E0%B8%8A%E0%B8%99%E0%B9%8C%E0%B8%95%E0%B9%88%E0%B8%AD%E0%B8%AA%E0%B8%B8%E0%B8%82%E0%B8%A0%E0%B8%B2-pobpad.jpg",
			Credit:      "https://www.pobpad.com/%E0%B8%A1%E0%B8%B1%E0%B8%99%E0%B9%80%E0%B8%97%E0%B8%A8-%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B9%82%E0%B8%A2%E0%B8%8A%E0%B8%99%E0%B9%8C%E0%B8%95%E0%B9%88%E0%B8%AD%E0%B8%AA%E0%B8%B8%E0%B8%82%E0%B8%A0%E0%B8%B2",
			Description: "ฟอสฟอรัสสูง,โพแทสเซียมสูง",
			FoodFlagID:  5,
		},
		{
			Name:        "ฟักทองสุก",
			Image:       "https://img.thaicdn.net/u/2015/surauch/cook1/pumpklin-1.jpg",
			Credit:      "https://cooking.kapook.com/view130533.html",
			Description: "ฟอสฟอรัสสูง,โพแทสเซียมสูง",
			FoodFlagID:  5,
		},
		{
			Name:        "ขนมจีน",
			Image:       "https://d3h1lg3ksw6i6b.cloudfront.net/media/image/2022/06/14/103df643b8e84d6a87e38289c33b8a26_Get_To_Know_How_Khanom_Chin_Conquered_Thailand_%2810%29.jpg",
			Credit:      "https://guide.michelin.com/th/th/article/features/get-to-know-how-khanom-chin-conquered-thailand",
			Description: "ฟอสฟอรัสสูง,โพแทสเซียมสูง",
			FoodFlagID:  5,
		},
		{
			Name:        "แอปเปิล",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Apple-1.jpg",
			Credit:      "https://medthai.com/%E0%B9%81%E0%B8%AD%E0%B8%9B%E0%B9%80%E0%B8%9B%E0%B8%B4%E0%B9%89%E0%B8%A5/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  3,
		},
		{
			Name:        "พุทรา",
			Image:       "https://medthai.com/wp-content/uploads/2013/10/%E0%B8%9E%E0%B8%B8%E0%B8%97%E0%B8%A3%E0%B8%B2%E0%B8%88%E0%B8%B5%E0%B8%99.jpg",
			Credit:      "https://medthai.com/%E0%B8%9E%E0%B8%B8%E0%B8%97%E0%B8%A3%E0%B8%B2%E0%B8%88%E0%B8%B5%E0%B8%99/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  3,
		},
		{
			Name:        "ส้มโอ",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Pomelo-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%AA%E0%B9%89%E0%B8%A1%E0%B9%82%E0%B8%AD/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  3,
		},
		{
			Name:        "มังคุด",
			Image:       "https://www.healthtodaythailand.in.th/wp-content/uploads/2017/12/Mangosteen001-e1518415885868.jpg",
			Credit:      "https://www.healthtodaythailand.in.th/%E0%B8%A1%E0%B8%B1%E0%B8%87%E0%B8%84%E0%B8%B8%E0%B8%94-%E0%B8%9C%E0%B8%A5%E0%B9%84%E0%B8%A1%E0%B9%89%E0%B8%A3%E0%B8%B1%E0%B8%81%E0%B8%A9%E0%B8%B2%E0%B9%82%E0%B8%A3%E0%B8%84-2/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  3,
		},
		{
			Name:        "เงาะ",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Rambutan-1.jpg",
			Credit:      "https://medthai.com/%E0%B9%80%E0%B8%87%E0%B8%B2%E0%B8%B0/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  3,
		},
		{
			Name:        "ชมพู่",
			Image:       "https://spfresh.co.th/wp-content/uploads/2022/12/%E0%B8%8A%E0%B8%A1%E0%B8%9E%E0%B8%B9%E0%B9%88-2-1.jpg",
			Credit:      "https://spfresh.co.th/product/roseapple/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  3,
		},
		{
			Name:        "แตงโม",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/%E0%B8%A3%E0%B8%B9%E0%B8%9B%E0%B9%81%E0%B8%95%E0%B8%87%E0%B9%82%E0%B8%A1.jpg",
			Credit:      "https://medthai.com/%E0%B9%81%E0%B8%95%E0%B8%87%E0%B9%82%E0%B8%A1/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  3,
		},
		{
			Name:        "สัปปะรด",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Pineapple-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%AA%E0%B8%B1%E0%B8%9A%E0%B8%9B%E0%B8%B0%E0%B8%A3%E0%B8%94/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  3,
		},
		{
			Name:        "สาลี่",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Chinese-pear-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%AA%E0%B8%B2%E0%B8%A5%E0%B8%B5%E0%B9%88/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  3,
		},
		{
			Name:        "กล้วยหอม",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Banana-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%81%E0%B8%A5%E0%B9%89%E0%B8%A7%E0%B8%A2/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  7,
		},
		{
			Name:        "ฝรั่ง",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Guava-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%9D%E0%B8%A3%E0%B8%B1%E0%B9%88%E0%B8%87/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  7,
		},
		{
			Name:        "แก้วมังกร",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Dragon-fruit-1.jpg",
			Credit:      "https://medthai.com/%E0%B9%81%E0%B8%81%E0%B9%89%E0%B8%A7%E0%B8%A1%E0%B8%B1%E0%B8%87%E0%B8%81%E0%B8%A3/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  7,
		},
		{
			Name:        "มะม่วงสุก/ดิบ",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Mango-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%A1%E0%B8%B0%E0%B8%A1%E0%B9%88%E0%B8%A7%E0%B8%87/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  7,
		},
		{
			Name:        "ขนุน",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Jackfruit-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%82%E0%B8%99%E0%B8%B8%E0%B8%99/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  7,
		},
		{
			Name:        "มะขามหวาน",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Tamarind-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%A1%E0%B8%B0%E0%B8%82%E0%B8%B2%E0%B8%A1/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  7,
		},
		{
			Name:        "ลองกอง",
			Image:       "https://medthai.com/wp-content/uploads/2013/11/%E0%B8%A5%E0%B8%AD%E0%B8%87%E0%B8%81%E0%B8%AD%E0%B8%87.jpg",
			Credit:      "https://medthai.com/%E0%B8%A5%E0%B8%AD%E0%B8%87%E0%B8%81%E0%B8%AD%E0%B8%87/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  7,
		},
		{
			Name:        "ลำไย",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Longan-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%A5%E0%B8%B3%E0%B9%84%E0%B8%A2/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  7,
		},
		{
			Name:        "ส้ม",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Orange-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%AA%E0%B9%89%E0%B8%A1/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  7,
		},
		{
			Name:        "ทุเรียน",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Durian-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%97%E0%B8%B8%E0%B9%80%E0%B8%A3%E0%B8%B5%E0%B8%A2%E0%B8%99/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  7,
		},
		{
			Name:        "ลูกยอ",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Noni-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%A5%E0%B8%B9%E0%B8%81%E0%B8%A2%E0%B8%AD/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  7,
		},
		{
			Name:        "ผักกาดขาว",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Chinese-Cabbage-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%9C%E0%B8%B1%E0%B8%81%E0%B8%81%E0%B8%B2%E0%B8%94%E0%B8%82%E0%B8%B2%E0%B8%A7/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  2,
		},
		{
			Name:        "บวบ",
			Image:       "https://sudyod.co.th/wp-content/uploads/2021/10/%E0%B8%9A%E0%B8%A7%E0%B8%9A%E0%B9%80%E0%B8%AB%E0%B8%A5%E0%B8%B5%E0%B9%88%E0%B8%A2%E0%B8%A1-1.png",
			Credit:      "https://sudyod.co.th/product/%E0%B8%9A%E0%B8%A7%E0%B8%9A%E0%B9%80%E0%B8%AB%E0%B8%A5%E0%B8%B5%E0%B9%88%E0%B8%A2%E0%B8%A1-500-700-%E0%B8%81%E0%B8%A3%E0%B8%B1%E0%B8%A1/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  2,
		},
		{
			Name:        "ผักบุ้ง",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Swamp-cabbage-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%9C%E0%B8%B1%E0%B8%81%E0%B8%9A%E0%B8%B8%E0%B9%89%E0%B8%87/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  2,
		},
		{
			Name:        "หอมใหญ่",
			Image:       "https://medthai.com/wp-content/uploads/2013/10/%E0%B8%AB%E0%B8%AD%E0%B8%A1%E0%B8%AB%E0%B8%B1%E0%B8%A7%E0%B9%83%E0%B8%AB%E0%B8%8D%E0%B9%881.jpg",
			Credit:      "https://medthai.com/%E0%B8%AB%E0%B8%AD%E0%B8%A1%E0%B8%AB%E0%B8%B1%E0%B8%A7%E0%B9%83%E0%B8%AB%E0%B8%8D%E0%B9%88/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  2,
		},
		{
			Name:        "ฟักเขียว",
			Image:       "https://medthai.com/wp-content/uploads/2013/09/%E0%B8%9C%E0%B8%A5%E0%B8%9F%E0%B8%B1%E0%B8%81%E0%B9%80%E0%B8%82%E0%B8%B5%E0%B8%A2%E0%B8%A7.jpg",
			Credit:      "https://medthai.com/%E0%B8%9F%E0%B8%B1%E0%B8%81%E0%B9%80%E0%B8%82%E0%B8%B5%E0%B8%A2%E0%B8%A7/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  2,
		},
		{
			Name:        "ผักกาดหอม",
			Image:       "https://medthai.com/wp-content/uploads/2013/10/%E0%B8%9C%E0%B8%B1%E0%B8%81%E0%B8%81%E0%B8%B2%E0%B8%94%E0%B8%AB%E0%B8%AD%E0%B8%A1.jpg",
			Credit:      "https://medthai.com/%E0%B8%9C%E0%B8%B1%E0%B8%81%E0%B8%81%E0%B8%B2%E0%B8%94%E0%B8%AB%E0%B8%AD%E0%B8%A1/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  2,
		},
		{
			Name:        "น้ำเต้า",
			Image:       "https://medthai.com/wp-content/uploads/2014/03/%E0%B8%99%E0%B9%89%E0%B8%B3%E0%B9%80%E0%B8%95%E0%B9%89%E0%B8%B2.jpg",
			Credit:      "https://medthai.com/%E0%B8%99%E0%B9%89%E0%B8%B3%E0%B9%80%E0%B8%95%E0%B9%89%E0%B8%B2/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  2,
		},
		{
			Name:        "ถั่วงอก",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Bean-Sprouts-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%96%E0%B8%B1%E0%B9%88%E0%B8%A7%E0%B8%87%E0%B8%AD%E0%B8%81/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  2,
		},
		{
			Name:        "แตงกวา",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Cucumber-1.jpg",
			Credit:      "https://medthai.com/%E0%B9%81%E0%B8%95%E0%B8%87%E0%B8%81%E0%B8%A7%E0%B8%B2/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  2,
		},
		{
			Name:        "มะเขือยาว",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Eggplant-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%A1%E0%B8%B0%E0%B9%80%E0%B8%82%E0%B8%B7%E0%B8%AD%E0%B8%A2%E0%B8%B2%E0%B8%A7/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  2,
		},
		{
			Name:        "มะเขือเปราะ",
			Image:       "https://medthai.com/wp-content/uploads/2014/09/%E0%B8%A3%E0%B8%B9%E0%B8%9B%E0%B8%A1%E0%B8%B0%E0%B9%80%E0%B8%82%E0%B8%B7%E0%B8%AD%E0%B9%80%E0%B8%9B%E0%B8%A3%E0%B8%B2%E0%B8%B0.jpg",
			Credit:      "https://medthai.com/%E0%B8%A1%E0%B8%B0%E0%B9%80%E0%B8%82%E0%B8%B7%E0%B8%AD%E0%B9%80%E0%B8%9B%E0%B8%A3%E0%B8%B2%E0%B8%B0/",
			Description: "โพแทสเซียมต่ำ-ปานกลาง",
			FoodFlagID:  2,
		},
		{
			Name:        "มะเขือเทศ",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Tomato-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%A1%E0%B8%B0%E0%B9%80%E0%B8%82%E0%B8%B7%E0%B8%AD%E0%B9%80%E0%B8%97%E0%B8%A8/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  6,
		},
		{
			Name:        "แคร์รอต",
			Image:       "https://www.gourmetandcuisine.com/Images/editor_upload/_editor20210909021323_original.jpg",
			Credit:      "https://www.gourmetandcuisine.com/stories/detail/1353",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  6,
		},
		{
			Name:        "สะเดา",
			Image:       "https://medthai.com/wp-content/uploads/2013/11/%E0%B8%AA%E0%B8%B0%E0%B9%80%E0%B8%94%E0%B8%B2.jpg",
			Credit:      "https://medthai.com/%E0%B8%AA%E0%B8%B0%E0%B9%80%E0%B8%94%E0%B8%B2/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  6,
		},
		{
			Name:        "มะตูมแขก",
			Image:       "https://v3i.rweb-images.com/www.disthai.com/images/editor/%e0%b8%a1%e0%b8%b0%e0%b8%95%e0%b8%b9%e0%b8%a1%e0%b9%81%e0%b8%82%e0%b8%811.jpg",
			Credit:      "https://www.disthai.com/17427463/%E0%B8%A1%E0%B8%B0%E0%B8%95%E0%B8%B9%E0%B8%A1%E0%B9%81%E0%B8%82%E0%B8%81",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  6,
		},
		{
			Name:        "หน่อไม้",
			Image:       "https://image.rakuten.co.jp/f063223-nishikawa/cabinet/fyn9-0200-0399/r_fyn9_365_5.jpg",
			Credit:      "https://item.rakuten.co.jp/f063223-nishikawa/fyn9-365/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  6,
		},
		{
			Name:        "คะน้า",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Kai-Lan-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%9C%E0%B8%B1%E0%B8%81%E0%B8%84%E0%B8%B0%E0%B8%99%E0%B9%89%E0%B8%B2/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  6,
		},
		{
			Name:        "ฟักทอง",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Pumpkin-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%9F%E0%B8%B1%E0%B8%81%E0%B8%97%E0%B8%AD%E0%B8%87/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  6,
		},
		{
			Name:        "ใบยอ",
			Image:       "https://1.bp.blogspot.com/-jph32-wPWwQ/UmCxRbhXzJI/AAAAAAAAAfk/hQdWiop13U8/s1600/recingradient207_0_normal.jpg",
			Credit:      "https://numonkato.blogspot.com/2013/10/blog-post_17.html",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  6,
		},
		{
			Name:        "ยอด/เม็ดกระถิน",
			Image:       "https://medthai.com/wp-content/uploads/2013/11/%E0%B8%81%E0%B8%A3%E0%B8%B0%E0%B8%96%E0%B8%B4%E0%B8%99.jpg",
			Credit:      "https://medthai.com/%E0%B8%81%E0%B8%A3%E0%B8%B0%E0%B8%96%E0%B8%B4%E0%B8%99%E0%B9%84%E0%B8%97%E0%B8%A2/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  6,
		},
		{
			Name:        "ผักติ้ว",
			Image:       "https://mykitchencook.com/wp-content/uploads/2022/10/%E0%B8%8B%E0%B8%B8%E0%B8%9B%E0%B8%94%E0%B8%AD%E0%B8%81%E0%B8%9C%E0%B8%B1%E0%B8%81%E0%B8%95%E0%B8%B4%E0%B9%89%E0%B8%A72.png",
			Credit:      "https://mykitchencook.com/2022/10/12/%E0%B8%8B%E0%B8%B8%E0%B8%9B%E0%B8%94%E0%B8%AD%E0%B8%81%E0%B8%9C%E0%B8%B1%E0%B8%81%E0%B8%95%E0%B8%B4%E0%B9%89%E0%B8%A7/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  6,
		},
		{
			Name:        "ใบชะพลู",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/Wildbetal-Leafbush-1.jpg",
			Credit:      "https://medthai.com/%E0%B8%8A%E0%B8%B0%E0%B8%9E%E0%B8%A5%E0%B8%B9/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  6,
		},
		{
			Name:        "บรอกโคลี",
			Image:       "https://medthai.com/wp-content/uploads/2013/07/%E0%B8%9A%E0%B8%A3%E0%B9%87%E0%B8%AD%E0%B8%84%E0%B9%82%E0%B8%84%E0%B8%A5%E0%B8%B5%E0%B9%88.jpg",
			Credit:      "https://medthai.com/%E0%B8%9A%E0%B8%A3%E0%B9%87%E0%B8%AD%E0%B8%84%E0%B9%82%E0%B8%84%E0%B8%A5%E0%B8%B5%E0%B9%88/",
			Description: "โพแทสเซียมสูง",
			FoodFlagID:  6,
		},
		{
			Name:        "เนื้อสัตว์แปรรูป",
			Image:       "https://www.cpfworldwide.com/storage/news/thumb72589_1606298080.jpg",
			Credit:      "https://www.cpfworldwide.com/th/media-center/healthyfood-1494",
			Description: "โซเดียมสูง",
			FoodFlagID:  8,
		},
		{
			Name:        "ไข่แดง",
			Image:       "https://www.tcs-mart.com/web/wp-content/uploads/2022/11/yolk1.jpg",
			Credit:      "https://www.tcs-mart.com/product/%E0%B8%AA%E0%B8%B2%E0%B8%A3%E0%B9%81%E0%B8%95%E0%B9%88%E0%B8%87%E0%B8%81%E0%B8%A5%E0%B8%B4%E0%B9%88%E0%B8%99%E0%B9%84%E0%B8%82%E0%B9%88%E0%B9%81%E0%B8%94%E0%B8%87-egg-yolk-flavour-water-flavour/",
			Description: "ฟอสฟอรัสสูง",
			FoodFlagID:  8,
		},
		{
			Name:        "นม",
			Image:       "https://5.imimg.com/data5/HW/IA/MY-41175207/full-cream-pure-goat-milk-500x500.jpg",
			Credit:      "https://www.indiamart.com/proddetail/full-cream-pure-goat-milk-16132391897.html",
			Description: "ฟอสฟอรัสสูง,โพแทสเซียมสูง",
			FoodFlagID:  8,
		},
		{
			Name:        "ถั่วเมล็ดแห้ง",
			Image:       "https://s359.kapook.com/pagebuilder/403cf7d4-0659-4f84-9450-97174e198fbb.jpg",
			Credit:      "https://health.kapook.com/view279785.html",
			Description: "ฟอสฟอรัสสูง,โพแทสเซียมสูง",
			FoodFlagID:  8,
		},
		{
			Name:        "น้ำมันถั่วเหลือง",
			Image:       "https://images.genpi.co/uploads/arsip/normal/2023/03/19/minyak-kedelai-paling-baik-untuk-kesehatan-cegah-fvki.jpg",
			Credit:      "https://www.genpi.co/kesehatan/216595/minyak-kedelai-paling-baik-untuk-kesehatan-cegah-penyakit-kronis-dan-bikin-jantung-sehat",
			Description: "ไขมันไม่อิ่มตัว",
			FoodFlagID:  4,
		},
		{
			Name:        "น้ำมันรำข้าว",
			Image:       "https://www.pvmishra.com/wp-content/uploads/2016/03/Rice-Bran-Oil.jpg",
			Credit:      "https://www.bing.com/images/search?view=detailV2&ccid=Sk%2FqnuZF&id=101AEF9C99280B9DB45513EE6C1D12065A0947B5&thid=OIP.Sk_qnuZFam20T1tc0H1QRQHaEo&mediaurl=https%3A%2F%2Fwww.pvmishra.com%2Fwp-content%2Fuploads%2F2016%2F03%2FRice-Bran-Oil.jpg&cdnurl=https%3A%2F%2Fth.bing.com%2Fth%2Fid%2FR.4a4fea9ee6456a6db44f5b5cd07d5045%3Frik%3DtUcJWgYSHWzuEw%26pid%3DImgRaw%26r%3D0&exph=800&expw=1280&q=%E0%B8%99%E0%B9%89%E0%B8%B3%E0%B8%A1%E0%B8%B1%E0%B8%99%E0%B8%A3%E0%B8%B3%E0%B8%82%E0%B9%89%E0%B8%B2%E0%B8%A7&simid=608027049437592335&form=IRPRST&ck=1756EEB619D6C79779475A06E24A017C&selectedindex=4&itb=0&cw=1382&ch=684&ajaxhist=0&ajaxserp=0&pivotparams=insightsToken%3Dccid_qsD8z%252BU2*cp_BCF64EF7705DD287FDE4FC8329240D00*mid_0D5059C69507C1094DDAEEB78299CE2497A870A7*simid_608038087459547855*thid_OIP.qsD8z-U2kRIHjrlrLINf7AHaEK&vt=0&sim=11&iss=VSI&ajaxhist=0&ajaxserp=0",
			Description: "ไขมันไม่อิ่มตัว",
			FoodFlagID:  4,
		},
		{
			Name:        "น้ำมันคาโนลา",
			Image:       "https://mthai.com/app/uploads/2019/12/Canola-oil.jpg",
			Credit:      "https://mthai.com/lifestyle/health/44054.html",
			Description: "ไขมันไม่อิ่มตัว",
			FoodFlagID:  4,
		},
		{
			Name:        "น้ำมันดอกทานตะวัน",
			Image:       "https://ibio.co.th/products/image/catalog/ice/Sunflower-Oil1.jpg",
			Credit:      "https://www.ibioworld.com/Ingredients0000000375",
			Description: "ไขมันไม่อิ่มตัว",
			FoodFlagID:  4,
		},
		{
			Name:        "น้ำมันงา",
			Image:       "https://miro.medium.com/v2/resize:fit:500/0*R2QGRinPjt7zS26E.jpg",
			Credit:      "https://medium.com/@emilygardenar/is-sesame-oil-good-for-dogs-a-comprehensive-guide-to-canine-health-benefits-f2b88d7b3c9c",
			Description: "ไขมันไม่อิ่มตัว",
			FoodFlagID:  4,
		},
		{
			Name:        "น้ำมันหมู",
			Image:       "https://www.sirinfarm.com/wp-content/uploads/2021/07/o44a3c6ddbc4c9c1cf114aed10a31cebb_67475817_211128_0024.jpg",
			Credit:      "https://www.sirinfarm.com/th/product/pure-lard-250g/",
			Description: "ไขมันอิ่มตัว",
			FoodFlagID:  9,
		},
		{
			Name:        "น้ำมันไก่",
			Image:       "https://lzd-img-global.slatic.net/g/ff/kf/S9208531138184cfd87facb3082722733z.jpg_720x720q80.jpg",
			Credit:      "https://www.lazada.co.th/products/chickenoil600ml-i3700936268.html",
			Description: "ไขมันอิ่มตัว",
			FoodFlagID:  9,
		},
		{
			Name:        "น้ำมันปาล์ม",
			Image:       "https://www.cpi-th.com/public/upload/plamlife/plamlife_19022021-155806.png",
			Credit:      "https://www.cpi-th.com/th/productlistpalm?type=7&case=plam",
			Description: "ไขมันอิ่มตัว",
			FoodFlagID:  9,
		},
		{
			Name:        "น้ำมันมะพร้าว",
			Image:       "https://inwfile.com/s-gf/b27ykm.jpg",
			Credit:      "https://drtim.co/%E0%B8%99%E0%B9%89%E0%B8%B3%E0%B8%A1%E0%B8%B1%E0%B8%99%E0%B8%A1%E0%B8%B0%E0%B8%9E%E0%B8%A3%E0%B9%89%E0%B8%B2%E0%B8%A7/",
			Description: "ไขมันอิ่มตัว",
			FoodFlagID:  9,
		},
		{
			Name:        "กะทิ",
			Image:       "https://sveokosi.com/wp-content/uploads/2022/06/0g.jpg",
			Credit:      "https://sveokosi.com/mleko-za-kosu/",
			Description: "ไขมันอิ่มตัว",
			FoodFlagID:  9,
		},
		{
			Name:        "ครีมเทียม",
			Image:       "https://www.moac.go.th/data/news/l/661200006781.jpg",
			Credit:      "https://www.moac.go.th/news-preview-452991792546",
			Description: "ไขมันอิ่มตัว",
			FoodFlagID:  9,
		},
	}

	for _, item := range FoodItem {
		db.FirstOrCreate(&item, entity.FoodItem{
			Name:        item.Name,
			Image:       item.Image,
			Credit:      item.Credit,
			Description: item.Description,
			FoodFlagID:  item.FoodFlagID})
	}

	EducationalGroup := []entity.EducationalGroup{
		{
			Name: "โรคไต",
		},
		{
			Name: "โรคเบาหวาน",
		},
		{
			Name: "ออกกำลังกาย",
		},
		{
			Name: "โภชนาการ",
		},
	}

	for _, group := range EducationalGroup {
		db.FirstOrCreate(&group, entity.EducationalGroup{
			Name: group.Name,
		})
	}

	ContentCategory := []entity.ContentCategory{
		{
			Category: "บทความ",
		},
		{
			Category: "คลิปวิดิโอ",
		},
		{
			Category: "อินโฟกราฟฟิก",
		},
	}

	for _, category := range ContentCategory {
		db.FirstOrCreate(&category, entity.ContentCategory{
			Category: category.Category,
		})
	}

	EducationalContent := []entity.EducationalContent{

		{
			Title:              "ผักผลไม้ที่ช่วยทดแทนน้ำในร่างกาย และทำให้ร่างกายสดชื่น",
			PictureIn:          "https://multimedia.anamai.moph.go.th/oawoocha/2024/05/heath_me_43_fruit_1_0-768x768.jpg",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2024/05/heath_me_43_fruit_1_0-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "ช่วงฤดูร้อน ที่อุณภูมิเพิ่มสูงขึ้น อาจทำให้ร่างกายรู้สึกอ่อนเพลีย และเกิดภาวะขาดน้ำได้\n🔶 นอกจากเช็คการดื่มน้ำที่เพียงพอต่อวันแล้ว (8-10 แก้วต่อวัน) ยังมีตัวเสริมตัวช่วยอย่าง ผัก ผลไม้บางชนิดที่รู้จักและกินเป็นประจำได้อีกทางหนึ่งช่วยทดแทนน้ำในร่างกายที่สูญเสียไปเรื่องจากอากาศร้อนได้ แถมยังมีสารต้านอนุมูลอิสระที่เกิดขึ้นตามธรรมชาติ ช่วยลดการอักเสบจากการเผาไหม้ของแสงแดดในหน้าร้อน ได้แก่ แตงกวา🥒 คะน้า มะเขือเทศ🍅 แตงโม🍉 มะละกอ และฝรั่ง\n🔸และยังมีสาระแหน่ ซึ่งเป็นสมุนไพรเย็นช่วยบรรเทาอาการหวัด ขับเหงื่อ ระบายความร้อน💦 มีสารเมนทอลที่มีคุณสมบัติเย็นใช้ในการรักษาอาการอ่อนเพลียและบรรเทาอาการปวดหัวไมเกรนได้อีกด้วย",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  1,
		},
		{
			Title:              "ดับร้อน ด้วย ไอศกรีม รู้ก่อนเลือกกิน",
			PictureIn:          "https://multimedia.anamai.moph.go.th/oawoocha/2024/04/heath_me_32_sweet_1-768x767.jpg",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2024/04/heath_me_32_sweet_1-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "ไอศกรีม” เป็นของหวานที่ช่วยสร้างความสดชื่นในช่วงหน้าร้อนได้เป็นอย่างดี มีส่วนประกอบหลักคือ ครีม นมผง หางนม โยเกิร์ต นมเปรี้ยว และส่วนผสมของสารให้รสหวาน ซึ่งนอกจากน้ำตาลแล้วยังมีกลูโคสไซรัป ฟรุกโตส น้ำผึ้ง หรืออาจมีไขมันพืช ไข่ กะทิ เพิ่มด้วย ส่วนประกอบเหล่านี้ล้วนแต่เพิ่มน้ำหนักให้ผู้บริโภคทั้งสิ้น จึงควรเลือกชนิดของไอศกรีมที่เหมาะสมหรือหลีกเลี่ยงไอศกรีมชนิดไขมันสูง เพราะไอศกรีมบางประเภทโฆษณาว่ามีไขมัน 0% แต่กลับมีน้ำตาลสูง ถึง 3.5 – 6.5 ช้อนชา จึงควรกินในปริมาณที่พอเหมาะ โดยเฉพาะผู้ที่มีระดับคอเลสเตอรอลสูง ควรเลือกไอศกรีมที่มีส่วนผสมของไขมันน้อย หรือไอศกรีมที่ไม่มีไขมันเลย เช่น ไอศกรีมเชอร์เบท หรือไอศกรีมหวานเย็น สำหรับผู้ที่มีไขมันไตรกลีเซอไรด์ ควรกินไอศกรีมเป็นครั้งคราวและจำกัดปริมาณไอศกรีมทุกชนิด เนื่องจากส่วนผสมของไขมันและน้ำตาลที่มีอยู่ในปริมาณมาก มีผลทำให้ระดับไขมันไตรกลีเซอไรด์ในเลือดสูงขึ้นได้ ผู้ที่ต้องการควบคุมน้ำหนัก ควรหลีกเลี่ยงไอศกรีมที่มีไขมันสูง หรือไอศกรีมที่มีน้ำตาลสูง",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  1,
		},
		{
			Title:              "กินอาหารให้ตรงเวลาครบทุกมื้อ โดยเฉพาะมื้อเช้า",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2024/04/heath_me_6_eat_2-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "เลี่ยงการกินจุบจิบระหว่างการทำงานหรือเลือกกินผลไม้หวานน้อย",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  1,
		},
		{
			Title:              "เลี่ยงการกินจุบจิบระหว่างการทำงานหรือเลือกกินผลไม้หวานน้อย",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2024/04/heath_me_5_eat_1-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "เลี่ยงการกินจุบจิบระหว่างการทำงานหรือเลือกกินผลไม้หวานน้อย",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  1,
		},
		{
			Title:              "ระวังภัยมืด ในกระเช้าของขวัญ",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/10/Gift-Baskets-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "การมอบกระเช้าของขวัญถือเป็นการซึ่งกรมอนามัยมีวิธีการสังเกตและเลือกซื้อกระเช้ามอบความสุขให้แก่กันและกันปีใหม่ที่ปลอดภัยมาฝากค่ะ\n\nแต่กระเช้าของขวัญที่จำหน่ายนั้น  (ซึ่งส่วนใหญ่เป็นเครื่องกระป๋อง)หากไม่สังเกตให้ดีอาจจะได้กระเช้าที่ไม่มีคุณภาพ กระป๋องบุบบู้บี้ เมื่อบริโภคเข้าไปจะเป็นอันตรายต่อสุขภาพเพราะเครื่องกระป๋องที่มีการปนเปื้อนเชื้อจุลินทรีย์จะส่งผลให้เกิดการเปลี่ยนแปลงทางด้านสี  กลิ่น  รสและคุณค่าของอาหาร  โดยเฉพาะเชื้อโบทูลินัมซึ่งเป็นพิษต่อระบบประสาทอย่างรุนแรง เมื่อมีการกินเข้าไปพิษจะแสดงอาการให้เห็นภายใน  2-4  ชั่วโมงทำให้มีอาการคลื่นไส้อาเจียน  มีการอัมพาตของกล้ามเนื้อต่างๆสายตาเริ่มพร่ามองเห็นเป็นภาพซ้อน  ซึม  ง่วง  กลืนอาหารไม่สะดวกลิ้นและคอเริ่มอักเสบเพราะไม่สามารถกลืนน้ำลายได้กล้ามเนื้อต้นคออ่อนแรงจนยกหัวไหล่ไม่ขึ้นผู้ที่ได้รับเชื้อจุลินทรีย์ประเภทนี้มักเสียชีวิตด้วยระบบหายใจล้มเหลว  และหัวใจหยุดเต้นฉับพลันภายใน 3-6 วัน หลังจากรับเชื้อเข้าสู่ร่างกาย\n\nการป้องกันจึงควรให้ความใส่ใจสังเกตให้ดีก่อนจะตัดสินใจซื้อกระเช้าประเภทดังกล่าวสิ่งแรกที่ต้องสังเกต  คือ  ต้องดูฉลากเลขทะเบียนตำรับอาหาร  ชื่อ  และที่ตั้งสถานที่ผลิตและหมดอายุแล้ววัน  เดือน  ปี  ที่ผลิต  ชื่อปริมาณวัตถุเจือปนในอาหาร  น้ำหนักสุทธิ  สินค้าที่อยู่ในกระเช้ารวมทั้งลักษณะของเครื่องกระป๋อง  ต้องไม่บวมไม่บุบบู้บี้ไม่เป็นสนิม  รวมถึงตะเข็บกระป๋องต้องไม่มีรอยรั่วเพราะอาจทำให้เกิดเชื้อจุลินทรีย์ขึ้นภายในกระป๋องได้  ที่สำคัญคือ  ฉลากต้องระบุเครื่องหมายอย.  มีเลขสารบบอาหารและที่อยู่ของผู้ผลิตที่ชัดเจน",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  1,
		},
		{
			Title:              "เห็ดป่า…เห็ดพิษคิดก่อนเก็บ",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/09/mushroom-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "“เห็ด” อาหารประเภทผักที่มีโปรตีนให้พลังงานใยอาหารและโพแทสเซียมสามารถนำมาทำอาหารได้หลากหลาย  เช่น ยำเห็ดสามอย่าง  แกงเลียงเห็ด  แกงจืดเห็ดแกงส้มเห็ด แกงลาวเห็ด ต้มยำเห็ด เป็นต้นเห็ดที่ผู้คนนิยมกินนั้นมีทั้งที่เพาะขึ้นมาและเห็ดป่าทีี่เกิดขึ้นเองตามธรรมชาติ  ซึ่งต้องเลือกอย่างดี  เพราะหากเลือกไม่ดีอาจเจอเห็ดพิษ กินเข้าไปอันตรายถึงชีวิตได้\n\nการเก็บเห็ดป่าจะต้องเลือกเห็ดที่มีรูปร่างสมบูรณ์  เก็บให้ครบทุกส่วนโดยขุดให้ลึกเห็ดบางชนิดอาจถูกฝนชะล้างให้จางลงได้  ไม่เก็บเห็ดที่ขึ้นใกล้โรงงานสารเคมี  สนามกอล์ฟหรือข้างถนน เนื่องจากเห็ดสามารถดูดซับสารพิษและโลหะหนักไว้ในตัวได้มาก  เห็ดที่ไม่เคยกินมาก่อนควรกินเพียงเล็กน้อยเพราะอาจมีอาการแพ้ได้ และห้ามกินเห็ดดิบๆ โดยเด็ดขาด\n\nลักษณะเห็ดพิษ ที่ไม่ควรเก็บมากิน  คือ  เห็ดที่มีสีน้ำตาล  เห็ดที่ปลอกหุ้มโคนเห็ดที่มีวงแหวนใต้หมวก  เห็ดที่มีโคนอวบใหญ่ เห็ดที่มีปุ่มปม เห็ดที่มีหมวกสีขาว  เห็ดที่มีหมวกเห็ดที่มีหมวกสีขาว  เห็ดที่มีหมวกเห็ดเป็นรูๆแทนที่จะเป็นช่องๆ คล้ายครีบปลา เห็ดตูมที่มีเนื้อในสีขาวเห็ดที่ขึ้นในมูลสัตว์หรือใกล้มูลสัตว์  ที่สำคัญไม่ควรเก็บเห็ดหรือหาซื้อเห็ดป่าที่ไม่รู้จักมาปรุงอาหาร  และหากไม่มั่นใจก็สามารถทดสอบเห็ดพิษเบื้องต้นได้ ดังนี้\n\nต้มเห็ดกับข้าวสาร ถ้าข้าวสารสุกๆ ดิบๆแสดงว่าเห็ดมีพิษ\nต้มเห็ดร่วมกับช้อนเงินถ้าเห็ดเป็นพิษช้อนเงินจะดำต้มเห็ดร่วมกับหัวหอมถ้าเห็ดเป็นพิษหัวหอมจะดำ\nป้ายด้วยปูนแดง เห็ดพิษจะดำ\nแต่วิธีเหล่านี้ก็ใช้ไม่ได้กับเห็ดระโงกหินซึ่งมีพิษถึงชีวิตเเละหากกินเห็ดพิษเข้าไปเเล้ว สิ่งเเรกที่ต้องรีบปฐมพยาบาลช่วยเหลือก่อนส่งโรงพยาบาลคือ ทำใหเผู้ป่วยอาเจียนเกลือเเกงเเล้วล้วงคอออกหรือใช้ผงถ่านผสม น้ำอุ่นเพื่อดู ลดพิษกาษร ดูดซึมเข้าร่างกายเเ้ลวรีบนำส่งโรงพยาบาลทันทีพร้อนำเห็ดที่กินไปด้วย",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  1,
		},
		{
			Title:              "น้ำมะนาวจี๊ดจ๊าด สูงวัยสุขภาพดี",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/09/lemon-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "“น้ำมะนาว” พืชผักสวนครัวของไทยที่นิยมใช้น้ำเพื่อเพิ่มรสเปรี้ยวให้กับอาหารจนกลายเป็นเอกลักษณ์ของอาหารไทยไปแล้ว ด้านโภชนาการเท่านั้น  แต่ยังมีสรรพคุณเป็นยาช่วยในการรักษาโรคและอาการต่างๆ  เช่น  บรรเทาอาการวิงเวียนศีรษะ  ช่วยแก้อาเจียนอันเนื่องมาจากความผิดปกติของธาตุในร่างกายรักษาอาการลมเงียบรักษาอาการตาแดง ช่วยบรรเทาอาการไข้น้ำมะนาว … ใช่ว่าจะมีประโยชน์เฉพาะ\n\nนอกจากนี้ยังมีวิตามินซีสูง  ช่วยในการรักษาอาการเลือดออกตามไรฟันหรือโรคลักปิดลักเปิดช่วยบรรเทาอาการไอและขับเสมหะ  บรรเทาอาการต่อมทอนซิลอักเสบลดอาการเหงือกบวมช่วยขับพยาธิ รักษาอาการท้องผูก ท้องอืด ปวดท้องท้องแน่น ท้องเฟ้อ รักษาอาการโรคกระเพาะ ท้องร่วงแก้อาการบิด  รักษาอาการปัสสาวะกะปริบกะปรอยหรือขัดเบา   ช่วยฟอกและบำรุงโลหิต รักษาอาการโลหิตจาง  แก้โรคเหน็บชา  และยังช่วยรักษาอาการปวดข้อได้ โดยเฉพาะกลุ่มผู้สูงอายุ ถือเป็นตัวช่วยต่างๆ  ที่ทำให้มีสุขภาพดีขึ้น",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  1,
		},
		{
			Title:              "รัก(ลด) หวาน ไม่มีน้ำตาลและไขมัน",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/09/sugar-1-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "เมื่อถึงช่วงเทศกาลวันแห่งความรักทีไร ขนมแทนใจส่วนใหญ่มักจะหนีไม่พ้นเค้ก หรือช็อกโกแลต ในมุมของความรัก…ถือเป็นเรื่องที่ดีค่ะ แต่ในมุมของสุขภาพ หากเปลี่ยนเป็นการชวนกัน รับประทานอาหารสุขภาพ ก็น่าจะเป็นมื้อพิเศษ ที่ดีสำหรับคู่รัก ซึ่งเป็นวิธีที่ง่ายและไม่ยุ่งยากซับซ้อน เริ่มจากอาหารที่กินนั้นต้องครบ 5 หมู่และ หลากหลาย ปริมาณต้องไม่มากเกินความต้องการ ของร่างกาย ยิ่งถ้าเป็นมื้อเย็นด้วยแล้วควรเลือก เป็นเมนูประเภทสลัดผักแบบน้ำใส เน้นสูตรไขมันต่ำ แต่หากต้องการอาหารประเภทโปรตีน ก็ให้เลือก เนื้อปลา เนื้อไก่ หรือหมูไร้มัน เป็นมื้อหลัก เพราะเนื้อสัตว์เหล่านี้จะมีไขมันต่ำ ทำให้ไม่เสี่ยง เป็นโรคหัวใจและหลอดเลือด และโรคอ้วน แต่อีกหนึ่งสิ่งสำคัญที่อยากให้ทุกคู่รักต้องคำนึง คือ ทุกเมนูที่รับประทานนั้นต้องไม่หวานจัด มันจัด และเค็มจัด และเพิ่มผักและผลไม้รสไม่หวาน ให้มากขึ้นในแต่ละมื้อด้วย ยิ่งรับประทานได้ทุกมื้อ ก็จะยิ่งดีต่อสุขภาพ ส่วนของหวานทุกชนิด หากงด หรือเลี่ยงได้ก็ควรเลี่ยง เพราะขนมหวานคือ ศัตรูร้าย ที่ทำลายหุ่น หากไม่มีการควบคุมปริมาณให้พอเหมาะ",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  1,
		},
		{
			Title:              "รู้ทัน…น้ำส้มสายชู",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/09/lime-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "“น้ำส้มสายชู” ตัวชูรสที่สร้างความเปรี้ยวให้ อาหารหลากหลายชนิด เช่น อาหารประเภท ก๋วยเตี๋ยวและราดหน้า น้ำส้มสายชูที่ขายในตลาดนั้นมีหลาย ประเภท แต่ละประเภทมีคุณสมบัติ และ กระบวนการผลิตแตกต่างกัน โดยทั่วไปจะ แบ่งเป็น 3 ประเภท คือ น้ำส้มสายชูหมัก น้ำส้มสายชูที่ได้จากการหมัก ธัญพืช ผลไม้หรือน้ำตาล น้ำส้ม สายชูชนิดนี้มีรสชาติกลมกล่อม กลิ่นหอม และมีเกลือแร่ที่จำเป็นต่อร่างกายเเต่ราคาค่อนข้างสูง น้ำส้มสายชูกลั่น น้ำส้มสายชูที่ได้จากการ หมักแอลกอฮอล์กลั่นเจือจางกับ เชื้อน้ำส้มสายชู จากนั้นนำไป กลั่นอีกครั้ง หรือนำน้ำส้มสายชู หมักมากลั่นนั่นเอง น้ำส้มสายชูเทียม น้ำส้มสายชูที่นำกรดน้ำส้ม (Acetic Acid) กรดอินทรีย์มี ฤทธิ์กรดอ่อน ความเข้มข้น 95% มาเจือจางจนได้ปริมาณกรด 4-7% ผู้บริโภคควรใส่ใจเลือกซื้อ",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  1,
		},
		{
			Title:              "กินอาหารถุง ต้องอุ่นร้อน",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/09/food-bag-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "อาหารถุง…ความสะดวกของแม่บ้านในยุคนี้ เป็นอาหารที่ปรุงสำเร็จพร้อมนำกลับไปบริโภคได้ ทันที มีให้เลือกหลากหลายทั้งต้ม นึ่ง ผัด ทอด ยำ และหาซื้อได้ง่ายตามตลาดทั่วไป การเลือกซื้อ จึงควรเลือกอาหารปรุงสุกใหม่ๆ บรรจุใส่ถุงไว้ ไม่นาน และยังมีความร้อนอยู่ หรือสังเกตว่า อาหารถุงนั้นไม่มีสีดำคล้ำหรือสีเข้มผิดปกติ ไม่มีฟอง กลิ่นเหม็นเปรี้ยว เน่าเสีย เมื่อซื้อมาแล้ว ควรกินทันที และหากเก็บไว้ในตู้เย็น ก่อนกินควร อุ่นให้ร้อนอีกครั้ง ส่วนร้านที่ซื้อก็สำคัญ ให้เลือกร้านที่ได้ มาตรฐาน เก็บอาหารไว้ในตู้หรือมีภาชนะปิดมิดชิด เพื่อป้องกันแมลงวัน หนู แมลงสาบ ฝุ่นละออง และอาหารที่จำหน่ายควรวางสูงจากพื้น 60 ซม. รวมถึงผู้ขายต้องแต่งกายสะอาด เรียบร้อย สวม ผ้ากันเปื้อน สวมหมวกคลุมผม และใช้ทัพพีหรือ อุปกรณ์หยิบจับอาหาร พร้อมทั้งอุ่นอาหารให้ ร้อนเสมอ",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  1,
		},
		{
			Title:              "ความเชื่อผิดๆ เกี่ยวกับการกินไข่",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2023/10/video_egg_1-400x210.jpg",
			Link:               "https://youtu.be/b6s-jiRlw-s?si=fSOLQusugL4hqhQt",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  2,
		},
		{
			Title:              "รู้จักกับแพลตฟอร์มสุขภาพ “สาสุข อุ่นใจ”",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2023/09/video_appication_2-400x210.jpg",
			Link:               "https://youtu.be/omAY_EPNGIU?si=AIgPWK7miopgKAmn",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  2,
		},
		{
			Title:              "เพราะเราไม่ได้คู่กัน อาหารที่ไม่ควรกินคู่กัน",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2023/09/video_food_1-400x210.jpg",
			Link:               "https://youtu.be/9QmtWk8v4I4?si=Vr9BM2ismT0AHZhN",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  2,
		},
		{
			Title:              "นมจืด (รสธรรมธาติ) แต่ละชนิดคุณค่าทางโภชนาการแตกต่างกันอย่างไร?",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2023/08/%E0%B8%99%E0%B8%A1%E0%B8%88%E0%B8%B7%E0%B8%94-%E0%B8%A3%E0%B8%AA%E0%B8%98%E0%B8%A3%E0%B8%A3%E0%B8%A1%E0%B8%98%E0%B8%B2%E0%B8%95%E0%B8%B4-%E0%B9%81%E0%B8%95%E0%B9%88%E0%B8%A5%E0%B8%B0%E0%B8%8A%E0%B8%99%E0%B8%B4%E0%B8%94%E0%B8%84%E0%B8%B8%E0%B8%93%E0%B8%84%E0%B9%88%E0%B8%B2%E0%B8%97%E0%B8%B2%E0%B8%87%E0%B9%82%E0%B8%A0%E0%B8%8A%E0%B8%99%E0%B8%B2%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B9%81%E0%B8%95%E0%B8%81%E0%B8%95%E0%B9%88%E0%B8%B2%E0%B8%87%E0%B8%81%E0%B8%B1%E0%B8%99%E0%B8%AD%E0%B8%A2%E0%B9%88%E0%B8%B2%E0%B8%87%E0%B9%84%E0%B8%A3-400x210.png",
			Link:               "https://youtube.com/shorts/5FsOcsruVuM?si=eIUIFSO2zU4ZFh8a",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  2,
		},
		{
			Title:              "ไอโอดีน ตอนแม่ขอโทษ",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2023/08/video_Iodine_2-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "การที่ได้รับไอโอดีนไม่เพียงพอต่อวัน ทำให้ง่วงซึม อ่อนเพลีย ศักยภาพในการทำงานต่ำลง ผู้ใหญ่ เด็ก และผู้สูงอายุ ควรได้รับสารไอโอดีนต่อร่างกายในปริมาณที่พอเหมาะ ใช้เกลือไอโอดีนในการปรุงอาหาร รับประทานอาหารให้ครบ 5 หมู่ เน้นผักใบเขียว ปรุงอาหารด้วยเกลือไอโอดีน 1 ช้อนชา / วัน",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  2,
		},
		{
			Title:              "ไอโอดีน ตอนขาดไม่ได้",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2023/08/video_iodine_1-400x210.jpg",
			Link:               "https://youtu.be/7q0She_GekY?si=OvD64QsroICoqSwN",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  2,
		},
		{
			Title:              "ไอโอดีน ตอนสำนึกผิด (หญิงตั้งครรภ์ที่ขาดสารไอโอดีน ส่งผลต่อทารกในครรภ์)",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2023/07/video_iodine_3-400x210.jpg",
			Link:               "https://youtu.be/DUn7EH_Y7E0?si=-blnLw7F01qd-XGq",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  2,
		},
		{
			Title:              "ของขวัญปีใหม่ผู้สูงวัย",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2023/01/Screenshot--400x210.png",
			Link:               "https://youtu.be/LZJvjxEthRI?si=2pFlwWmffv4h8jj1",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  2,
		},
		{
			Title:              "กระเช้าสุขภาพ",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2022/12/gift-basket-400x210.png",
			Link:               "https://youtu.be/1cgfoVWLyxw?si=EHdjFMMi9_KDtFd1",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  2,
		},
		{
			Title:              "กัญชาในอาหาร",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2022/12/marijuana-400x210.png",
			Link:               "https://youtu.be/lONIolv2unE?si=YTKj0RXj0bSxzUT4",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  2,
		},
		{
			Title:              "หวานรักอันตราย",
			PictureIn:          "https://multimedia.anamai.moph.go.th/oawoocha/2025/05/info908_sweet_5.jpg",
			PictureOut:         "",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  3,
		},
		{
			Title:              "กุ๊ก.. กุ๊ก.. กู๋…. มาบอกของดีในฟังทองผักยอดฉิต เทศกาล Halloween",
			PictureIn:          "https://multimedia.anamai.moph.go.th/oawoocha/2025/05/info892_halloween_2.jpg",
			PictureOut:         "",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  3,
		},
		{
			Title:              "เริ่มต้น ลำเลียง และเติบโต (World Food Day67)",
			PictureIn:          "https://multimedia.anamai.moph.go.th/oawoocha/2025/05/info875_food_26.jpg",
			PictureOut:         "",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  3,
		},
		{
			Title:              "ไข่.. คุณประโยชน์ที่หาง่าย กินง่าย ใคร ๆ ก็รัก",
			PictureIn:          "https://multimedia.anamai.moph.go.th/oawoocha/2025/05/info871_food_25.jpg",
			PictureOut:         "",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  3,
		},
		{
			Title:              "ปิดเทอมเล็ก กินเพลินเกินพุง",
			PictureIn:          "https://multimedia.anamai.moph.go.th/oawoocha/2025/05/info867_food_24.jpg",
			PictureOut:         "",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  3,
		},
		{
			Title:              "ปิดเทอมเล็ก กินเพลินเกินพุง",
			PictureIn:          "https://multimedia.anamai.moph.go.th/oawoocha/2025/05/info867_food_24.jpg",
			PictureOut:         "",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  3,
		},
		{
			Title:              "กินเจ ได้สุขภาพ",
			PictureIn:          "https://multimedia.anamai.moph.go.th/oawoocha/2025/05/info863_food_23.jpg",
			PictureOut:         "",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  3,
		},
		{
			Title:              "ไตวาย แล้วเค็มจัด",
			PictureIn:          "https://multimedia.anamai.moph.go.th/oawoocha/2025/04/info851_sodium_3.jpg",
			PictureOut:         "",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  3,
		},
		{
			Title:              "น้อนนน หมูเด้ง ชวนนุด…หม่ำ หม่ำ ผัก อร่อยดี มีประโยชน์",
			PictureIn:          "https://multimedia.anamai.moph.go.th/oawoocha/2025/04/info849_eat_13.jpg",
			PictureOut:         "",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  3,
		},
		{
			Title:              "การจัดการด้านอาหารในภาวะวิกฤติ ด้วย ชุดอาหารอิ่มท้อง",
			PictureIn:          "https://multimedia.anamai.moph.go.th/oawoocha/2025/02/info816_flood_37.jpg",
			PictureOut:         "",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 4,
			ContentCategoryID:  3,
		},
		{
			Title:              "ฟิตเตรียมพร้อม ก่อนก้าวเดิน",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/09/walk-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "หลายๆ คนเข้าใจตรงกันว่า “การเดิน” เป็นการออกกำลังกาย ที่ไม่ต้องลงทุนอะไรมากมาย แถมยังเหมาะสำหรับทุกเพศ ทุกวัย...",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  1,
		},
		{
			Title:              "SAVE YOUR HEALTH",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/09/fitness-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "“Fitness” หรือสถานประกอบกิจการเพื่อสุขภาพ ในปัจจุบันมีผู้ใช้บริการเป็นจำนวนมาก...",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  1,
		},
		{
			Title:              "เตรียมพร้อม… ก่อนออกไป“ปั่น”",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/09/bike5-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "จักรยาน พาหนะที่ผู้คนในปัจจุบันนิยมใช้กันมาก เพราะนอกจากจะช่วยประหยัดค่าใช้จ่าย ลดการใช้พลังงาน และลดมลพิษ...",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  1,
		},
		{
			Title:              "Bike for Health",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/09/bike-1-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "การออกกำลังกายที่กำลังมาแรงแซงทางโค้งขณะนี้คงหนีไม่พ้น “การปั่นจักรยาน”...",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  1,
		},
		{
			Title:              "ป่วยเบาหวาน…ก็ออกกำลังกายได้",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2019/09/1-400x210.jpg",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "การออกกำลังกาย เป็นสิ่งที่มีประโยชน์และทำได้ง่าย แม้ในผู้ป่วยที่เป็นโรคเบาหวาน...",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  1,
		},
		{
			Title:              "นอนน้อยแต่ต้องนอนนะ",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2023/02/sleep-390x210.png",
			Link:               "https://youtu.be/VJ29SDWPHoc?si=ss0EJZgR1mhKJL7F",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  2,
		},
		{
			Title:              "World Cup ดูบอลแล้วดูแลตัวเองด้วยนะ",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2022/12/World-Cup-400x210.png",
			Link:               "https://youtu.be/FIx4TGbkV8A?si=M79tE8U01y2uan_p",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  2,
		},
		{
			Title:              "ออกกำลังกายหน้าร้อน",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2021/10/vdo44-Safety-Exercise-in-Summer-Season-400x210.png",
			Link:               "https://youtu.be/JQDl-tJJjDU?si=pUP4nB9FlHiFlaeM",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  2,
		},
		{
			Title:              "การฝึกปอดเพื่อสร้างความแข็งแรงในช่วงโควิด-19",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2021/07/vdo02-Diaphragmatic-breathing-400x210.png",
			Link:               "https://youtu.be/jeaihYSSynU?si=7cHWHoDvBXTkFcKW",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  2,
		},
		{
			Title:              "7 สัปดาห์รอบรู้สู่สุขภาพดี : 7 Weeks สัปดาห์ที่ 6 ทบทวน มีวินัย สร้างแรงจูงใจ ควบคุม",
			PictureIn:          "",
			PictureOut:         "https://multimedia.anamai.moph.go.th/oawoocha/2020/03/7Weeks-6-400x210.png",
			Link:               "https://youtu.be/ZYx1zF2JZLM?si=Dtq1CgKDRnG3qX7u",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  2,
		},
		{
			Title:              "เดินไปนับไป เสริมสุขภาพด้วย Smartwatch",
			PictureIn:          "https://multimedia.anamai.moph.go.th/oawoocha/2025/05/info916_Health_Literacy_9.jpg",
			PictureOut:         "",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  3,
		},
		{
			Title:              "7 Days สร้างร่าง เตรียมภูมิสู้เบาหวาน",
			PictureIn:          "https://multimedia.anamai.moph.go.th/oawoocha/2025/05/info907_exercise_7.jpg",
			PictureOut:         "",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  3,
		},
		{
			Title:              "ออกกำลังกาย ถูกรุ่น สมวัย โตไป เเข็งเเรง",
			PictureIn:          "https://multimedia.anamai.moph.go.th/oawoocha/2024/01/info628_exercise_6-724x1024.jpg",
			PictureOut:         "",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  3,
		},
		{
			Title:              "พรีลิมร่างกายแข็งแรงไปกับโอลิมปิก",
			PictureIn:          "https://multimedia.anamai.moph.go.th/oawoocha/2024/09/info754_sport_2-640x900.jpg",
			PictureOut:         "",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  3,
		},
		{
			Title:              "ยุ่งมากมีเวลน้อยก็ออกกำลังกายได้นะ",
			PictureIn:          "https://multimedia.anamai.moph.go.th/oawoocha/2023/06/info531_exercise2-725x1024.jpg",
			PictureOut:         "",
			Link:               "",
			Credit:             "https://multimedia.anamai.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 3,
			ContentCategoryID:  3,
		},
		{
			Title:              "ผู้ป่วยเบาหวาน ความดันโลหิตสูง ออกกำลักายอย่างไรให้ปลอดภัย Part 2",
			PictureIn:          "",
			PictureOut:         "https://thaincd.com/images/%E0%B8%9B%E0%B8%81/resize/EP2.2_255_255.png",
			Link:               "https://youtu.be/NPqRoFMBMsQ?si=CPNGLJeWlAD7OXYA",
			Credit:             "https://thaincd.com/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 2,
			ContentCategoryID:  2,
		},
		{
			Title:              "หลักโภชนาการกับโรคเบาหวาน",
			PictureIn:          "",
			PictureOut:         "https://thaincd.com/images/%E0%B8%9B%E0%B8%81/resize/%E0%B8%9B%E0%B8%81%E0%B9%82%E0%B8%A0%E0%B8%8A%E0%B8%99%E0%B8%B2%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B8%81%E0%B8%B1%E0%B8%9A%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B9%80%E0%B8%9A%E0%B8%B2%E0%B8%AB%E0%B8%A7%E0%B8%B2%E0%B8%99_255_255.jpg",
			Link:               "https://youtu.be/ZM7AS5-w_cE?si=bNqlbO9GBTXGQuiv",
			Credit:             "https://thaincd.com/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 2,
			ContentCategoryID:  2,
		},
		{
			Title:              "ระดับน้ำตาลในเลือดคืออะไร",
			PictureIn:          "",
			PictureOut:         "https://thaincd.com/images/%E0%B8%9B%E0%B8%81/resize/%E0%B8%95%E0%B8%A3%E0%B8%A7%E0%B8%88%E0%B8%A3%E0%B8%B0%E0%B8%94%E0%B8%B1%E0%B8%9A%E0%B8%99%E0%B9%89%E0%B8%B3%E0%B8%95%E0%B8%B2%E0%B8%A5_255_255.jpg",
			Link:               "https://youtu.be/qWJW5bNvhYg?si=hMA0rsRJy8D4J72R",
			Credit:             "https://thaincd.com/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 2,
			ContentCategoryID:  2,
		},
		{
			Title:              "วันที่ 14 พฤศจิกายน ของทุกปี เป็นวันเบาหวานโลก “Women and Diabetes: Our Right to a Healthy Future”",
			PictureIn:          "",
			PictureOut:         "https://thaincd.com/images/media/cd-vcd-dvd/resize/1510544679204_255_255.jpg",
			Link:               "https://youtu.be/sf8C8KBeAeY?si=X-19kQpeLATNfxAB",
			Credit:             "https://thaincd.com/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 2,
			ContentCategoryID:  2,
		},
		{
			Title:              "ตอนที่ 1 เลือกทานกันสักนิด พิชิตเบาหวานและความดันโลหิตสูง",
			PictureIn:          "",
			PictureOut:         "https://thaincd.com/images/%E0%B8%9B%E0%B8%81/resize/%E0%B8%95%E0%B8%AD%E0%B8%99%E0%B8%97%E0%B8%B5%E0%B9%881NCD64_255_255.jpg",
			Link:               "https://youtu.be/Fqfzg8G-Ck0?si=W-nJA5HlNQAPKI5-",
			Credit:             "https://thaincd.com/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 2,
			ContentCategoryID:  2,
		},
		{
			Title:              "การดูแลตัวเองของผู้ป่วยโรคเบาหวาน ช่วงถือศีลอดเดือนรอมฏอน",
			PictureIn:          "",
			PictureOut:         "https://thaincd.com/images/media/info/NCD/%E0%B8%A8%E0%B8%B5%E0%B8%A5%E0%B8%AD%E0%B8%94%E0%B9%80%E0%B8%9A%E0%B8%B2%E0%B8%AB%E0%B8%A7%E0%B8%B2%E0%B8%9966.jpg",
			Link:               "",
			Credit:             "https://thaincd.com/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 2,
			ContentCategoryID:  3,
		},
		{
			Title:              "รู้หรือไม่โรคเบาหวานชนิดไหนพบมากที่สุด ?",
			PictureIn:          "",
			PictureOut:         "https://thaincd.com/images/media/info/NCD/QA65.11.jpg",
			Link:               "",
			Credit:             "https://thaincd.com/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 2,
			ContentCategoryID:  3,
		},
		{
			Title:              "ควบคุมน้ำตาลให้อยู่หมัด จำกัดแป้ง",
			PictureIn:          "",
			PictureOut:         "https://thaincd.com/images/media/info/NCD/%E0%B8%84%E0%B8%A7%E0%B8%9A%E0%B8%84%E0%B8%B8%E0%B8%A1%E0%B8%99%E0%B9%89%E0%B8%B3%E0%B8%95%E0%B8%B2%E0%B8%A5.jpg",
			Link:               "",
			Credit:             "https://thaincd.com/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 2,
			ContentCategoryID:  3,
		},
		{
			Title:              "ภาวะก่อนเบาหวาน หรือ Pre-Diabetes",
			PictureIn:          "",
			PictureOut:         "https://thaincd.com/images/media/info/NCD/%E0%B8%A0%E0%B8%B2%E0%B8%A7%E0%B8%B0%E0%B8%81%E0%B9%88%E0%B8%AD%E0%B8%99%E0%B9%80%E0%B8%9A%E0%B8%B2%E0%B8%AB%E0%B8%A7%E0%B8%B2%E0%B8%9965.jpg",
			Link:               "",
			Credit:             "https://thaincd.com/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 2,
			ContentCategoryID:  3,
		},
		{
			Title:              "วันที่ 14 พฤศจิกายนของทุกปี \"วันเบาหวานโลก (World Diabetes Day)\"",
			PictureIn:          "",
			PictureOut:         "https://thaincd.com/images/media/info/NCD/Diabets63.jpg",
			Link:               "",
			Credit:             "https://thaincd.com/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 2,
			ContentCategoryID:  3,
		},
		{
			Title:              "โซเดียมคืออะไร",
			PictureIn:          "",
			PictureOut:         "https://ddc.moph.go.th/uploads/ckeditor2/dncd/images/%E0%B9%82%E0%B8%8B%E0%B9%80%E0%B8%94%E0%B8%B5%E0%B8%A2%E0%B8%A1%E0%B8%84%E0%B8%B7%E0%B8%AD%E0%B8%AD%E0%B8%B0%E0%B9%84%E0%B8%A3.jpg",
			Link:               "",
			Credit:             "https://ddc.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  3,
		},
		{
			Title:              "ลดเกลือ ลดโซเดียม ลดโรคไม่ติดต่อ",
			PictureIn:          "",
			PictureOut:         "https://ddc.moph.go.th/uploads/ckeditor2/dncd/images/7_%E0%B8%A5%E0%B8%94%E0%B9%80%E0%B8%81%E0%B8%A5%E0%B8%B7%E0%B8%AD%20%E0%B8%A5%E0%B8%94%E0%B9%82%E0%B8%8B%E0%B9%80%E0%B8%94%E0%B8%B5%E0%B8%A2%E0%B8%A1%20%E0%B8%A5%E0%B8%94%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B9%84%E0%B8%A1%E0%B9%88%E0%B8%95%E0%B8%B4%E0%B8%94%E0%B8%95%E0%B9%88%E0%B8%AD.jpg",
			Link:               "",
			Credit:             "https://ddc.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  3,
		},
		{
			Title:              "โซเดียมแฝง",
			PictureIn:          "",
			PictureOut:         "https://ddc.moph.go.th/uploads/ckeditor2/dncd/images/574294878830723215.jpg",
			Link:               "",
			Credit:             "https://ddc.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  3,
		},
		{
			Title:              "วิธีการบริโภคโซเดียม เพื่อสุขภาพที่ดี",
			PictureIn:          "",
			PictureOut:         "https://ddc.moph.go.th/uploads/ckeditor2/dncd/images/531895688_1184960120337077_1259775068930075868_n.jpg",
			Link:               "",
			Credit:             "https://ddc.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  3,
		},
		{
			Title:              "แหล่งอาหารที่มีโซเดียม",
			PictureIn:          "",
			PictureOut:         "https://ddc.moph.go.th/uploads/ckeditor2/dncd/images/2_%E0%B9%81%E0%B8%AB%E0%B8%A5%E0%B9%88%E0%B8%87%E0%B8%AD%E0%B8%B2%E0%B8%AB%E0%B8%B2%E0%B8%A3%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%A1%E0%B8%B5%E0%B9%82%E0%B8%8B%E0%B9%80%E0%B8%94%E0%B8%B5%E0%B8%A2%E0%B8%A1.jpg",
			Link:               "",
			Credit:             "https://ddc.moph.go.th/",
			Description:        "",
			AdminID:            1,
			EducationalGroupID: 1,
			ContentCategoryID:  3,
		},
	}

	for _, content := range EducationalContent {
		db.FirstOrCreate(&content, entity.EducationalContent{
			Title:       content.Title,
			PictureIn:   content.PictureIn,
			PictureOut:  content.PictureOut,
			Link:        content.Link,
			Credit:      content.Credit,
			Description: content.Description,
		})
	}

	FoodChoice := []entity.FoodChoice{
		{
			FoodName:        "นม และผลิตภัณฑ์นมไขมันต่ำหรือไร้ไขมัน",
		},
		{
			FoodName:        "เนื้อสัตว์ไม่ติดหนัง ไม่ติดมัน เนื้อหมู เนื้อไก่ เนื้อวัว อาหารทะเล ไข่ ไข่ขาว เต้าหู้ โปรตีนเกษตร",
		},
		{
			FoodName:        "ธัญพืชและผลิตภัณฑ์: ข้าว แป้ง ก๋วยเตี๋ยว ขนมจีน ขนมปัง ข้าวโพด ข้าวฟ่าง ข้าวโอ๊ต ทั้งขัดสี และไม่ขัดสี",
		},
		{
			FoodName:        "ถั่ว: ถั่วเหลือง ถั่วเหลือง ถั่วเขียว ถั่วแดง ถั่วดำ ถั่วลิสง เม็ดมะม่วงหิมพานต์ อัลมอลด์ ",
		},
		{
			FoodName:        "น้ำมันชนิดดี: น้ำมันพืช น้ำมันรำข้าว น้ำมันมะกอก น้ำมันถั่วเหลือง",
		},
		{
			FoodName:        "ไขมันอิ่มตัว ไขมันทรานส์",
		},
		{
			FoodName:        "สมุนไพร และเครื่องเทศ",
		},
		{
			FoodName:        "้เกลือ น้ำปลา ซีอิ้ว เครื่องปรุงรสที่มีโซเดียม",
		},
		{
			FoodName:        "ขนมหวาน น้ำตาล เครื่องดื่มที่ใส่น้ำตาล",
		},
		{
			FoodName:        "อาหารที่มีฟอสฟอรัสแอบซ่อน",
		},
	}

	for _, foodchoice := range FoodChoice {
		db.FirstOrCreate(&foodchoice, entity.FoodChoice{
			FoodName:        foodchoice.FoodName,})
	}

		FoodchoiceDisease := []entity.FoodchoiceDisease{
		{
			DiseaseID:        1, //1-3a
			FoodChoiceID:        1,
			Description:        "รับประทานในปริมาณที่เหมาะสม",
		},
		{
			DiseaseID:        1, //1-3a
			FoodChoiceID:        2,
			Description:        "รับประทานในปริมาณที่เหมาะสม",
		},
		{
			DiseaseID:        1, //1-3a
			FoodChoiceID:        3,
			Description:        "รับประทานให้หลากหลายในปริมาณที่เหมาะสม",
		},
		{
			DiseaseID:        1, //1-3a
			FoodChoiceID:        4,
			Description:        "รับประทานในปริมาณที่เหมาะสม",
		},
		{
			DiseaseID:        1, //1-3a
			FoodChoiceID:        5,
			Description:        "รับประทานในปริมาณที่เหมาะสม",
		},
		{
			DiseaseID:        1, //1-3a
			FoodChoiceID:        6,
			Description:        "หลีกเลี่ยง",
		},
		{
			DiseaseID:        1, //1-3a
			FoodChoiceID:        7,
			Description:        "ใช้ได้",
		},
		{
			DiseaseID:        1, //1-3a
			FoodChoiceID:        8,
			Description:        "จำกัดการรับประทาน",
		},
		{
			DiseaseID:        1, //1-3a
			FoodChoiceID:        9,
			Description:        "จำกัดการรับประทาน",
		},
		{
			DiseaseID:        1, //1-3a
			FoodChoiceID:        10,
			Description:        "หลีกเลี่ยงเด็ดขาด",
		},
		{
			DiseaseID:        2, //3b-5
			FoodChoiceID:        1,
			Description:        "มีโปรตีน มีโพแทสเซียม และฟอสฟอรัสสูง",
		},
		{
			DiseaseID:        2, //3b-5
			FoodChoiceID:        2,
			Description:        "จำกัดปริมาณและ ระวังโพแทสเซียมและฟอสฟอรัสในอาหารบางชนิด",
		},
		{
			DiseaseID:        2, //3b-5
			FoodChoiceID:        3,
			Description:        "ธัญพืชและผลิตภัณฑ์ที่ไม่ขัดสีมีโพแทสเซียมและฟอสฟอรัสสูง",
		},
		{
			DiseaseID:        2, //3b-5
			FoodChoiceID:        4,
			Description:        "มีทั้งโพแทสเซียมและฟอสฟอรัสสูง",
		},
		{
			DiseaseID:        2, //3b-5
			FoodChoiceID:        5,
			Description:        "รับประทานในปริมาณที่เหมาะสม",
		},
		{
			DiseaseID:        2, //3b-5
			FoodChoiceID:        6,
			Description:        "หลีกเลี่ยง",
		},
		{
			DiseaseID:        2, //3b-5
			FoodChoiceID:        7,
			Description:        "ใช้ได้",
		},
		{
			DiseaseID:        2, //3b-5
			FoodChoiceID:        8,
			Description:        "จำกัดการรับประทาน",
		},
		{
			DiseaseID:        2, //3b-5
			FoodChoiceID:        9,
			Description:        "จำกัดการรับประทาน",
		},
		{
			DiseaseID:        2, //3b-5
			FoodChoiceID:        10,
			Description:        "หลีกเลี่ยงเด็ดขาด",
		},
	}

	for _, foodchoicedisease := range FoodchoiceDisease {
		db.FirstOrCreate(&foodchoicedisease, entity.FoodchoiceDisease{
			DiseaseID:       foodchoicedisease.DiseaseID,
			FoodChoiceID:     foodchoicedisease.FoodChoiceID,
			Description:     foodchoicedisease.Description,})
	}
}
