package unit

import (
	"testing"
	"github.com/helloeve02/CPE681012/entity"

	"github.com/asaskevich/govalidator"
	. "github.com/onsi/gomega"
)

func TestMenuAdminID(t *testing.T) {
	g := NewGomegaWithT(t)

	t.Run(`admin_id is required`, func(t *testing.T) {
		menu := entity.Menu{
			AdminID: 0,
			Title:      "ต้มยำไก่บ้านน้ำใส",
			Description: "วัตถุดิบต้มยำไก่บ้านน้ำใส 1.ไก่บ้านติดกระดูกสับเป็นชิ้นพอคำ 320 กรัม 2.หอมแดง 2 หัวเล็ก 3.ตะไคร้ 2 ต้น 4.ต้นหอม 2 ต้น 5.ผักชีใบเลื่อย 1 ต้นใหญ่ 6.ใบมะกรูด 4 ใบเล็ก 7.มะนาว 1 ลูก 8.ข่า 3 แว่น 9.พริกขี้หนู 7 เม็ด 10.เห็ดนางฟ้า 50 กรัม 11.มะเขือเทศลูกเล็ก 3 ลูก 12.น้ำปลา 2-3 ช้อนโต๊ะ วิธีทําต้มยําไก่บ้านน้ำใส Step 1 : เตรียมวัตถุดิบ 1.สับไก่เป็นชิ้น ๆ พักไว้ 2.หั่นตะไคร้เป็นท่อน ๆ หั่นข่าเป็นแว่น และฉีกใบมะกรูดไว้ บุบพริกขี้หนูและหอมแดง ฉีกเห็ดนางฟ้าเป็นเส้น ๆ รวมทั้งหั่นต้นหอมและผักชีใบเลื่อยเป็นท่อน ๆ 3.ตั้งน้ำร้อนให้เดือด ลวกไก่ที่หั่นแล้วพอสุก แล้วพักไว้ก่อน เพื่อให้น้ำไก่ เลือด และสิ่งปนเปื้อนทั้งหลายออกไปก่อน แล้วค่อยนำมาปรุงในต้มยำ 4.สับไก่เป็นชิ้น ๆ พักไว้ 5.นำไก่ที่หั่นแล้วไปลวกพอสุก Step 2 : ทำต้มยำ 1.ตั้งน้ำสะอาดให้เดือด แล้วใส่ข่า ตะไคร้ ใบมะกรูด หอมแดง และมะเขือเทศลงไป ต้มสักครู่จนน้ำเดือดอีกครั้ง แล้วใส่พริกขี้หนูบุบลงไป 2.ใส่ไก่ที่ลวกไว้เมื่อสักครู่ลงไป ต้มต่อจนน้ำเดือด ระหว่างนั้นให้ช้อนฟองออก จะทำให้น้ำใส 3.ใส่เห็ดนางฟ้าลงไฟ คนให้ทั่ว แล้วปรุงรสด้วยน้ำปลา ปิดไฟ ใส่ต้นหอม และผักชีใบเลื่อย 4.ใส่ไก่ลงเคี่ยวกับเครื่องสมุนไพรต่าง ๆ 5.หมั่นช้อนฟองออกให้น้ำใส Step 3 : จัดเสิร์ฟ 1.ตักต้มยำไก่ของเราที่กำลังร้อน ๆ ใส่ถ้วยที่เตรียมไว้ 2.บีบมะนาวลงไป การบีบมะนาวหลังจากปิดไฟแล้วแบบนี้ จะช่วยให้ต้มยำของเราหอมมะนาวยิ่งขึ้น",
			Region:          "ภาคกลาง",
			Image:        "https://img.wongnai.com/p/800x0/2023/03/29/e87ca6e0b3744f23a3b593349e48677b.jpg",
			Sodium: 	0 ,
			Potassium: "",
			Credit: 		"https://www.wongnai.com/recipes/chicken-tom-yum?ref=ct",
		}
		ok, err := govalidator.ValidateStruct(menu)

		g.Expect(ok).NotTo(BeTrue())
		g.Expect(err).NotTo(BeNil())

		g.Expect(err.Error()).To(Equal("AdminID is required"))

	})
}


func TestMenuTitle(t *testing.T) {
	g := NewGomegaWithT(t)

	t.Run(`title is required`, func(t *testing.T) {
		menu := entity.Menu{
			AdminID: 1,
			Title:      "",
			Description: "วัตถุดิบต้มยำไก่บ้านน้ำใส 1.ไก่บ้านติดกระดูกสับเป็นชิ้นพอคำ 320 กรัม 2.หอมแดง 2 หัวเล็ก 3.ตะไคร้ 2 ต้น 4.ต้นหอม 2 ต้น 5.ผักชีใบเลื่อย 1 ต้นใหญ่ 6.ใบมะกรูด 4 ใบเล็ก 7.มะนาว 1 ลูก 8.ข่า 3 แว่น 9.พริกขี้หนู 7 เม็ด 10.เห็ดนางฟ้า 50 กรัม 11.มะเขือเทศลูกเล็ก 3 ลูก 12.น้ำปลา 2-3 ช้อนโต๊ะ วิธีทําต้มยําไก่บ้านน้ำใส Step 1 : เตรียมวัตถุดิบ 1.สับไก่เป็นชิ้น ๆ พักไว้ 2.หั่นตะไคร้เป็นท่อน ๆ หั่นข่าเป็นแว่น และฉีกใบมะกรูดไว้ บุบพริกขี้หนูและหอมแดง ฉีกเห็ดนางฟ้าเป็นเส้น ๆ รวมทั้งหั่นต้นหอมและผักชีใบเลื่อยเป็นท่อน ๆ 3.ตั้งน้ำร้อนให้เดือด ลวกไก่ที่หั่นแล้วพอสุก แล้วพักไว้ก่อน เพื่อให้น้ำไก่ เลือด และสิ่งปนเปื้อนทั้งหลายออกไปก่อน แล้วค่อยนำมาปรุงในต้มยำ 4.สับไก่เป็นชิ้น ๆ พักไว้ 5.นำไก่ที่หั่นแล้วไปลวกพอสุก Step 2 : ทำต้มยำ 1.ตั้งน้ำสะอาดให้เดือด แล้วใส่ข่า ตะไคร้ ใบมะกรูด หอมแดง และมะเขือเทศลงไป ต้มสักครู่จนน้ำเดือดอีกครั้ง แล้วใส่พริกขี้หนูบุบลงไป 2.ใส่ไก่ที่ลวกไว้เมื่อสักครู่ลงไป ต้มต่อจนน้ำเดือด ระหว่างนั้นให้ช้อนฟองออก จะทำให้น้ำใส 3.ใส่เห็ดนางฟ้าลงไฟ คนให้ทั่ว แล้วปรุงรสด้วยน้ำปลา ปิดไฟ ใส่ต้นหอม และผักชีใบเลื่อย 4.ใส่ไก่ลงเคี่ยวกับเครื่องสมุนไพรต่าง ๆ 5.หมั่นช้อนฟองออกให้น้ำใส Step 3 : จัดเสิร์ฟ 1.ตักต้มยำไก่ของเราที่กำลังร้อน ๆ ใส่ถ้วยที่เตรียมไว้ 2.บีบมะนาวลงไป การบีบมะนาวหลังจากปิดไฟแล้วแบบนี้ จะช่วยให้ต้มยำของเราหอมมะนาวยิ่งขึ้น",
			Region:          "ภาคกลาง",
			Image:        "https://img.wongnai.com/p/800x0/2023/03/29/e87ca6e0b3744f23a3b593349e48677b.jpg",
			Sodium: 	0 ,
			Potassium: "",
			Credit: 		"https://www.wongnai.com/recipes/chicken-tom-yum?ref=ct",
		}
		ok, err := govalidator.ValidateStruct(menu)

		g.Expect(ok).NotTo(BeTrue())
		g.Expect(err).NotTo(BeNil())

		g.Expect(err.Error()).To(Equal("Title is required"))

	})
}

func TestMenuDescription(t *testing.T) {
	g := NewGomegaWithT(t)

	t.Run(`description is required`, func(t *testing.T) {
		menu := entity.Menu{
			AdminID: 1,
			Title:      "ต้มยำไก่บ้านน้ำใส",
			Description: "",
			Region:          "ภาคกลาง",
			Image:        "https://img.wongnai.com/p/800x0/2023/03/29/e87ca6e0b3744f23a3b593349e48677b.jpg",
			Sodium: 	0 ,
			Potassium: "",
			Credit: 		"https://www.wongnai.com/recipes/chicken-tom-yum?ref=ct",
		}
		ok, err := govalidator.ValidateStruct(menu)

		g.Expect(ok).NotTo(BeTrue())
		g.Expect(err).NotTo(BeNil())

		g.Expect(err.Error()).To(Equal("Description is required"))

	})
}

func TestMenuRegion(t *testing.T) {
	g := NewGomegaWithT(t)

	t.Run(`region is required`, func(t *testing.T) {
		menu := entity.Menu{
			AdminID: 1,
			Title:      "ต้มยำไก่บ้านน้ำใส",
			Description: "วัตถุดิบต้มยำไก่บ้านน้ำใส 1.ไก่บ้านติดกระดูกสับเป็นชิ้นพอคำ 320 กรัม 2.หอมแดง 2 หัวเล็ก 3.ตะไคร้ 2 ต้น 4.ต้นหอม 2 ต้น 5.ผักชีใบเลื่อย 1 ต้นใหญ่ 6.ใบมะกรูด 4 ใบเล็ก 7.มะนาว 1 ลูก 8.ข่า 3 แว่น 9.พริกขี้หนู 7 เม็ด 10.เห็ดนางฟ้า 50 กรัม 11.มะเขือเทศลูกเล็ก 3 ลูก 12.น้ำปลา 2-3 ช้อนโต๊ะ วิธีทําต้มยําไก่บ้านน้ำใส Step 1 : เตรียมวัตถุดิบ 1.สับไก่เป็นชิ้น ๆ พักไว้ 2.หั่นตะไคร้เป็นท่อน ๆ หั่นข่าเป็นแว่น และฉีกใบมะกรูดไว้ บุบพริกขี้หนูและหอมแดง ฉีกเห็ดนางฟ้าเป็นเส้น ๆ รวมทั้งหั่นต้นหอมและผักชีใบเลื่อยเป็นท่อน ๆ 3.ตั้งน้ำร้อนให้เดือด ลวกไก่ที่หั่นแล้วพอสุก แล้วพักไว้ก่อน เพื่อให้น้ำไก่ เลือด และสิ่งปนเปื้อนทั้งหลายออกไปก่อน แล้วค่อยนำมาปรุงในต้มยำ 4.สับไก่เป็นชิ้น ๆ พักไว้ 5.นำไก่ที่หั่นแล้วไปลวกพอสุก Step 2 : ทำต้มยำ 1.ตั้งน้ำสะอาดให้เดือด แล้วใส่ข่า ตะไคร้ ใบมะกรูด หอมแดง และมะเขือเทศลงไป ต้มสักครู่จนน้ำเดือดอีกครั้ง แล้วใส่พริกขี้หนูบุบลงไป 2.ใส่ไก่ที่ลวกไว้เมื่อสักครู่ลงไป ต้มต่อจนน้ำเดือด ระหว่างนั้นให้ช้อนฟองออก จะทำให้น้ำใส 3.ใส่เห็ดนางฟ้าลงไฟ คนให้ทั่ว แล้วปรุงรสด้วยน้ำปลา ปิดไฟ ใส่ต้นหอม และผักชีใบเลื่อย 4.ใส่ไก่ลงเคี่ยวกับเครื่องสมุนไพรต่าง ๆ 5.หมั่นช้อนฟองออกให้น้ำใส Step 3 : จัดเสิร์ฟ 1.ตักต้มยำไก่ของเราที่กำลังร้อน ๆ ใส่ถ้วยที่เตรียมไว้ 2.บีบมะนาวลงไป การบีบมะนาวหลังจากปิดไฟแล้วแบบนี้ จะช่วยให้ต้มยำของเราหอมมะนาวยิ่งขึ้น",
			Region:          "",
			Image:        "https://img.wongnai.com/p/800x0/2023/03/29/e87ca6e0b3744f23a3b593349e48677b.jpg",
			Sodium: 	0 ,
			Potassium: "",
			Credit: 		"https://www.wongnai.com/recipes/chicken-tom-yum?ref=ct",
		}
		ok, err := govalidator.ValidateStruct(menu)

		g.Expect(ok).NotTo(BeTrue())
		g.Expect(err).NotTo(BeNil())

		g.Expect(err.Error()).To(Equal("Region is required"))

	})
}

func TestMenuImage(t *testing.T) {
	g := NewGomegaWithT(t)

	t.Run(`image is required`, func(t *testing.T) {
		menu := entity.Menu{
			AdminID: 1,
			Title:      "ต้มยำไก่บ้านน้ำใส",
			Description: "วัตถุดิบต้มยำไก่บ้านน้ำใส 1.ไก่บ้านติดกระดูกสับเป็นชิ้นพอคำ 320 กรัม 2.หอมแดง 2 หัวเล็ก 3.ตะไคร้ 2 ต้น 4.ต้นหอม 2 ต้น 5.ผักชีใบเลื่อย 1 ต้นใหญ่ 6.ใบมะกรูด 4 ใบเล็ก 7.มะนาว 1 ลูก 8.ข่า 3 แว่น 9.พริกขี้หนู 7 เม็ด 10.เห็ดนางฟ้า 50 กรัม 11.มะเขือเทศลูกเล็ก 3 ลูก 12.น้ำปลา 2-3 ช้อนโต๊ะ วิธีทําต้มยําไก่บ้านน้ำใส Step 1 : เตรียมวัตถุดิบ 1.สับไก่เป็นชิ้น ๆ พักไว้ 2.หั่นตะไคร้เป็นท่อน ๆ หั่นข่าเป็นแว่น และฉีกใบมะกรูดไว้ บุบพริกขี้หนูและหอมแดง ฉีกเห็ดนางฟ้าเป็นเส้น ๆ รวมทั้งหั่นต้นหอมและผักชีใบเลื่อยเป็นท่อน ๆ 3.ตั้งน้ำร้อนให้เดือด ลวกไก่ที่หั่นแล้วพอสุก แล้วพักไว้ก่อน เพื่อให้น้ำไก่ เลือด และสิ่งปนเปื้อนทั้งหลายออกไปก่อน แล้วค่อยนำมาปรุงในต้มยำ 4.สับไก่เป็นชิ้น ๆ พักไว้ 5.นำไก่ที่หั่นแล้วไปลวกพอสุก Step 2 : ทำต้มยำ 1.ตั้งน้ำสะอาดให้เดือด แล้วใส่ข่า ตะไคร้ ใบมะกรูด หอมแดง และมะเขือเทศลงไป ต้มสักครู่จนน้ำเดือดอีกครั้ง แล้วใส่พริกขี้หนูบุบลงไป 2.ใส่ไก่ที่ลวกไว้เมื่อสักครู่ลงไป ต้มต่อจนน้ำเดือด ระหว่างนั้นให้ช้อนฟองออก จะทำให้น้ำใส 3.ใส่เห็ดนางฟ้าลงไฟ คนให้ทั่ว แล้วปรุงรสด้วยน้ำปลา ปิดไฟ ใส่ต้นหอม และผักชีใบเลื่อย 4.ใส่ไก่ลงเคี่ยวกับเครื่องสมุนไพรต่าง ๆ 5.หมั่นช้อนฟองออกให้น้ำใส Step 3 : จัดเสิร์ฟ 1.ตักต้มยำไก่ของเราที่กำลังร้อน ๆ ใส่ถ้วยที่เตรียมไว้ 2.บีบมะนาวลงไป การบีบมะนาวหลังจากปิดไฟแล้วแบบนี้ จะช่วยให้ต้มยำของเราหอมมะนาวยิ่งขึ้น",
			Region:          "ภาคกลาง",
			Image:        "",
			Sodium: 	0 ,
			Potassium: "",
			Credit: 		"https://www.wongnai.com/recipes/chicken-tom-yum?ref=ct",
		}
		ok, err := govalidator.ValidateStruct(menu)

		g.Expect(ok).NotTo(BeTrue())
		g.Expect(err).NotTo(BeNil())

		g.Expect(err.Error()).To(Equal("Image is required"))

	})

	t.Run(`image must be a valid url`, func(t *testing.T) {
		menu := entity.Menu{
			AdminID: 1,
			Title:      "ต้มยำไก่บ้านน้ำใส",
			Description: "วัตถุดิบต้มยำไก่บ้านน้ำใส 1.ไก่บ้านติดกระดูกสับเป็นชิ้นพอคำ 320 กรัม 2.หอมแดง 2 หัวเล็ก 3.ตะไคร้ 2 ต้น 4.ต้นหอม 2 ต้น 5.ผักชีใบเลื่อย 1 ต้นใหญ่ 6.ใบมะกรูด 4 ใบเล็ก 7.มะนาว 1 ลูก 8.ข่า 3 แว่น 9.พริกขี้หนู 7 เม็ด 10.เห็ดนางฟ้า 50 กรัม 11.มะเขือเทศลูกเล็ก 3 ลูก 12.น้ำปลา 2-3 ช้อนโต๊ะ วิธีทําต้มยําไก่บ้านน้ำใส Step 1 : เตรียมวัตถุดิบ 1.สับไก่เป็นชิ้น ๆ พักไว้ 2.หั่นตะไคร้เป็นท่อน ๆ หั่นข่าเป็นแว่น และฉีกใบมะกรูดไว้ บุบพริกขี้หนูและหอมแดง ฉีกเห็ดนางฟ้าเป็นเส้น ๆ รวมทั้งหั่นต้นหอมและผักชีใบเลื่อยเป็นท่อน ๆ 3.ตั้งน้ำร้อนให้เดือด ลวกไก่ที่หั่นแล้วพอสุก แล้วพักไว้ก่อน เพื่อให้น้ำไก่ เลือด และสิ่งปนเปื้อนทั้งหลายออกไปก่อน แล้วค่อยนำมาปรุงในต้มยำ 4.สับไก่เป็นชิ้น ๆ พักไว้ 5.นำไก่ที่หั่นแล้วไปลวกพอสุก Step 2 : ทำต้มยำ 1.ตั้งน้ำสะอาดให้เดือด แล้วใส่ข่า ตะไคร้ ใบมะกรูด หอมแดง และมะเขือเทศลงไป ต้มสักครู่จนน้ำเดือดอีกครั้ง แล้วใส่พริกขี้หนูบุบลงไป 2.ใส่ไก่ที่ลวกไว้เมื่อสักครู่ลงไป ต้มต่อจนน้ำเดือด ระหว่างนั้นให้ช้อนฟองออก จะทำให้น้ำใส 3.ใส่เห็ดนางฟ้าลงไฟ คนให้ทั่ว แล้วปรุงรสด้วยน้ำปลา ปิดไฟ ใส่ต้นหอม และผักชีใบเลื่อย 4.ใส่ไก่ลงเคี่ยวกับเครื่องสมุนไพรต่าง ๆ 5.หมั่นช้อนฟองออกให้น้ำใส Step 3 : จัดเสิร์ฟ 1.ตักต้มยำไก่ของเราที่กำลังร้อน ๆ ใส่ถ้วยที่เตรียมไว้ 2.บีบมะนาวลงไป การบีบมะนาวหลังจากปิดไฟแล้วแบบนี้ จะช่วยให้ต้มยำของเราหอมมะนาวยิ่งขึ้น",
			Region:          "ภาคกลาง",
			Image:        "wongnai",
			Sodium: 	0 ,
			Potassium: "",
			Credit: 		"https://www.wongnai.com/recipes/chicken-tom-yum?ref=ct",
		}
		ok, err := govalidator.ValidateStruct(menu)

		g.Expect(ok).NotTo(BeTrue())
		g.Expect(err).NotTo(BeNil())

		g.Expect(err.Error()).To(Equal("Image must be a valid URL"))

	})
}

func TestMenuCredit(t *testing.T) {
	g := NewGomegaWithT(t)

	t.Run(`credit is required`, func(t *testing.T) {
		menu := entity.Menu{
			AdminID: 1,
			Title:      "ต้มยำไก่บ้านน้ำใส",
			Description: "วัตถุดิบต้มยำไก่บ้านน้ำใส 1.ไก่บ้านติดกระดูกสับเป็นชิ้นพอคำ 320 กรัม 2.หอมแดง 2 หัวเล็ก 3.ตะไคร้ 2 ต้น 4.ต้นหอม 2 ต้น 5.ผักชีใบเลื่อย 1 ต้นใหญ่ 6.ใบมะกรูด 4 ใบเล็ก 7.มะนาว 1 ลูก 8.ข่า 3 แว่น 9.พริกขี้หนู 7 เม็ด 10.เห็ดนางฟ้า 50 กรัม 11.มะเขือเทศลูกเล็ก 3 ลูก 12.น้ำปลา 2-3 ช้อนโต๊ะ วิธีทําต้มยําไก่บ้านน้ำใส Step 1 : เตรียมวัตถุดิบ 1.สับไก่เป็นชิ้น ๆ พักไว้ 2.หั่นตะไคร้เป็นท่อน ๆ หั่นข่าเป็นแว่น และฉีกใบมะกรูดไว้ บุบพริกขี้หนูและหอมแดง ฉีกเห็ดนางฟ้าเป็นเส้น ๆ รวมทั้งหั่นต้นหอมและผักชีใบเลื่อยเป็นท่อน ๆ 3.ตั้งน้ำร้อนให้เดือด ลวกไก่ที่หั่นแล้วพอสุก แล้วพักไว้ก่อน เพื่อให้น้ำไก่ เลือด และสิ่งปนเปื้อนทั้งหลายออกไปก่อน แล้วค่อยนำมาปรุงในต้มยำ 4.สับไก่เป็นชิ้น ๆ พักไว้ 5.นำไก่ที่หั่นแล้วไปลวกพอสุก Step 2 : ทำต้มยำ 1.ตั้งน้ำสะอาดให้เดือด แล้วใส่ข่า ตะไคร้ ใบมะกรูด หอมแดง และมะเขือเทศลงไป ต้มสักครู่จนน้ำเดือดอีกครั้ง แล้วใส่พริกขี้หนูบุบลงไป 2.ใส่ไก่ที่ลวกไว้เมื่อสักครู่ลงไป ต้มต่อจนน้ำเดือด ระหว่างนั้นให้ช้อนฟองออก จะทำให้น้ำใส 3.ใส่เห็ดนางฟ้าลงไฟ คนให้ทั่ว แล้วปรุงรสด้วยน้ำปลา ปิดไฟ ใส่ต้นหอม และผักชีใบเลื่อย 4.ใส่ไก่ลงเคี่ยวกับเครื่องสมุนไพรต่าง ๆ 5.หมั่นช้อนฟองออกให้น้ำใส Step 3 : จัดเสิร์ฟ 1.ตักต้มยำไก่ของเราที่กำลังร้อน ๆ ใส่ถ้วยที่เตรียมไว้ 2.บีบมะนาวลงไป การบีบมะนาวหลังจากปิดไฟแล้วแบบนี้ จะช่วยให้ต้มยำของเราหอมมะนาวยิ่งขึ้น",
			Region:          "ภาคกลาง",
			Image:        "https://img.wongnai.com/p/800x0/2023/03/29/e87ca6e0b3744f23a3b593349e48677b.jpg",
			Sodium: 	0 ,
			Potassium: "",
			Credit: 		"",
		}
		ok, err := govalidator.ValidateStruct(menu)

		g.Expect(ok).NotTo(BeTrue())
		g.Expect(err).NotTo(BeNil())

		g.Expect(err.Error()).To(Equal("Credit is required"))

	})
}

func TestMenuValid(t *testing.T) {
	g := NewGomegaWithT(t)

	t.Run(`valid`, func(t *testing.T) {
			menu := entity.Menu{
			AdminID: 1,
			Title:      "ต้มยำไก่บ้านน้ำใส",
			Description: "วัตถุดิบต้มยำไก่บ้านน้ำใส 1.ไก่บ้านติดกระดูกสับเป็นชิ้นพอคำ 320 กรัม 2.หอมแดง 2 หัวเล็ก 3.ตะไคร้ 2 ต้น 4.ต้นหอม 2 ต้น 5.ผักชีใบเลื่อย 1 ต้นใหญ่ 6.ใบมะกรูด 4 ใบเล็ก 7.มะนาว 1 ลูก 8.ข่า 3 แว่น 9.พริกขี้หนู 7 เม็ด 10.เห็ดนางฟ้า 50 กรัม 11.มะเขือเทศลูกเล็ก 3 ลูก 12.น้ำปลา 2-3 ช้อนโต๊ะ วิธีทําต้มยําไก่บ้านน้ำใส Step 1 : เตรียมวัตถุดิบ 1.สับไก่เป็นชิ้น ๆ พักไว้ 2.หั่นตะไคร้เป็นท่อน ๆ หั่นข่าเป็นแว่น และฉีกใบมะกรูดไว้ บุบพริกขี้หนูและหอมแดง ฉีกเห็ดนางฟ้าเป็นเส้น ๆ รวมทั้งหั่นต้นหอมและผักชีใบเลื่อยเป็นท่อน ๆ 3.ตั้งน้ำร้อนให้เดือด ลวกไก่ที่หั่นแล้วพอสุก แล้วพักไว้ก่อน เพื่อให้น้ำไก่ เลือด และสิ่งปนเปื้อนทั้งหลายออกไปก่อน แล้วค่อยนำมาปรุงในต้มยำ 4.สับไก่เป็นชิ้น ๆ พักไว้ 5.นำไก่ที่หั่นแล้วไปลวกพอสุก Step 2 : ทำต้มยำ 1.ตั้งน้ำสะอาดให้เดือด แล้วใส่ข่า ตะไคร้ ใบมะกรูด หอมแดง และมะเขือเทศลงไป ต้มสักครู่จนน้ำเดือดอีกครั้ง แล้วใส่พริกขี้หนูบุบลงไป 2.ใส่ไก่ที่ลวกไว้เมื่อสักครู่ลงไป ต้มต่อจนน้ำเดือด ระหว่างนั้นให้ช้อนฟองออก จะทำให้น้ำใส 3.ใส่เห็ดนางฟ้าลงไฟ คนให้ทั่ว แล้วปรุงรสด้วยน้ำปลา ปิดไฟ ใส่ต้นหอม และผักชีใบเลื่อย 4.ใส่ไก่ลงเคี่ยวกับเครื่องสมุนไพรต่าง ๆ 5.หมั่นช้อนฟองออกให้น้ำใส Step 3 : จัดเสิร์ฟ 1.ตักต้มยำไก่ของเราที่กำลังร้อน ๆ ใส่ถ้วยที่เตรียมไว้ 2.บีบมะนาวลงไป การบีบมะนาวหลังจากปิดไฟแล้วแบบนี้ จะช่วยให้ต้มยำของเราหอมมะนาวยิ่งขึ้น",
			Region:          "ภาคกลาง",
			Image:        "https://img.wongnai.com/p/800x0/2023/03/29/e87ca6e0b3744f23a3b593349e48677b.jpg",
			Sodium: 	0 ,
			Potassium: "",
			Credit: 		"https://www.wongnai.com/recipes/chicken-tom-yum?ref=ct",
		}
		
		ok, err := govalidator.ValidateStruct(menu)

		g.Expect(ok).To(BeTrue())
		g.Expect(err).To(BeNil())
	})
}